{
  "filename": "DoD_FY2026_Mandatory_Funding_Overview.pdf",
  "total_pages": 21,
  "pages": [
    {
      "page": 1,
      "text": "1 \n \n \n \n \n \n \n \n \n \nDepartment of Defense  \nFiscal Year 2026  \nMandatory Funding Overview \n \nJuly 2025 \n \nThe estimated cost of this report or study for the Department of Defense is approximately $19,000 for \nthe 2025 Fiscal Year. This includes $1,000 in expenses and $18,000 in DoD labor. \nGenerated on 2025Aug11 RefID: 8-C4E482F"
    },
    {
      "page": 2,
      "text": "2 \n \nDepartment of Defense FY 2026 Mandatory Funding \n \nExecutive Summary \n \nThe Department of Defense (DoD) mandatory budget submission of $113.3 billion is an integral \npart of the DoD FY 2026 topline of $961.6 billion and complements the $848.3 billion in \nrequested discretionary resources.  The mandatory budget supports key Department priorities \nnecessary to meet guidance contained in the Interim National Defense Strategic Guidance and to \nmaneuver and succeed in the challenging global environment of today.  These mandatory funds \nwill reverse years of unsecured borders, increasing air and missile threats, and systemic under-\ninvestment in our military by enabling DoD to protect the U.S. Homeland, combat China’s \nunprecedented military buildup, and Restore the Warrior Ethos.   \n \nSummary of Mandatory Requirements \nThe DoD requested $113.3 billion in FY 2026 mandatory funds provided through the \nreconciliation process.  DoD’s mandatory funding request is 88 percent aligned with the House \nArmed Service Committee (HASC) markup that was the basis for the mandatory funding \nreflected in FY 2026 DoD President’s Budget justification materials.  The request is broken \ndown by congressional section as shown in Table 1.   \n \nTable 1: Requirements by Congressional Section ($M) \nCongressional Section Congressional Category \nRequest  \n($ in millions) \n20001 Quality of Life $8,246  \n20002 Shipbuilding $30,567  \n20003 Missile Defense $25,559  \n20004 Munitions & Supply Chain $8,738  \n20005 Low-Cost Weapons $4,893  \n20006 Cyber Security $1,000  \n20007 Air Superiority $5,742  \n20008 Nuclear $8,974  \n20009 INDOPACOM Capabilities $6,668  \n20010 Readiness $7,912  \n20011 \nHomeland Border Security \nInitiatives $5,000  \nGrand Total   $113,300  \n*Numbers may not add due to rounding."
    },
    {
      "page": 3,
      "text": "3 \n \nTable of Contents \n   \nSection Category     Page \n20001     Quality of Life 4 \n20002     Shipbuilding 7 \n20003     Missile Defense 9 \n20004      Munitions & Supply Chain 10 \n20005      Low-Cost Weapons 12 \n20006      Cyber Security and Efficiency 13 \n20007      Air Superiority 14 \n20008     Nuclear 15 \n20009      INDOPACOM Capabilities 16 \n20010 Readiness 18 \n20011 Homeland Border Security Initiatives 19 \n   \nAppendix  20"
    },
    {
      "page": 4,
      "text": "4 \n \nSection 20001:  Quality of Life \n \nFunds in this section focus on Restoring the Warrior Ethos and include resources to enhance the \nquality of life for our Service members by addressing critical requirements for housing, childcare \nand tuition assistance, Permanent Change of Station (PCS), and other enhancements.  The table \nbelow provides funding details. \n \nDetail of Request \nRequest  \n($ in millions) \nHousing in High-Cost Areas $500 \nDefense Activity for Non-Traditional Education Support, Online Academic \nSkills Course $10 \nDefense Health Program $2,000 \nAir Force Facilities, Sustainment, Restoration and Modernization (FSRM) $2,500 \nBarracks funding $1,488  \nServicemember bonuses, special pays, incentive pays $50 \nServicemember childcare fee assistance $100 \nServicemember tuition assistance $100 \nTemporary Lodging Expense, increase to 21 days $137  \nUSMC Barracks 2030 base operating support $119  \nUSMC Barracks 2030 restoration and modernization $1,242  \n Total Quality of Life $8,246  \n*Numbers may not add due to rounding. \nDescription:  Funding in this section will improve living and working conditions for Service \nmembers and their families by addressing deferred maintenance in unaccompanied housing and \noperational facilities, sustaining base operating support, and mitigating housing payments in \nareas with the highest cost of living.  In addition, funds support expanded PCS benefits that will \nmake PCS transitions less burdensome for Service members and their families.     \n \nHousing in High-Costs Areas:  Funding provides supplemental payments to military personnel \nto secure suitable housing in areas with a high cost of living.  While rent increases in most of the \ncountry are moderating, several high-cost housing markets are continuing to increase due to \ncritical shortages of suitable housing.  The DoD approved similar increases for 26 Military \nHousing Areas (MHA) in 2021 and for 28 MHAs from October 1 through December 31, 2022.  \nBased on recommendations from the 14th Quadrennial Review of Military Compensation, the \nDoD is improving the Basic Allowance for Housing (BAH) calculation methodology to reduce \nrate volatility, better match rates with available housing types, and reduce the lag time between \nmarket changes and updates to the rates.  The 2024 HASC Quality of Life Panel report \nrecommendation also addressed increased housing costs.   \n \nDefense Activity for Non-Traditional Education Support, Online Academic Skills Course:  \nFunding provides online, self-paced, academic skills training to help military members gain the \nknowledge they need to complete education credentials and college degree programs, advance in \ntheir military careers, and successfully transition into the civilian workforce.  The Online"
    },
    {
      "page": 5,
      "text": "5 \n \nAcademic Skills Course (OASC) provides easy-to-use instruction to help Service members build \nfoundational academic skills in math, English, and science that can be used as a stand-alone \ncourse or as a supplement to other educational resources.  Service education counselors can also \nregister for an educator account to track student progress and provide further guidance. \n \nDefense Health Program:  Funding restores and modernizes aging medical facilities, addresses \nchronic understaffing at military medical treatment facilities (MTF), and supports digitizing \nhealthcare records.  The challenges facing the military health system include a significant \nbacklog of deferred maintenance projects with facilities that have reached or exceeded their \nrecapitalization age, a severe shortage of medical staffing within the direct care system, and a \ndegraded operational information technology (IT) infrastructure.  These investments will \nenhance force readiness and reinforce the Department’s commitment to produce medically ready \nand ready medical forces. \n \nAir Force FSRM:  Funding sustains and addresses the maintenance and repair activities \nnecessary to keep facilities in working order; restoration funds to repair damage due to age, \ninadequate sustainment, disaster, fire, or accidents; and modernization funding to alter or replace \nfacilities to meet new standards or accommodate new functions.  This will enable the Air Force \nto address their FSRM backlog.   \n \nBarracks funding:  Funding maintains aging infrastructure in poor or failing conditions that has \nbeen chronically under-sustained.  Improvements prioritize heating, ventilation, air conditioning \n(HVAC), electrical, and plumbing systems that improve the overall habitability of \nunaccompanied housing facilities.  This will allow the Services to address systemic under \nfunding of this critical element to support Service members and address concerns raised by the \nGovernment Accountability Office and 2024 HASC Quality of Life Panel.   \n \nServicemember bonuses, special pays, incentive pays:  Funding maintains U.S. Marine Corps \n(USMC) enlisted bonuses in targeted Military Operational Specialties (MOS) to match FY 2024 \ncosts.  The additional funds are required for recruitment bonuses and selective reenlistment \nbonuses in critical MOSs to support maintaining the force structure of the USMC, maintain \nrecruiting momentum, and continue to emphasize retaining the best Marines.  These incentives \nwill also encourage potential recruits to begin initial training during specific times of the year to \nreduce gaps in the Fleet Marine Force manning. \n \nService member childcare fee assistance:  The Department of Defense provides fee assistance \nto support military families when on-base care is unavailable.  Eligible service members and \nDoD civilians may receive subsidies through programs like Military Child Care in Your \nNeighborhood (MCCYN).  The 2024 HASC Quality of Life Panel recommends full funding in \nthe FY25 NDAA to eliminate waitlists and ensure accessible care for qualifying families and \nstaff. \n \nService member tuition assistance:  Funding provides Service member voluntary off-duty \neducation programs designed to support professional and personal developmental goals.  Classes \nmust be from accredited two-year or four-year institutions, and members may incur service \nobligations."
    },
    {
      "page": 6,
      "text": "6 \n \n \nTemporary Lodging Expense (TLE):  Funding provides up to seven additional days of TLE, \nand increase from 14 to 21 days, to increase the allowable time members have to find appropriate \nhousing when they move to an area with a shortage of available rental units.  Frequent PCS \nmoves and associated family disruptions are key reenlistment and congressional concerns.  The \nDepartment must take care of families to minimize disruptions that take Service member focus \naway from building the lethality and readiness needed to fight and win future wars. \n \nUSMC Barracks 2030 base operating support and restoration and modernization:  Funding \nenables and unprecedented infrastructure investment for the Marine Corps, aimed at providing \nsafe, modern living conditions for unaccompanied Marines.  This reflects the Department’s \ncommitment to build readiness through the FSRM of existing facilities to enhance the overall \nquality of life.  This commitment also includes adequately maintaining its infrastructure to \nprevent degradation and will have a direct impact on mission training to generate readiness for \nglobal employment in support of critical operations.  Funding will address the Government \nAccountability Office findings and concerns in their 2023 barracks audit report."
    },
    {
      "page": 7,
      "text": "7 \n \nSection 20002:  Shipbuilding \n \nFunds in this section provide resources necessary to support the Department of Navy’s \nshipbuilding plan and revitalize the Nation’s shipbuilding industrial base.  The table below \nprovides funding details. \n \nDetail of Request \nRequest \n($ in millions) \nAmerica-class Amphibious Assault Ship (LHA) $3,700 \nCommercial logistics ships $100 \nCost-to-complete ships $505 \nDry-dock capability $830 \nGuided Missile Destroyer (DDG), two additional ships $5,400 \nLanding Ship Medium (incl. Advance Procurement) $1,964  \nLeasing of ships for Marine Corps operations $159  \nMaritime robotic autonomous systems and enabling technologies $188  \nMedium unmanned surface vessel production $1,191 \nMulti-ship amphibious warship contract $695 \nNational Defense Sealift Fund, lease or purchase of new ships $600 \nSubmarine Industrial Base (SIB) lines $4,487  \nSan Antonio-class Amphibious Transport Dock (LPD) $2,100  \nSecond Landing Craft Utility shipyard and additional Landing Craft Utility $295  \nShip-to-Shore Connectors $295  \nSmall unmanned surface vessel production $809  \nT-AO Oilers $1,853 \nTest Resource Management Center robotic autonomous systems proving \nground $34  \nUnmanned underwater vessel production $431 \nVertical Launch System reloading at sea $80  \nVirginia-class Submarine, second submarine in FY 2026 $4,600  \nWave-powered unmanned underwater vehicles $250  \n Total Shipbuilding $30,567  \n*Numbers may not add due to rounding. \n \nDescription:  The mandatory shipbuilding request includes funds for the Shipbuilding and \nConversion, Navy (SCN) appropriation, as well as for Other Procurement, Navy, Operations and \nMaintenance, Navy, Research, Development, Test, and Evaluation (RDT&E), Navy, and \nResearch, Development, Test, and Evaluation (RDT&E), Defensewide.   \n \nThe total FY 2026 request for the SCN funding is $47.4 billion and consists of $20.8 billion in \ndiscretionary and $26.5 billion in mandatory SCN funding.  This historic level represents the"
    },
    {
      "page": 8,
      "text": "8 \n \nlargest single-year investment in shipbuilding since the end of the Cold War and sends a strong \nmessage of commitment to our Nation’s shipbuilders.  The FY 2026 request supports 19 battle \nforce ships (three in discretionary and 16 in mandatory), invests in unmanned surface \ncapabilities, and supports our essential shipbuilding industrial base.  This budget strengthens our \ncritical nuclear shipbuilding industrial base with investments in infrastructure, workforce, and \nadvanced manufacturing capabilities.  Enhancements to the shipyards include workforce wage \nsupplements, construction productivity improvements, and critical maintenance toward the ship \nrepair base.  In addition to invigorating American manufacturing, these industrial investments \nsupport future international burden-sharing with capable allies through the Australia, United \nKingdom, and United States (AUKUS) agreement.   \n \nHighlights from the mandatory SCN request are as follows: \n SSN 774 (Virginia) – Procures one (of two) Virginia Class submarine in FY 2026.  \n DDG 51 (Arleigh Burke) – Procures two DDG-51 destroyers in FY 2026.  \n LHA(R) (America) – Procures one LHA(R) Amphibious Landing ship in FY 2026 and \nfunds shortfalls for the Amphibious Multi-Ship contract.  \n LPD Flt II (San Antonio) – Procures one LPD-17 Amphibious Transport ship in FY 2026 \nand funds shortfalls for the Amphibious Multi-Ship contract. \n T-AO 205 (John Lewis) – Funds the procurement of two T-AO Oilers in FY 2026.  \n Medium Landing Ship (LSM) – Funds the procurement of nine LSMs in FY 2026, which \nincludes a mix of Block 1 and Block Next variants.  \nOf the $4.487 billion for Submarine Industrial Base efforts, $2.542 billion will support Nuclear \nShipyard Productivity Enhancements, which includes funding for $0.615 billion for wage \nenhancements and $1.926 billion for shipyard investments to improve productivity.  The \nmandatory funding also enables numerous efforts to expand and modernize the maritime \nindustrial base by investing in new technologies and manufacturing processes.  \nMandatory funding also addresses critical shipyard repairs to sustain the fleet and continue \nscheduled Naval operations as well as necessary shipyard upgrades such as dry-dock seismic \nresiliency at Puget Sound Naval Shipyard."
    },
    {
      "page": 9,
      "text": "9 \n \nSection 20003:  Missile Defense \n \nFunds in this section provide resources necessary to support the Department’s efforts to \nreestablish deterrence by defending our homeland.  The resources will enable the Department to \nbegin the development and deployment of the Golden Dome, a next-generation missile defense \nshield to protect the U.S. from all adversaries.  The table below provides funding details. \n \nDetail of Request \nRequest \n($ in millions) \nClassified space superiority programs, Strategic Capabilities Office - \nClassified $300 \nMulti-Service Advanced Capability Hypersonic Test Bed program $400 \nGolden Dome  $24,859 \n Total Missile Defense    $25,559 \n*Numbers may not add due to rounding. \n \nDescription:  Funds in this section enable the DoD to begin development of a multi-domain \nsensor architecture, including proliferated space-based sensors and next-generation ground-based \nradar, along with command-and-control systems to integrate new sensors and provide battle \nmanagement of ground- and space-based interceptors.  Funds also provide capabilities for left-\nof-launch missile defeat initiatives to destroy or degrade adversary missiles prior to launch, to \ndevelop novel intercept capabilities, such as space-based interceptors and directed energy, and \nincrease procurement of current interceptors like the Patriot Missile Segment Enhancement \n(MSE)."
    },
    {
      "page": 10,
      "text": "10 \n \nSection 20004:  Munitions & Supply Chain \n \nFunds in this section provide resources for development and procurement of weapons useable \nacross multiple domains and all Military Departments.  These efforts include the development of \nnew air and ground-launched systems; increased procurement of existing missiles, mines, \ntorpedoes and other munitions; critical one-way attack unmanned aerial systems (UAS) and \ndefensive counter-UAS solutions; and improved resilient and secure supply chains.  The table \nbelow provides funding details. \n \nDetail of Request \nRequest  \n($ in millions) \nAlternative Navy and Air Force long-range air-to-surface missiles $94  \nAnti-ship seeker for short-range Army ballistic missiles $100 \nArmy long-range ballistic missiles $85  \nArmy medium-range ballistic missiles $300  \nArmy missile repair $30  \nArmy next-generation medium-range anti-ship ballistic missiles $50 \nArmy next-generation medium-range ballistic missiles $100  \nArmy next-generation shoulder-fired air defense system $50  \nArmy shoulder-fired air defense system $60  \nCounter-unmanned aerial systems programs $500  \nDevelopment of new armaments cooperation programs $250  \nDoD industrial base policy analysis workforce $25  \nHeavyweight torpedoes $400  \nHeavyweight torpedo maintenance activities $70 \nIndustrial Base Fund grants $2,055  \nIndustrial Base Fund grants and purchase commitments $441  \nLand-based counter-unmanned aerial systems programs $250  \nLarge-diameter solid rocket motors for hypersonic missiles, second source $30 \nLightweight multi-mission torpedoes $55 \nLightweight torpedoes $200  \nLong-range multi-service cruise missiles $668  \nLong-range Navy air defense and anti-ship missiles $630  \nMaritime mines $255 \nMedium-range air-to-air missiles $250 \nMedium-range air-to-air missiles, mitigation of diminishing manufacturing \nsources $50  \nNavy and Air Force long-range air-to-surface missiles $490  \nNavy and Air Force long-range anti-ship missiles $400  \nNon-kinetic counter-unmanned aerial systems programs $350  \nOne-way attack unmanned aerial systems with advanced autonomy $50"
    },
    {
      "page": 11,
      "text": "11 \n \nDetail of Request \nRequest  \n($ in millions) \nShip-based counter-unmanned aerial systems programs $200  \nShort-range Navy and Marine Corps anti-ship missiles $70  \nSmall and medium ammunition $100  \nSonobuoys $80  \n Total Munitions and Supply Chain $8,738  \n*Numbers may not add due to rounding. \n \nDescription:   Funds in this section provide for multi-domain weapons development and \nprocurement across the Services.  Funding invests in the development of new air and ground-\nlaunched systems from non-traditional industry partners; increases procurement of existing \nmissiles, mines, torpedoes, and other munitions; and invests in critical one-way attack UAS and \ndefensive counter-UAS solutions.  The investments also build resiliency and secure supply \nchains for critical minerals, missiles and munitions, as well as castings and forgings, \nmicroelectronics, and batteries."
    },
    {
      "page": 12,
      "text": "12 \n \nSection 20005:  Low-Cost Weapons \n \nFunds in this section provide resources necessary to support the Department’s efforts to innovate, \nexperiment, prototype, and rapidly scale cutting-edge science and technology programs into low-\ncost munitions for the warfighter.  The resources will enable the DoD to build capability and \ncapacity for weapons manufacturing.  The table below provides funding details. \n \nDetail of Request \nRequest  \n($ in millions) \nAdvancement of artificial intelligence ecosystem $250 \nAlternative positioning and navigation technology for contested \nelectromagnetic environments \n \n$40 \nArtificial intelligence for one-way attack unmanned aerial systems and naval \nsystems $145 \nAttritable autonomous military capabilities, prevent delays $359 \nCyber Command artificial intelligence lines of effort $500 \nDefense Innovation Unit scaling of commercial technology for military use $906 \nJoint Fires Network, joint battle management capabilities $282 \nLong-endurance unmanned aerial systems for surveillance $120 \nLow-cost cruise missiles $1,103 \nOffice of Strategic Capital credit programs and Global Technology Scout \nprogram $301 \nQuantum Benchmarking Initiative $250 \nReusable hypersonic technology for military strike and intelligence $90 \nSmall modular nuclear reactors for military use $79 \nStrategic Capabilities Office programs $340 \nTest Resource Management Center digital test environment $128 \n Total Low-Cost Weapons $4,893 \n*Numbers may not add due to rounding. \n \nDescription:  Funds in this section enable investment in innovative low-cost, high-impact \ncapabilities leveraging commercial technology and production methods.  Funds provide for new \ntest and development ecosystems, advanced computing technologies such as quantum and \nartificial intelligence, and scaled, affordable hypersonic flight testing by non-traditional \ncontractors and commercial launch providers.  Investments procure additional one-way-attack \nsystems with artificial intelligence (AI)-enabled autonomy, new “affordable mass” cruise \nmissiles designed for adaptability and producibility at scale by promising new entrants into the \nmunitions industrial base, and AI capabilities for enhanced cyber operations.  Finally, the \nmandatory request invests in the industrial base by expanding the use of the Office of Strategic \nCapital, developing miniaturized nuclear energy, and reducing risk in autonomous platform \nproduction."
    },
    {
      "page": 13,
      "text": "13 \n \nSection 20006:  Cyber Security \n \nDetail of Request \nRequest  \n($ in millions) \nClassified Cyber $1,000 \n Total Cyber Security $1,000 \n \nDescription:   Funds in this section provide resources for a priority classified effort."
    },
    {
      "page": 14,
      "text": "14 \n \nSection 20007:  Air Superiority \n \nFunds in this section provide essential support and modernization for critical aviation platforms, \nto include improvements in survivability, lethality, and range for the world’s first crewed 6th \ngeneration fighter, the F-47.  The table below provides funding details. \n \nDetail of Request \nRequest  \n($ in millions) \nAdvanced Aerial Sensors $100 \nC-130J production $214 \nC-17A Mobility Aircraft Connectivity $74 \nCollaborative Combat Aircraft program $678 \nEA-37B production $254 \nF-15EX fighter $3,128 \nF-16 electronic warfare capability $50 \nF-47 production $900 \nKC-135 Mobility Aircraft Connectivity $84 \nMQ-25 production $100 \nV-22 nacelle improvement $160 \n Total Air Superiority  $5,742 \n*Numbers may not add due to rounding. \n \nDescription:  Funds in this section improve U.S. air superiority through sustained investments in \ncrewed and uncrewed combat platforms, critical enablers, and upgrades to existing systems.  \nFunding supports the F-47, fielding the cutting-edge autonomous capability of the Collaborative \nCombat Aircraft, and increased procurement of the F-15EX.  Mandatory funds also enable \nmodernization of current combat platforms including F-22 advanced sensors and F-16 electronic \nwarfare, and enhancement to the C-130, C-17 airlift, KC-135, MQ-25 aerial tanking, EA-37B \nelectronic warfare, and V-22 special operations support."
    },
    {
      "page": 15,
      "text": "15 \n \nSection 20008:  Nuclear \n \nFunds in this section provide resources to support major recapitalization efforts across the three \nlegs of the nuclear triad, to include critical command and control capabilities.  The table below \nprovides funding details. \n \nDetail of Request \nRequest  \n($ in millions) \nB-21 long-range bomber aircraft $4,491 \nIntercontinental ballistic missile reentry vehicles $100 \nMH-139 helicopters $210 \nMinuteman III intercontinental ballistic missile program $500 \nNuclear-armed sea-launched cruise missile $2,000 \nOHIO-class submarine tube conversion $62 \nSentinel intercontinental ballistic missile program, risk reduction activities $1,500 \nSurvivable Airborne Operations Center program $110 \n Total Nuclear $8,974 \n*Numbers may not add due to rounding. \n \nDescription:  Funds in this section accelerate procurement of B-21 bombers in support of the air \nleg of the triad.  For the land-based launch leg of the triad, mandatory funds procure new reentry \nvehicles for the intercontinental ballistic missile (ICBM) force; procurement of MH-139 \nhelicopters; sustainment of the Minuteman III weapon system during transition to Sentinel; and \nrisk reduction in the Sentinel program.  For the sea domain, funds provide for development of a \nnuclear-armed Sea-Launched Cruise Missile (SLCM-N) to add a theater-level nuclear capability \nand enable tube conversion in OHIO-class submarines to add missile capacity.  Funds also \nsupport worldwide, survivable and endurable command and control, enabling nuclear force \ndirection, coordination of national civil authorities, and continuity of operations and government \nthrough all stages of conflict."
    },
    {
      "page": 16,
      "text": "16 \n \nSection 20009:  INDOPACOM Capabilities \n \nFunds in this section address critical DoD efforts in the U.S. Indo-Pacific Command \n(USINDOPACOM) area of responsibility to counter the unprecedented Chinese military buildup \nand the growing threats to U.S. security interests and economic prosperity in the region.  These \ninvestments enable the Department to strengthen deterrence capabilities, enhance regional \npartnerships, and defend vital U.S. interests through a comprehensive, multi-domain approach.  \nThe table below provides funding details. \n     \nDetail of Request \nRequest  \n($ in millions) \nAirfields in INDOPACOM, Infrastructure in INDOPACOM,  $934 \nAnti-submarine sonar arrays $11 \nArmy exercises and operations in Western Pacific, SOCOM exercises and \noperations in Western Pacific, Marine Corps exercises and operations in \nWestern Pacific, Air Force exercises and operations in Western Pacific, \nPacific Air Force biennial large-scale exercise, Exercises with Taiwan $221 \nClassified military space superiority programs $3,375 \nDARC and SILENTBARKER military space domain awareness programs $455 \nJoint Training Team INDOPACOM managed training efforts for Taiwan $212 \nISR capabilities for AFRICOM $30 \nMilitary additive manufacturing capabilities in INDOPACOM west of the \ninternational dateline $35 \nMission networks for INDOPACOM $5 \nOffensive cyber operations $540 \nTaiwan Drawdown Stock Replenishment $850 \nTotal INDOPACOM Capabilities  $6,668 \n*Numbers may not add due to rounding. \n \nDescription:  Funds in this section enable strategic investments and activities that enhance U.S. \nforce posture, infrastructure, presence, and readiness (exercises and training) throughout the \nIndo-Pacific region, with emphasis on areas west of the International Date Line that directly \nsupport DoD efforts to maintain regional stability and deter aggression in this vital theater. \nAirfields and other Infrastructure in Indo-Pacific Command (INDOPACOM):  Funding \nprovides for advanced planning, design, and construction of critical infrastructure improvements, \nincluding expanded airfields and seaports, to enhance U.S. military readiness and responsiveness \nin the region.  These investments will enable a more flexible and sustainable U.S. force posture \nby expanding capacity, improving defenses, and creating resilient logistical networks.  Funding \nalso provides for land acquisition to support establishing U.S. defense sites in Palau. \nAnti-submarine sonar arrays:  Funding invests in the development and acquisition of fixed \ndistributed systems providing information for undersea warfare and invests in surveillance"
    },
    {
      "page": 17,
      "text": "17 \n \nsystems to accelerate delivery of capabilities to meet warfighter requirements for advanced \nsensors to counter threats in the region.  \nExercises:  Funding expands joint training exercises throughout the region to enhance warfighter \nlethality, interoperability, and combat readiness.  These investments strengthen the \nUSINDOPACOM's ability to conduct complex, multi-domain operations with allies and \npartners, building collective defense capabilities and demonstrating U.S. commitment to regional \nsecurity. \nClassified military space superiority and space domain awareness programs:  Funding \nsupports classified activities.   \nINDOPACOM managed training efforts for Taiwan:  Funding supports bilateral engagements \nand enhanced joint force interoperability through the acquisition of secure communications \nequipment and the associated travel required to facilitate training with allies and partners across \nthe region.  \nIntelligence, Surveillance, and Reconnaissance (ISR) capabilities for Africa Command \n(AFRICOM):  Funding provides critical ISR capabilities to enable deterrence of adversaries and \nsupport effective targeting and engagement in the USAFRICOM area of responsibility. \nMilitary additive manufacturing capabilities in INDOPACOM west of the International \nDate Line:  Provides funding for technology to develop new capabilities such as on-demand \nmanufacturing and rapid prototyping, which can enable warfighters to employ innovative \nsolutions on the battlefield. \nMission networks for INDOPACOM:  Provides funding for secure and resilient information-\nsharing networks that enable real-time collaboration and coordination with allies and partners \nacross the Indo-Pacific region.  These mission-critical systems incorporate advanced \ncybersecurity capabilities, data-centric collaboration tools, and situational awareness applications \nwhich enhance the USINDOPACOM’s ability to share information and conduct operations in a \nsecure and agile manner. \nOffensive cyber operations:  Provides funding for operations `critical to the development of \ncapabilities to defend against and respond to cyberattacks, protect critical infrastructure and \nmilitary systems from cyberattacks, and project power and gather intelligence in cyberspace.   \nTaiwan Drawdown Stock Replenishment:  Funds the replacement of defense articles \ntransferred to Taiwan from DoD stocks through Presidential Drawdown Authority.  Funds will \nbolster joint force readiness and enable new procurements to replace equipment provided to \nTaiwan."
    },
    {
      "page": 18,
      "text": "18 \n \nSection 20010:  Readiness \n \nFunds in this section focus on Rebuilding our Military and ensuring that the Department is able \nto fulfill assigned missions and meet operational demands.  The requirements focus on \nequipment and materiel readiness necessary to support military operations and mitigate \noperational readiness challenges.  The table below provides funding details. \n \nDetail of Request \nRequest \n($ in millions) \nArmy depot modernization and capacity enhancement, Navy Depot and \nshipyard modernization and capacity enhancement, Air Force depot \nmodernization and capacity enhancement $3,750 \nMaritime spares and repair rotatable pool for amphibious ships $116 \nMaritime spares and repair rotatable pool $789 \nReadiness packages to keep Air Force aircraft mission-capable $2,118 \nSpecial Operations Command equipment and readiness $1,139 \nTotal Readiness $7,912 \n*Numbers may not add due to rounding. \n \nDescription:  Funds in this section address weapon system spares and readiness packages to \nimprove availability of aging aircraft and ships, with a specific set aside for F-35 sustainment.  In \naddition, funds provide for a generational investment in the organic depots to modernize depot \noperations, equipment, and facilities that are necessary to optimize maintenance efficiency, \nincluding both military depots and shipyards.  Funding also enhances capabilities for U.S. \nSpecial Operations Command (SOCOM) support to the USINDOPACOM."
    },
    {
      "page": 19,
      "text": "19 \n \nSection 20011:  Homeland Border Security Initiatives \n \nFunds in this section focus on DoD support to the Department of Homeland Security (DHS) in \nthe areas of border security and detention support.  The table below provides funding details. \n \nDetail of Request \nRequest \n($ in millions) \nBorder Security $2,000 \nDetention Activities $3,000 \n Total Homeland Border Security Initiatives $5,000 \n \nDescription:  Funds in this section enable DoD support to the DHS for initiatives including: \nBorder Security:  DoD border security operations include military personnel, inclusive of \ncommand and control, and other enabling personnel, performing detection and monitoring, \ninformation analysis, and aviation missions related to border security.  In addition, the DoD \nprovides mission-enhancing capabilities through information analysis, detection and monitoring, \nmaritime and aerial reconnaissance, and sustainment and logistics.  Border security operations \nalso include protecting and maintaining the security of military installations, including in the \nNational Defense Areas. \nDetention Activities:  At the request of DHS, and with approval by the Secretary of Defense, \nDoD augments the DHS efforts in the detention and secure transfer of illegal aliens by \ntemporarily holding illegal aliens at continental United States (CONUS) sites and Naval Station \nGuantanamo Bay.  Detention activities include contracted services and the operating costs."
    },
    {
      "page": 20,
      "text": "20 \n \nAPPENDIX \n \n \nService FY 2026\nDepartment of Army 5,353.3      \nDepartment of Navy 43,317.8    \nDepartment of Air Force 38,561.4    \nDefense-Wide 26,067.5    \nGrand Total 113,300.0  \nAppropriation FY 2026\nMilitary Personnel, Army 180.0         \nReserve Personnel, Army 6.9             \nNational Guard Personnel, Army 15.2           \nOperation and Maintenance, Army 2,111.4      \nOperation and Maintenance, Army Reserve 76.1           \nOperation and Maintenance, Army National Guard 127.9         \nMissile Procurement, Army 1,599.4      \nOther Procurement, Army 389.9         \nResearch, Development, Test and Evaluation, Army 846.5         \nGrand Total 5,353.3      \nAppropriation FY 2026\nMilitary Personnel, Navy 169.8         \nMilitary Personnel, Marine Corps 118.4         \nReserve Personnel, Navy 5.2             \nReserve Personnel, Marine Corps 4.1             \nOperation and Maintenance, Navy 4,613.5      \nOperation and Maintenance, Marine Corps 1,853.5      \nAircraft Procurement, Navy 100.0         \nWeapons Procurement, Navy 2,247.5      \nProcurement of Ammunition, Navy and Marine Corps 125.0        \nShipbuilding and Conversion, Navy 26,544.2    \nOther Procurement, Navy 3,335.4      \nResearch, Development, Test and Evaluation, Navy 3,452.1      \nMilitary Construction, Navy and Marine Corps 749.2         \nGrand Total 43,317.8    \n($ in millions)\nFY 2026 Reconciliation - Department of Army\nFY 2026 Reconciliation - Department of Defense\nFY 2026 Reconciliation - Department of Navy\n($ in millions)\n($ in millions)"
    },
    {
      "page": 21,
      "text": "21 \n \n \n \n \nAppropriation FY 2026\nMilitary Personnel, Air Force 159.1         \nMilitary Personnel, Space Force 8.2             \nReserve Personnel, Air Force 5.2             \nNational Guard Personnel, Air Force 14.7           \nOperation and Maintenance, Air Force 4,293.8      \nOperation and Maintenance, Space Force 22.2           \nOperation and Maintenance, Air Force Reserve 60.6           \nOperation and Maintenance, Air National Guard 150.7         \nAircraft Procurement, Air Force 7,064.8      \nMissile Procurement, Air Force 1,935.5      \nProcurement, Space Force 264.4         \nOther Procurement, Air Force 699.6         \nResearch, Development, Test and Evaluation, Air Force 10,226.6   \nResearch, Development, Test, and Evaluation, Space Force 13,547.9   \nMilitary Construction, Air Force 102.1         \nMilitary Construction, Air National Guard 5.9             \nGrand Total 38,561.4    \nAppropriation FY 2026\nOperation and Maintenance, Defense-Wide 7,398.4      \nDefense Health Program 2,000.0      \nProcurement, Defense-Wide 7,359.6      \nDefense Production Act Purchases 29.0           \nDefense Strategic Capital Credit Program 249.6         \nResearch, Development, Test and Evaluation, Defense-Wide 8,897.8     \nOperational Test and Evaluation, Defense 98.0           \nMilitary Construction, Defense-Wide 35.0           \nGrand Total 26,067.5    \n($ in millions)\n($ in millions)\nFY 2026 Reconciliation - Defense-Wide\nFY 2026 Reconciliation - Department of Air Force"
    }
  ]
}