{
  "filename": "FY2025_Weapons.pdf",
  "total_pages": 112,
  "pages": [
    {
      "page": 1,
      "text": "Oﬃce of the Under Secretary of Defense\n(Comptroller)/Chief Financial Oﬃcer\nProgram Acquisition Cost by Weapon System\nMarch 2024\nUnited States Department of Defense\nFiscal Y ear 2025 Budget Request"
    },
    {
      "page": 2,
      "text": "The estimated cost of this report or \nstudy for the Department of Defense is \napproximately $45,000 for the 2024 \nFiscal Year. This includes $12,000 in \nexpenses and $33,000 in DoD labor. \n \n \nGenerated on 2024Feb28              RefID: 9-E6AAC8A"
    },
    {
      "page": 3,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \n \n i  Introduction \n \nNumbers may not add due to rounding \nMajor Weapon Systems \nOverview \nThe performance of United S tates weapon systems are unmatched, ensuring that our military \nforces have a tactical combat advantage over any adversary in any environmental situation.  The \nFiscal Year (FY) 2025 Investment (Procurement and Research, Development, Test, and Evaluation \n(RDT&E)) funding requested by the Department of Defense (DoD) totals $ 310.7 billion, which \nincludes $167.5 billion for Procurement and $143.2 billion for RDT&E.  The funding in the budget \nrequest represents a balanced portfolio approach for the implementation of the National Defense \nStrategy (NDS).  To simplify display of the various weapon systems being developed and procured \nin FY 2025, this book is organized by the following categories: \n• Aviation and Related Systems \n• Command, Control, Communications, \nComputers, and Intelligence (C4I) \nSystems \n• Ground Systems \n• Missile Defense Programs \n• Missiles and Munitions \n• Shipbuilding and Maritime Systems \n• Space Based Systems \n• Science and Technology (S&T) \n• Mission Support Activities \n \nFY 2025 Investment Total: $310.7 Billion \n \nAviation & \nRelated Systems \n$61.2\nC4I Systems \n$21.1\nGround \nSystems \n$13.0\nMissile \nDefense \nPrograms \n$13.5\nMissiles & \nMunitions \n$29.8\nMission \nSupport \nActivities \n$81.5\nScience & \nTechnology \n$17.2\nShipbuilding & \nMaritime \nSystems \n$48.1\nSpace Based \nSystems \n$25.2\n$ in Billions"
    },
    {
      "page": 4,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \n \n ii  Introduction \n \n$ in Billions \nThe Distribution of Funding in FY 2025 for Procurement and RDT&E by \nComponent and Category* \n \n \n  \n \n$0\n$10\n$20\n$30\n$40\n$50\n$60\n$70\n$80\n$90\n$100\nARMY NAVY AIR\nFORCE\nSPACE\nFORCE\nDEFENSE\nWIDE\n Space Programs\n Shipbuilding\n RDT&E S&T\n Munitions\n Missile Defense\n Ground Systems\n C4I Systems\n Aviation\n$0\n$10\n$20\n$30\n$40\n$50\n$60\n$70\nSPACE FORCE\nDEFENSE WIDE\nAIR FORCE\nNAVY\nARMY\n$ in Billions \n$ in Billions \n* Funding in Mission Support activities are not represented in the above displays."
    },
    {
      "page": 5,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \n \n iii  Introduction \n \n Major Defense Acquisition Programs \nTotal Requested Procurement and RDT&E Funding During FY 2025 \n for MDAP* and Non-MDAP Programs \n \n \nThe FY 2025 President’s Budget request for modernization in the RDT&E and Procurement titles \nis comprised of 2,313 Program, Project, and Activity (PPA) budget line items, of which 1,122 are \nin RDT&E and 1,191 are in Procurement .  Within these budget lines, there are 69 active Major \nDefense Acquisition Programs (MDAPs); 14 with the Army, 36 with the Navy, and 18 with the Air \nForce.  The Missile Defense programs are the only MDAP still under the Office of the Secretary of \nDefense.  Of the $310. 7 billion in Investment funding, MDAPs accounts  for $ 96.1 billion, or \napproximately 31 percent of the total funding. \n \nNot all MDAPs (Acquisition Category (ACAT) I) are represented in this book because they fall \nbelow reporting criteria*.  Furthermore, while non-MDAP individual programs are smaller in dollar \nvalue when compared to MDAPs, these ACAT II and ACAT III programs account for the majority \nof defense weapon expenditures. \n* An MDAP is an acquisition program that is designated by the Under Secretary of Defense for Acquisition and \nSustainment (USD (A&S); or is estimated to require an eventual total expenditure for Research, Development, Test, and \nEvaluation (RDT&E), including all  planned increments, of more than $480 million in Fiscal Year (FY) 2014 constant \ndollars or, for Procurement, including all planned increments, of more than $2.79 billion in FY  2014 constant dollars. \n  \nMDAP\n$96.1\nNON-MDAP\n$214.6\n$ in Billions"
    },
    {
      "page": 6,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \n \n iv  Introduction \n \nMission Area Categories \nThis book shows the major weapon systems funded in the FY 2025 President’s Budget, organized \nby Mission Area Categories.  Mission Area Categories include funding from both the RDT&E and \nProcurement programs.  The below chart illustrates the budget allocation between RDT&E and \nProcurement with the distribution by each Mission Area Category.  \n \n \nEach Mission Area Category chapter heading further breaks out the funding allocation in FY 2025 \nby subgroups and provides summary programmatic and financial de tails of the major weapon \nsystems within each portfolio.  The bar charts in the respective mission areas display the relative \nchange in annual funding requested for every fiscal year since FY 2010 for the mission area. \nAviation and Related Systems \n$61.2 billion – 20 percent of the Investment budget request \nIncludes funding for aircraft research and development, aircraft procurement, initial spares, and \naircraft support equipment.  The single largest defense program, the 5\nth generation F- 35 Joint \nStrike Fighter (JSF) request of $ 12.4 billion for 68 aircraft for the Navy (F -35C), Marine Corps \n(F-35B & C) and Air Force (F -35A).  The program also includes the Continuous Capability \nDevelopment and Delivery (C2D2) Block IV modification program, which aims to bring aircraft \nprocured in prior fiscal years to the Block IV configuration.  Also in the FY 2025 request are 18 - \n4th generation F-15EX aircraft to supplement the Air Force Tactical Aviation (TACAIR) st rike \nAviation & Related \nSystems $41.1\nC4I Systems $9.2\nGround Systems \n$10.6\nMissile Defense \nPrograms $3.8\nMissiles & \nMunitions \n$19.6\nMission Support \n$35.8Shipbuilding & \nMaritime Systems \n$42.6\nSpace Based \nSystems $4.8\nAircraft & Related \nSystems $20.1C4I Systems $11.9\nGround Systems \n$2.3\nMissile Defense \nPrograms $9.7\nMissiles & \nMunitions \n$10.3\nMission Support \n$45.7\nRDT&E S&T $17.2\nShipbuilding & \nMaritime Systems \n$5.5\nSpace Based \nSystems $20.4\nRDT&E PROCUREMENT\n $ in Billions"
    },
    {
      "page": 7,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \n \n v  Introduction \n \ncapability.  The FY 2025 PB program also reflects the Department’s strategy to layer capability to \naddress different threats; 5 th generation F-35 jet fighters to address advance technology aircraft \nbeing deployed by Russia and China; a modernized 4th generation F-15EX aircraft to supplement \nthe 5th generation systems, which nominally have lower operating costs when compared to 5 th \ngeneration combat jets such as the F -22 and the F -35.  Also in this category is the funding for \nattack and utility helicopters; Unmanned Aircraft Systems (UAS); manned reconnaissance \nplatforms and systems; the incremental cost for the VC-25B Presidential Aircraft Recapitalization \n(PAR) aircraft; the KC -46A Pegasus tanker; as well as future platforms such as the B -21 Long \nRange Strike Bomber and the Next Generation Air Dominance (6th generation fighter). \nFor display purposes, the aircraft and related systems category includes the following subgroups: \n• Combat Aircraft ($25.4 billion) \n• Cargo Aircraft ($4.5 billion) \n• Support Aircraft ($4.9 billion) \n• Unmanned Aircraft Systems \n($2.4 billion) \n• Aircraft Support ($8.6 billion) \n• Technology Development ($5.4 billion) \n• Aircraft Modifications ($9.9 billion) \n• System Development ($0.1 billion) \n \n \nCommand, Control, Communications, Computers, and Intelligence (C4I) Systems \n$21.1 billion – 7 percent of the Investment budget request \nIncludes funding for various C4I systems, to include command centers; communications gear; air \ntraffic control; night vision equipment; cyberspace activities (cybersecurity, enabling cyberspace \noperations, and supporting research and development) ; data processing equipment; fire control \nsystems; other information technology; and related systems.  This category includes funding for a \n53.6 55.4 54.2 \n47.6 45.5 \n40.0 \n48.8 \n45.3 \n49.9 \n55.2 \n57.7 56.9 \n52.4 \n56.5 \n61.1 61.2 \n$0\n$10\n$20\n$30\n$40\n$50\n$60\n$70\nFY10 FY11 FY12 FY13 FY14 FY15 FY16 FY17 FY18 FY19 FY20 FY21 FY22 FY23 FY24 FY25\nAircraft & Related Systems\nAnnual Budget Request $ in Billions"
    },
    {
      "page": 8,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \n \n vi  Introduction \n \nlarge number of programs such as Tactical Network Transport  (TNT), Handheld Manpack Small \nForm Fit (HMS)  radio, Joint Regional Security Stacks (JRSS) , Information Sys tems Security \nProgram (ISSP), Crypto devices and key management infrastructure, Nuclear Command, Control, \nand Communications  (NC3), equipping the Cyber Mission Forces, the Air Force National \nAirborne Operations Center (NAOC) Recapitalization program, the Navy’s Consolidated Afloat \nNetworks and Enterprise Services (CANES), and the Integrated Personnel and Pay System-Army \n(IPPS-A).  The funding in FY  2025 is substantially higher than the amount requested in the \nFY 2024 request, primarily because of the recategorization of programs from the Mission Support \ncategory and funding changes for Cyber space, Spectrum, Artificial Intelligence (AI) , 5G, \nCombined Joint All-Domain Command & Control (CJADC2) and other emerging technologies. \nFor display purposes, the C4I System category includes the following subgroups: \n• Aviation & Support Equipment \n($1.8 billion) \n• Base Communications ($2.0 billion) \n• Communication & Electronic \nEquipment ($7.9 billion) \n• Information Security ($0.1 billion) \n• Support Equipment ($0.2 billion) \n• Technology Development \n($8.5 billion) \n• Ground & Sea Support ($0.6 billion) \n \n \n \nGround Systems \n$13.0 billion – 4 percent of the Investment budget request \nIncludes funding for combat vehicles, artillery, infantry support weapons, tactical radar systems, \ntactical and non -tactical vehicles of all types, physical security equipment, logistics and \n10.5 11.1 10.9 \n8.2 \n7.0 6.6 7.4 7.4 \n8.6 \n10.0 10.2 \n11.9 12.7 12.8 \n14.5 \n21.1 \n$0\n$5\n$10\n$15\n$20\n$25\nFY10 FY11 FY12 FY13 FY14 FY15 FY16 FY17 FY18 FY19 FY20 FY21 FY22 FY23 FY24 FY25\nC4I Systems\nAnnual Budget Request$ in Billions"
    },
    {
      "page": 9,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \n \n vii  Introduction \n \nengineering equipment, and research and developmen t of various weapons equipment.  This \ncategory includes funding for new tactical vehicles such as the Army’s new Armored Multi -\nPurpose Vehicle (AMPV) which will replace the M-113 personnel carrier, and the Marine Corps’ \nAmphibious Combat Vehicle (ACV) which will replace the Amphibious Assault Vehicle (AAV).  \nThe category also includes funding for upgrades to the M1A2 Abrams main battle tank to begin \nbringing the force up to the M1A2C (System Enhancement Package (SEP) V3) configuration and \nupgrades to the M109A7 155mm Paladin Integrated Management (PIM) self -propelled artillery \nvehicle for improved force protection, survivability, and mobility.  In addition, the Army is \nmodernizing the tactical wheeled vehicle fleet through new procurement Joint Light Tactical \nVehicles (JLTV), engineering change s to Family of Medium Tactical Vehicles (FMTVs) and  \nrecapitalizing the Family of Heavy Tactical Vehicles (FHTVs) to continue affordability initiatives.   \nFor display purposes, the Ground Systems category includes the following subgroups:\n• Support Vehicles ($0.4 billion) \n• Tracked Combat Vehicles \n($6.2 billion)  \n• Light Tactical Vehicles ($0.4 billion) \n• Communication & Electronic \nEquipment ($1.2 billion) \n• Weapons ($1.5 billion) \n• Equipment ($3.3 billion) \n \n \nMissile Defense Programs \n$13.5 billion – 4 percent of the Investment budget request \nThe $13.5 billion represented in this display includes only those programs that are funded in the \nProcurement or RDT&E appropriations and are missile defense related such as tactical ballistic \nmissile interceptors and counter-missile programs within each of the Ser vices.  Includes funding \n26.3 \n23.3 \n16.1 \n10.9 \n8.4 \n6.3 \n8.2 \n9.8 \n11.2 \n15.9 \n14.6 \n13.0 12.3 12.6 \n13.9 13.0 \n$0\n$5\n$10\n$15\n$20\n$25\n$30\nFY10 FY11 FY12 FY13 FY14 FY15 FY16 FY17 FY18 FY19 FY20 FY21 FY22 FY23 FY24 FY25\nGround Systems\nAnnual Budget Request$ in Billions"
    },
    {
      "page": 10,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \n \n viii  Introduction \n \nfor the development and procurement of tactical and strategic ballistic missile defense weapons \nand systems.  Funds improved ballistic missile capabilities against existing and future threats.  The \nFY 2025 budget request maintains a program of 12 SM -3 Block IIA missiles across the Future \nYear Defense Program ( FYDP) and continues procurement of the Terminal High Altitude Ar ea \nDefense (THAAD) interceptors, as well as efforts to mature technologies and capabil ities to \naddress missile threats to the United States .  The FY 2025 request continues the development of \nthe Next Generation Interceptor (NGI) to supplement the 44 Ground Based Interceptors (GBI) \ncurrently deployed.  In addition, the budget funds Missile Defense programs, including efforts to \nsupport the Ballistic Missile Defense System, and other Missile Defense activities funded by other \nDoD Components, including dua l use technologies and programs that mitigate ballistic missile \nthreats beyond those funded by the Missile Defense Agency (MDA).  The FY 2025 budget request \nincludes $1.5 billion for the Defense of Guam , supports Land- based Aegis Ashore facilities in \nRomania and Poland, and continues MDA ’s longstanding support of U.S.- Israeli Cooperative \nPrograms to include the co-development and co-production of the David's Sling Weapon System \nand Upper Tier Interceptor as well as improvements to the Arrow Weapon System, and Iron Dome. \nFor display purposes, the Missile Defense Programs category includes the following subgroups: \n• Advanced Component Development \n($0.5 billion) \n• Operational System Development \n($1.0 billion) \n• Communications & Electronic \nEquipment ($0.6 billion) \n• Ballistic Missile Defense Systems \n($8.7 billion) \n• Tactical Missile Defense \n($2.7 billion)  \n \n \n \n9.1 \n9.9 10.1 \n9.0 8.5 8.2 \n8.8 8.5 \n9.2 \n12.0 11.6 11.6 \n10.9 \n12.3 \n14.8 \n13.5 \n$0\n$2\n$4\n$6\n$8\n$10\n$12\n$14\n$16\nFY10 FY11 FY12 FY13 FY14 FY15 FY16 FY17 FY18 FY19 FY20 FY21 FY22 FY23 FY24 FY25\nMissile Defense Programs\nAnnual Budget Request$ in Billions"
    },
    {
      "page": 11,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \n \n ix  Introduction \n \nMissiles and Munitions \n$29.8 billion – 10 percent of the Investment budget request \nThis category includes funding for all types of  c onventional ammunition and Precision Guided \nMunitions (PGM).  The ammunition category includes bullets, cartridges, mortars, explosives, and \nartillery projectiles.  The PGM portfolio includes weapons which have applicability in both a \ncontested and permissive environment, and includes an assortment of air -to-air, air -to-ground, \nground-to-ground, and ground-to-air weapons.  The FY 2025 request includes the continuation of \nthe Large Lot Procurement (LLP) multiyear pilot initiated in the FY 2024 Presidents’ Budget for \nthe AIM-120D Advanced Medium-Range Air-to-Air Missile (AMRAAM), the AGM-158B Joint \nAir-to-Surface Missile (JASSM), the AGM-158C Long Range Anti-Ship Missile (LRASM), and \nthe Standard Missile - 6 (SM-6).  The FY 2025 request also funds the procurement of  additional \nJoint Direct Attack Munition (JDAM), the GBU-39 Small Diameter Bomb (SDB) I & SDB II, and \nthe new long- range Precision Strike Missile ( PrSM).  Also, in the FY 2025 request, funding is \nbeing requested to continue the Multiyear  Procurement (MYP) for the Army’s Guided Multiple \nLaunch Rocket System (GMLRS), the Patriot Advanced Capability - 3 Missile Segment \nEnhancement (MSE) and the Navy’s Naval Strike Missile (NSM) .  Also in this c ategory is the \nfunding for the modernization of nuclear weapon delivery systems, such as the existing Trident II \nD5 Life Extension 2 (D5LE2) Submarine Launch Ballistic Missile (SLBM) , the Sentinel \nIntercontinental Ballistic Missile (ICBM) (previously called the Ground Based Strategic Deterrent \n(GBSD)), and the B61-12 Tail Kit and Long- Range Standoff (LRSO) nuclear armed weapon  \nprograms. \n \nF\nor display purposes, the Missiles and Munitions category includes the following subgroups: \n• Conventional Ammunition \n($5.9 billion) \n• Strategic Missiles ($7.2 billion) \n• Tactical Missiles ($16.0 billion) \n• Technology Development ($0.7 billion))\n \n12.5 12.9 \n11.0 10.3 9.2 9.0 \n11.9 \n13.9 \n16.4 \n20.7 21.6 21.3 20.3 \n24.7 \n30.6 29.8 \n$0\n$5\n$10\n$15\n$20\n$25\n$30\n$35\nFY10 FY11 FY12 FY13 FY14 FY15 FY16 FY17 FY18 FY19 FY20 FY21 FY22 FY23 FY24 FY25\nMissiles & Munitions\nAnnual Budget Request$ in Billions"
    },
    {
      "page": 12,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \n \n x  Introduction \n \nShipbuilding and Maritime Systems \n$48.1 billion – 15 percent of the Investment budget request \nIncludes RDT&E and Procurement funding for shipbuilding and maritime systems.  The FY 2025 \nbudget request provides for the construction of six Battle Force Ships (BFS) plus the development \nof unmanned surface vessels.  The FY 2025 request includes incremental funding for three future \nFORD class nuclear aircraft carriers: USS John F. Kennedy (CVN 79), USS Enterprise (CVN 80) \nand USS Doris Miller (CVN 81).  The budget request also includes funding for six BFS: two DDG \n51 class surface combatants; one Constellation class (FFG 62); one Block VI fast attack Virginia \nclass submarine equipped with the Virginia Payload Module (VPM) ; one San Antonio class \namphibious transport dock ship (LPD 17 Flight II); and one medium landing ship (LSM).  Also in \nthis category are the development funds and funds for the construction of the second Columbia  \nclass ballistic -missile submarine s (SSBN), the USS Wisconsin (SSBN 827) and advance \nprocurement funding for 10 additional Columbia class SSBNs. Also, the budget requests ongoing \ncosts for the USS Harry S. Truman (CVN 75)  Refueling and Complex Overhaul (RCOH ) and \ninvestments in the submarine industrial base .  The Department’s FY 2025 request also includes \n$4.0 billion for the Submarine Industrial Base (SIB), of which $3.9 billion is for the Navy and $0.1 \nbillion is requested in Defense-wide appropriations.  \nFor display purposes, Shipbuilding and Maritime Systems is further categorized by the following \nsubgroups: \n• Surface Combatant ($13.5 billion) \n• Submarine Combatant ($19.6 billion) \n• Support Ships ($2.7 billion) \n• Ship Equipment ($6.8 billion) \n• Outfitting & Post Delivery ($2.6 billion) \n• Technology Development ($2.9 billion) \n \n  \n22.4 \n25.1 24.2 22.6 23.3 22.0 \n25.6 27.0 \n30.4 \n33.1 34.7 \n32.3 \n34.6 \n40.8 \n48.1 48.1 \n$0\n$10\n$20\n$30\n$40\n$50\n$60\nFY10 FY11 FY12 FY13 FY14 FY15 FY16 FY17 FY18 FY19 FY20 FY21 FY22 FY23 FY24 FY25\nShipbuilding & Maritime Systems\nAnnual Budget Request$ in Billions"
    },
    {
      "page": 13,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \n \n xi  Introduction \n \nSpace Based Systems \n$25.2 billion – 8 percent of the Investment budget request \nThis category funds development and procurement of spacecraft; launch vehicles; space command \nand control systems ; and terrestrial satellite terminals and equipment.  The FY  2025 request \ncontinues aggressively integrating the Space Force into the fabric of national and international \nsecurity by collaborating across the Department of Defense, interagency, commercial industry, and \nour allies and partners.  Space is a warfighting domain critical to the Nation's security, economic \nprosperity, and scientific knowledge.  T he FY 2025 request continues development of the Next \nGeneration Overhead Persistent Infrared (Next-Gen OPIR) and provides for the development of a \nnew generation of secure communication and tactical warning and attack assessment satellite \nconstellations.  It a lso includes  investments in position, navigation, and timing, critical  space \nsituational awareness requirements, the space test program, and classified programs designed to \nprovide assured capability in space. \nFor display purposes, Space Based Systems is further categorized by the following subgroups: \n• Advanced Component Development \n($5.1 billion) \n• Operational System Development \n($9.2 billion) \n• Space Procurement, SF ($4.3 billion) \n• Management Support ($0.2 billion) \n• Communications & Electronics \nEquipment ($0.5 billion) \n• Support Activities ($0.1 billion) \n• System Development ($5.6 billion) \n• Technology Development ($0.2 billion) \n \n \n*  The scope of the Space Based Systems included in this chart has changed between FY 2010 and FY 2025. \n11.1 \n9.9 10.2 \n8.0 8.0 7.2 7.1 7.1 \n9.8 9.3 \n11.9 \n15.5 \n16.7 \n21.7 \n26.1 25.2 \n$0\n$5\n$10\n$15\n$20\n$25\n$30\nFY10 FY11 FY12 FY13 FY14 FY15 FY16 FY17 FY18 FY19 FY20 FY21 FY22 FY23 FY24 FY25\nSpace Based Systems\nAnnual Budget Request$ in Billions"
    },
    {
      "page": 14,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \n \n xii  Introduction \n \nScience and Technology \n $17.2 billion – 6 percent of the Investment budget request \n \nInvesting in Science and Technology (S&T)  is investing in the future.  Given today's globalized \naccess to knowledge and the rapid pace of technology development, innovation, and agility have \ntaken on a greater importance.  The FY 2025 funding in this category fosters innovation and \ndevelops cutting-edge, state-of-the-art technologies to protect the United States, its allies, and \nAmerican forces worldwide.  These S&T projects aim to develop technologies that will be essential \nin a future battlefield, in clude specific scientific and engineering efforts in Artificial Intelligence \n(AI), Machine Learning applications, Hypersonics (offensive and defensive), Directed Energy \n(lasers, particle beams, etc.), Microelectronics, Biological Technology, Cyber, Fifth Generation \ncommunications ( 5G), Autonomy, Space, and Quantum sciences.  Transitioning these \ntechnologies to operational systems will bring vital cutting-edge capabilities to the warfighter.   \nFor display purposes, RDT&E S&T, is further categorized by the following subgroups: \n• Basic Research ($2.5 billion) \n• Applied Research ($5.8 billion) \n• Advanced Technology Development \n($9.0 billion) \n \n \n \n \n \n \n11.7 11.8 12.0 11.9 12.0 11.5 \n12.3 12.5 \n13.2 13.7 14.1 14.1 14.7 \n16.5 \n17.8 17.2 \n$0\n$2\n$4\n$6\n$8\n$10\n$12\n$14\n$16\n$18\n$20\nFY10 FY11 FY12 FY13 FY14 FY15 FY16 FY17 FY18 FY19 FY20 FY21 FY22 FY23 FY24 FY25\nScience & Technology (S&T)\nAnnual Budget Request$ in Billions"
    },
    {
      "page": 15,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \n \n xiii  Introduction \n \nMission Support Activities \n$81.5 billion – 26 percent of the Investment budget request \nThis category includes RDT&E and Procurement funding for various miscellaneous equipment \nused by combat and non- combat forces, cross departmental capabilities such as live fire test and \nevaluation (such as testing ranges), chemical demilitarization, test infrastructure, the Rapid \nPrototyping Program, Office of Strategic Capital, Foreign Materiel Acquisition and Exploitation, \nConcepts Experimentation Program, Rapid Defense Experimentation Reserve (RDER), Counter - \nSmall Unmanned Aircraft Systems Advanced Development , Warfare Innovation Management , \nCombined Advanced Applications , National Industrial Security Systems (NISS) , Constructive \nSimulation Systems Development, Logistics Support Activities , Requirements Analysis & \nConcept Maturation, Chemical Materials Agency , Counter Improvised- Threat Demonstration, \nPrototype Development, and Testing, Defense Exportability Program , Installation Industrial \nSupport Systems and the Defense Production Act (DPA) industrial base support.  Also included in \nthis category are classified programs, activities and capabilities not reflected in the other categories \npreviously identified. \n \nSummary of Account History \n \n \n \n \nDuring program execution, funding for weapon system development and procurement often \nchanges because of  congressional action and reprogramming actions by the Department to \naccommodate changes in program scope and to respond to dynamic changes in requirements.  As \nillustrated in the above chart, the available funding in FY 2023 is higher than what was requested \nby the President and enacted by the Congress. \n \n \n \n \n \nFY 2023 Program (Dollars in Billions) RDT&E PROCUREMENT \nPresident’s Budget Request 130.1 145.9 \nAppropriated by the Congress (enacted) 140.1 167.6 \nCurrent Funding (actuals) 140.9 182.3 \nFY 2024 Program (Dollars in Billions) RDT&E PROCUREMENT \nPresident’s Budget Request 145.0 170.0 \nFY 2025 Program (Dollars in Billions) RDT&E PROCUREMENT \nPresident’s Budget Request 143.2 167.5"
    },
    {
      "page": 16,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \n \n xiv  Introduction \n \n \nDisplay Criteria of Weapon System Funding \n \n \nThe funding amount represents the direct program costs for the development and the acquisition \nof the Programs, Projects, and Activities (PPA).  Not included are the costs associated with initial \nand replenishment spare parts. \n \nFY 2023 amounts reflect the actual execution as of September 30, 2023, including supplemental \nfunding, but exclude congressional rescissions. \n \nFY 20 24 amounts shown at the individual program level reflect the funding requested in the \nFY 2024 President’s Budget by the Department of Defense. \n \nFY 2025 amounts reflect the funding requested in the FY  2025 P resident’s Budget by the \nDepartment of Defense."
    },
    {
      "page": 17,
      "text": "($ in Millions) FY 2023 FY 2025 Page\nAircraft and Related Systems – Joint Service\nF-35 Joint Strike Fighter 11,845.8  13,590.1  12,430.8    1-2\nV-22 Osprey 1,094.4    649.5       538.8         1-3\nC-130J Hercules 2,846.9    823.6       806.0         1-4\nMQ-1C Gray Eagle 487.5        21.6          30.5           1-5\nMQ-9 Reaper 723.0       529.9       305.1         1-6\nMQ-4C / RQ-4 Triton/Global Hawk/NATO AGS 979.1       823.7       750.1         1-7\nAO Armed Overwatch / Targeting 247.2       268.8       337.5         1-8\nAircraft and Related Systems – US Army (USA)\nAH-64E Apache:  Remanufacture/New Build 900.2       952.6       659.9         1-9\nCH-47 Chinook 502.9       251.4       720.3         1-10\nUH-60 Black Hawk 1,169.1    915.5       792.2         1-11\nFLRAA Future Long-Range Assault Aircraft 664.8       1,044.1    1,260.2      1-12\nAircraft and Related Systems – US Navy (USN) / US Marine Corps (USMC)\nMQ-25 Stingray 1,133.8     969.4        898.0         1-13\nF/A-18 Super Hornet 2,064.0    1,832.1    1,805.6      1-14\nE-2D Advanced Hawkeye 1,646.9    582.7       499.1         1-15\nCH-53K Heavy Lift Replacement Helicopter 2,471.6    2,418.3    2,685.0      1-16\nAircraft and Related Systems – US Air Force (USAF)\nB-21 Raider 4,754.3    5,316.2    5,338.5      1-17\nB-1, B-2, B-52 Bombers 1,045.4    1,254.7    1,394.4      1-18\nKC-46A Pegasus 2,599.6    3,007.3    2,973.3      1-19\nVC-25B Presidential Aircraft Recapitalization 79.6         490.7       433.9         1-20\nF-22 Raptor 1,262.6    1,520.6    1,629.7      1-21\nF-15 Eagle 3,538.1    3,378.5    2,361.1      1-22\nHH-60W Combat Rescue Helicopter 1,236.8    330.8       243.9         1-23\nT-7A Advanced Pilot Training 43.0         77.3         319.2         1-24\nMH-139A Grey Wolf 213.3       274.8       333.4         1-25\nE-7A Airborne Warning and Control System Replacement 411.7       681.0       418.5         1-26\nC-40 C-40 Fleet Expansion -             -             328.7         1-27\nC4I Systems – USA\nTNT Tactical Network Technology 362.9       358.6       280.8         2-2\nHMS Handheld, Manpack, and Small Form Fit Radios 664.5       769.4       708.4         2-3\nC4I Systems – Joint Service\nCyberspace Cyberspace Activities 3,449.9    4,059.9    3,958.8      2-4\nCJADC2 CJADC2 Programs 611.0       1,039.0    1,433.0      2-5\nGround Systems – Joint Service\nJLTV Joint Light Tactical Vehicle 1,429.7    1,191.8    1,179.5      3-2\nGround Systems – USA\nM-1 Abrams Tank Modification/Upgrades 1,297.7    896.5       1,020.2      3-3\nAMPV Armored Multi-Purpose Vehicle 1,237.0    567.1       527.7         3-4\nNGSW Next Generation Squad Weapon 199.6       328.1       389.4         3-5\nPIM Paladin Integrated Management 1,026.8    511.6       460.2         3-6\nStryker Stryker Family of Armored Vehicles 1,275.0    639.1       469.4         3-7\nM10 M10 Booker (Mobile Protected Firepower) 410.5       496.8       508.7        3-8\nFMTV Family of Medium Tactical Vehicles 233.9       142.9       153.5        3-9\nFHTV Family of Heavy Tactical Vehicles 326.3       110.6       148.9        3-10\nXM30 XM30 Combat Vehicle 519.1       996.7       504.8        3-11\nGround Systems – USMC\nACV Amphibious Combat Vehicle 605.4       660.8       870.5          3-12\nMissile Defense Programs – Joint Service\nGMD Ground-based Midcourse Defense 2,562.2    3,076.3    2,526.2      4-2\nTHAAD Terminal High Altitude Area Defense 502.0        484.7       639.9         4-3\nAegis Sea-Based Weapons System 1,896.3    1,722.6    1,307.7      4-4\nMissile Defense Programs – USA\nPATRIOT / PAC–3PATRIOT Advanced Capability 976.3       1,206.1    1,006.7      4-5\nPAC-3 / MSE PAC-3/Missile Segment Enhancement 2,471.4    1,212.8    963.1         4-6\nMajor Weapon Systems Summary\nFY 2024 *\nxv Introduction"
    },
    {
      "page": 18,
      "text": "($ in Millions) FY 2023 FY 2025 Page\nMajor Weapon Systems Summary\nFY 2024 *\nMissiles and Munitions – Joint Service\nJDAM Joint Direct Attack Munition 328.7       206.1       200.4         5-2\nSDB I Small Diameter Bomb I 52.7         48.7         42.3           5-3\nSDB II Small Diameter Bomb II 660.7        447.2       454.1         5-4\nJASSM Joint Air-to-Surface Standoff Missile 958.9       1,818.6    1,008.6      5-5\nAIM-9X Air Intercept Missile - 9X 488.6       252.2       259.4         5-6\nAMRAAM Advanced Medium Range Air-to-Air Missile 773.4       1,223.6    810.2         5-7\nChem-Demil Chemical Demilitarization 1,059.8    1,091.8    775.5         5-8\nJAGM Joint Air-to-Ground Missile 297.1       386.1       148.1         5-9\nLRASM Long Range Anti-Ship Missile 437.6       827.3       696.8         5-10\nAMMO Ammunition 11,267.7  4,964.0    5,160.0      5-11\nAARGM-ER Advanced Anti-Radiation Guided Missile 591.5       595.8       826.2         5-12\nGMLRS Guided Multiple Launch Rocket System 2,196.9    1,027.2    1,241.9      5-13\nJavelin Javelin Advanced Anti-Tank Weapon System 1,148.3    262.2       398.1         5-14\nMissiles and Munitions – USA\nPrSM Precision Strike Missile 412.9       656.9       676.6         5-15\nMissiles and Munitions – USN\nTrident II Trident II Ballistic Missile Modifications 1,694.5     1,870.2    2,465.7      5-16\nSM-6 Standard Missile-6 787.5       1,615.0    1,223.5      5-17\nRAM Rolling Airframe Missile 108.9       126.0       160.2         5-18\nNSM Naval Strike Missile 241.5       249.9       206.1         5-19\nTomahawk Tactical Tomahawk Cruise Missile 901.5       934.3       765.4         5-20\nMissiles and Munitions – USAF\nLGM-35A Sentinel 3,437.5    4,290.4    3,731.9      5-21\nLRSO Long Range Stand-Off Weapon 953.3       978.2       833.8         5-22\nShipbuilding and Maritime Systems – USN\nCVN 78 Gerald R. Ford Class Nuclear Aircraft Carrier 3,205.7    2,704.4    2,339.4      6-2\nSSBN 826 Columbia Class Ballistic Missile Submarine 6,273.2    6,218.0    9,878.7      6-3\nSSN 774 Virginia Class Submarine 7,270.7    10,845.6  8,209.3      6-4\nDDG 51 Arleigh Burke Class Destroyer 8,220.8    5,074.5    7,071.3      6-5\nFFG(X) Constellation Class Guided Missile Frigate 1,551.1    2,286.7    1,278.1      6-6\nCVN Refueling Complex Overhaul 689.9       895.6       1,738.3      6-7\nLPD 17 San Antonio Class Amphibious Ship 2,008.2    77.6         1,653.0      6-8\nT-AO 205 John Lewis Class Fleet Replenishment Oiler 1,060.7    967.7       261.2         6-9\nUSV Medium and Large Unmanned Surface Vessels 300.1        237.9       185.2         6-10\nLHA America Class Amphibious Assault Ship 1,428.0    1,874.2    234.4         6-11\nLSM Medium Landing Ship 11.1          14.7         274.1        6-12\nSpace Based Systems – USSF\nNSSL & RSLP Launch Enterprise 2,305.0    3,003.1    2,397.8      7-2\nGPS III & ProjectsGlobal Positioning System Enterprise 1,672.5    1,259.8    1,519.7      7-3\nOPIR Space Based Missile Warning Systems 4,722.1    4,966.4    4,677.8      7-4\nSATCOM ProjectsSatellite Communications (SATCOM) Projects 2,786.5    4,028.8    4,203.0      7-5\n*  Reflects the FY 2024 budget request\nxvi Introduction"
    },
    {
      "page": 19,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-1 \nAviation and Related Systems \n \nAviation forces including fighters, bombers, mobility (cargo/tanker), specialized support aircraft, \nand Unmanned Aerial Vehicles/Unmanned Aircraft Systems (UAV/UAS) , provide a ver satile \nstrike force capable of rapid deployment worldwide.  These forces can quickly gain and sustain air \ndominance over regional aggressors, permitting rapid attacks on enemy targets while providing \nsecurity to exploit the air for logistics, command and control, intelligence, and other functions.  \nFighter/attack aircraft operate from both land bases and aircraft carriers to provide air superiority \nto combat enemy fighters and attack ground and ship targets.  Bombers provide an intercontinental \ncapability to rapidly strike surface targets.  The specialized aircraft supporting conventional \noperations perform functions such as intelligence, surveillance, and reconnaissance; airborne \nwarning and control; air battle management; suppression of enemy air defenses; and combat search \nand rescue.  In addition to these forces, the U.S. military operates a variety of air mobility forces \nincluding cargo, aerial-refueling aircraft, helicopters, and support aircraft. \n \nContinuing in the FY 2025 request is the Department’s  Tactical Air (TACAIR) strategy to \nsupplement 5\nth generation fighters like the F-22 and F-35 with 4th generation capability, to more \neconomically address threats that do not require state-of-the-art 5th generation combat jets. \n \n \nFY 2025 Aviation and Related Systems Total:  $61.2 Billion \n \n \nSystem \nDevelopment\n$0.1\nAircraft Modifications\n$9.9 Aircraft Support\n$8.6\nCargo Aircraft\n$4.5\nCombat Aircraft\n$25.4Support \nAircraft\n$4.9\nTechnology \nDevelopment\n$5.4\nUnmanned \nAircraft \nSystems\n$2.4\n$ in Billions \nNumbers may not add due to rounding"
    },
    {
      "page": 20,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \n Aircraft & Related Systems \n1-2 \nThe F-35 Joint Strike Fighter (JSF) is a fifth-\ngeneration strike fighter for the Navy, Marine Corps, \nAir Force, and U.S. Allies.  The F-35 consists of \nthree variants:  F-35A Conventional Take-Off and \nLanding (CTOL), the F-35B Short Take-Off and \nVertical Landing (STOVL), and the F-35C Carrier \nvariant (CV).  The F-35A CTOL replaces the Air \nForce F-16 and A-10 aircraft and complements the \nF-22 aircraft; the F-35B STOVL aircraft replaces the Marine Corps AV-8B aircraft and F/A-\n18A/C/D aircraft; the F-35C CV aircraft complements the F/A-18E/F aircraft for the Navy, and \nwill also be flown by the Marine Corps.  The F-35 program is a joint, multi-national program \namong the United States and seven cooperative international Partners as well as nine current \nForeign Military Sales countries.  The Marine Corps, Air Force, and Navy have all declared Initial \nOperational Capability in 2015, 2016, and 2019, respectively. \n \n \nMission:  Provides all-weather, precision, stealthy, ground strike and air-to-air capability, \nincluding direct attack on the most lethal surface-to-air missiles and air defenses. \n \n \nFY 2025 Program:  Continues systems engineering, development, and operational testing; \nsupports Continuous Capability Development and Delivery (C2D2); and provides service-unique \nrequirements to incremental warfighting capability improvements to maintain joint air dominance \nagainst evolving threats.  Procures 68 aircraft in FY 2025:  42 CTOL for the Air Force, 13 STOVL \nfor the Marine Corps, and 13 CV for the Department of the Navy (9 Navy and 4 Marine Corps).  \nProvides post-delivery upgrades of hardware and software.  Enables the ground and squadron \nsupport and site stand-up infrastructure required to support U.S. Services F-35 air systems.  \nAccelerates organic depot maintenance capability to reduce depot repair cycle times to improve \nair vehicle availability rates. \n \n \nPrime Contractor(s):  Airframe:  Lockheed Martin Corporation; Fort Worth, TX  \n                                      Engine:  Pratt & Whitney; Hartford, CT \n \n \n \n \nQty $M Qty $M Qty $MRDT&EUSN/USMC -            993.7      -            1,088.5   -            946.9      USAF -            1,055.4   -            1,372.5   -            1,171.3   Subtotal-            2,049.1   -            2,461.0   -            2,118.2   ProcurementUSN/USMC 34           4,618.6   35           4,919.4   26           4,339.3   USAF 43           4,482.2   48           5,279.1   42           4,956.7   Subtotal77           9,100.7   83           10,198.5 68           9,296.0   Mods-          696.0      -          930.6      -          1,016.6      Total77           11,845.8 83           13,590.1 68           12,430.8 F-35 Joint Strike Fighter FY 2023 FY 2024 FY 2025\n \nNote: Includes Modification Program                                                                 Numbers may not add due to rounding \nF-35 Joint Strike Fighter"
    },
    {
      "page": 21,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-3 \n \nThe V-22 Osprey is a tilt-rotor, vertical takeoff \nand landing aircraft designed to meet the \namphibious/vertical assault needs of the \nMarine Corps, the strike rescue and Carrier \nOnboard Delivery (COD)  needs of the Navy, \nand the long- range special operations forces \nmissions for United States Special Operations \nCommand.  Designed to fly 2,100 miles with \none in- flight refueling,  the V -22 gives  the \nServices the advantage of a vertical and short \ntakeoff and landing aircraft that can rapidly \nself-deploy to any worldwide location.  \n \n \nMission:  Conducts airborne assault, vertical lift, combat search and rescue, and special operations \nmissions.  The CMV-22 variant replaces the Navy’s C-2A Greyhound for the COD mission. \n   \n \nFY 2025 Program:  Funds MV-22 and CMV-22 production line shutdown to include material, \ntooling, test equipment disposition, and storage requirements.  The m odification program \ncontinues to focus on reducing flight hour costs and improving t ime on wing availability through \nstandard configurations, structural safety and reliability improvements, and enhanc ed capability.  \nOngoing V-22 modifications specifically focus on readiness (reducing configurations and \nincreasing maintenance efficiencies), reliability (improving the nacelles to increase aircraft \navailability), and relevance (improving joint airborne mission networking). \n \n \nPrime Contractor(s):  Airframe:  Bell Helicopter Textron, Incorporated; Amarillo, TX \n                    The Boeing Company; Philadelphia, PA \n  Engines:    Rolls Royce; Indianapolis, IN \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E\nUSN -               106.5       -               137.6       -               109.4       \nUSAF & SOCOM -               21.4         -               39.7         -               42.0         \nSubtotal -               127.9       -               177.3       -               151.4       \nProcure me nt\nUSN 5              734.7       -               243.2       -               295.2       \nUSAF & SOCOM -               231.8       -               229.0       -               92.2         \nSubtotal 5              966.5       -               472.2       -               387.4       \n   Total 5              1,094.4    -               649.5       -               538.8       \nV–22 Osprey\nFY 2023 FY 2024 FY 2025\n \nNote:  Includes Modification Program                                                               Numbers may not add due to rounding \n \nV-22 Osprey"
    },
    {
      "page": 22,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-4 \n \n \nThe C-130J Hercules is a medium -sized tactical \ntransport airlift aircraft that modernizes the United \nStates tactical airlift capability.  It is capable of \nperforming a variety of combat delivery (tactical \nairlift) operations across a broad range of mission \nenvironments, including deployment and \nredeployment of troops and supplies \nwithin/between command areas in a theater  of \noperation, aeromedical evacuation, air logistics \nsupport, air refueling, special operations, firefighting, weather reconnaissance, and augmentation \nof strategic airlift forces.  Specific mission variants of the C-130J conduct weather reconnaissance \n(WC-130J), search and rescue (HC -130J), and special operations (MC -130J and AC-130J).  The \nKC-130J provides the Marine Corps air-to-air refueling/tactical transport capability; airborne radio \nrelay; intelligence, surveillance, and reconnaissance; and close air  support to replace the KC-130 \nF/R/T aircraft. \n \nMission:  Provides responsive air movement and delivery of combat troops/supplies directly into \nobjective areas through air landing, extraction, airdrop, and the air logistic s support of theater \nforces. \n \nFY 2025 Program:  Funds capability upgrades (Block 8.1 and Communication Modernization) , \nlogistics support services, diminishing manufacturing sources, and post-delivery support. \n \nPrime Contractor(s):  Lockheed Martin Corporation; Marietta, GA \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qt y $M Qty $M\nRDT&E\nC-130J          -           9.8          -         19.1          -         34.4 \nHC/MC-130J          -         46.1          -         36.5          -         24.9 \n  Subtotal       55.9       55.6       59.4 \nProcure me nt\nC-130J          16  1,775.3          -         34.9          -           2.4 \nMC-130J          -         17.5          -            -            -            -   \nKC-130J            5     468.6            2     241.3          -         33.4 \n  Subtotal          21  2,261.4            2     276.2          -         35.8 \nMods          -       529.6          -       491.7          -       710.8 \n   Total          21  2,846.9            2     823.6            -     806.0 \nC-130J Hercules\nFY 2024 FY 2025FY 2023\n \nNote: Includes Modification Program                                                                 Numbers may not add due to rounding  \nC-130J Hercules"
    },
    {
      "page": 23,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-5 \nThe U.S.  Army MQ -1C Gray Eagle Unmanned \nAircraft Systems is comprised of aircraft \nconfigured with multi -spectral targeting systems \n(electro-optical, infrared, laser designator, and IR \nilluminator) providing real -time full motion \nvideo, weapons, data links ; and ground control \nstations with communications equipment \nproviding line -of-sight and beyond- line-of-sight \ncontrol.  The system is a single-engine, propeller-\ndriven unmanned aircraft and includes the Gray Eagle Extended Range Engineering Change \nProposal, which extends the aircraft’s range and endurance.  The Air Force completed divestment \nof MQ-1B in FY 2018 and replaced all aircraft with MQ-9 Reapers.   \nMission:  Operates over-the-horizon at medium altitude for long endurance and provides real-time \nintelligence, surveillance, reconnaissance, target acquisition, and strike capability to aggressively \nprosecute time-sensitive targets.  The system includes a Synthetic Aperture Radar, Ground Moving \nTarget Indicator, a communications relay capability, a heavy fuel engine, encrypted tactical \ncommon data link, and greater weapons capability.   \n \nFY 2025 Program:  S upports the procurement of Heavy Fuel Engines for the Gray Eagle air \nvehicle.  The new engine propulsion system provide s a viable solution to ensure operational \nreadiness for the enduring MQ-1C Gray Eagle fleet and associated weapons systems. Funding also \nsupports the development and procurement of Assured Position Navigation & Timing ( A-PNT) \nkits for the Vision Based Navigation (VBN), which includes a processor, down facing camera, and \nassociated cabling. VBN provides a \"non- GPS\" based navigation solution on the Gray E agle \naircraft to operate in a GPS denied environment. VBN provides an alternate  means of estimating \naircraft position during GPS denial/outage by tracking aircraft movement using video imagery. \n \nPrime Contractor(s):  General Atomics-Aeronautical Systems Incorporated; San Diego, CA \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E\nGray Eagle USA -              4.5          -              6.6          -              6.7          \nProcure me nt\nGray Eagle USA 12           483.0      -              15.0        -              23.9        \n   Total 12           487.5      -              21.6        -              30.5        \nMQ-1C Gray Eagle\nFY 2023 FY 2024 FY 2025\nNote:  Includes Modification Program                                                                Numbers may not add due to rounding \n \nMQ-1C Gray eagleMQ-1C Gray Eagle \nUS Army Photo \nMQ-1C Gray Eagle"
    },
    {
      "page": 24,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-6 \n \nThe U.S. Air Force (USAF) MQ-9 Reaper \nUnmanned Aircraft System (UAS) and the \nUnited States Marine Corps (USMC) Group 5 \nUAS programs are comprised of an aircraft \nsegment configured with an array of sensors; to \ninclude day/night Full Motion Video, Signals \nIntelligence, and Synthetic Aperture Radar \nsensor payloads ; avionics, data links and weapons; a ground control segment consisting of a \nLaunch and Recovery Element; and a Mission Control Element with embedded Line-of-Sight and \nBeyond-Line-of-Sight communications equipment.  The Reaper is a single -engine, turbo-prop, \nremotely piloted armed reconnaissance aircraft designed to operate over -the-horizon at medium \naltitude for long endurance.  MQ -9 provides the interim solution for the USMC Group 5 UAS \nrequirement.  Funding for U.S. Special Operations Command (USSOCOM) procures Special \nOperations Force (SOF) peculiar kits, payloads, and modifications. \n \n \nMission:  Provides reconnaissance and embedded strike capability against time-critical targets.  \n  \n \nFY 2025 Program:  Continue s to develop, test, and integrate USMC -unique sensors and SOF -\npeculiar emerging technology mission kits, weapons, and modifications on USMC Group 5 UAS \n(MQ-9) Extended Range air vehicles.  This request funds support equipment and primary satellite \nlink equipment.  The USAF MQ- 9 program will continue MQ -9 Multi -Domain Operations \n(M2DO) capability enhancements.  The USAF program will focus on accelerating C2 Resiliency \ndevelopment and fielding efforts.  \n \nPrime Contractor(s):  General Atomics–Aeronautical Systems Incorporated; San Diego, CA \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E\nUSAF -              144.8      -              81.1        -              7.1          \nUSN/USMC -              96.3        -              108.2      -              99.9        \nSOCOM -              43.3        -              37.2        -              34.9        \nSubtotal -              284.4      -              226.5      -              141.9      \nProcure me nt\nUSAF -              234.6      -              98.1        -              12.4        \nUSN/USMC 5             190.0      5             187.6      -              131.8      \nSOCOM -              14.0        -              17.7        -              19.1        \nSubtotal 5             438.6      5             303.4      -              163.2      \n   Total 5             723.0      5             529.9      -              305.1      \nMQ–9 Reaper / USMC Group 5 UAS \nFY 2023 FY 2024 FY 2025\n \nNote:  Includes Modification Program                                                                Numbers may not add due to rounding \n \nMQ-9 Reaper / USMC Group 5 UAS \nUSAF Photo"
    },
    {
      "page": 25,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-7 \n \nThe Navy (USN) MQ-4C Triton, U.S. Air Force \n(USAF) RQ-4 Global Hawk, and North Atlantic \nTreaty Organization (NATO) Alliance Ground \nSurveillance (AGS) Unmanned Aircraft Systems \n(UAS) provide high altitude long endurance \nIntelligence, Surveillance, and Reconnaissance \n(ISR) capabilities.  The MQ -4C provides the \nNavy with a persistent maritime ISR capability.  Mission systems include inverse Synthetic \nAperture Radar  (SAR), Electro -optical/Infra-red Full Motion Video maritime moving target \ndetection, Electronic Support Measures, Automatic Identification System, a basic communications \nrelay capability, and Link -16.  The RQ -4 Block 40 includes multi -platform radar technology for \nSAR imaging and moving target detection.  All RQ-4 aircraft have been delivered. \n \nMission:  The Navy MQ-4C provides persistent maritime ISR and Multi-Intelligence (Multi-INT), \nwhile the USAF and NATO AGS RQ- 4 systems perform high- altitude, near -real-time, high -\nresolution ISR collection.  Both systems support Combatant Commander requirements while the \nMQ-4C also supports the numbered Fleet commanders with three worldwide orbits. \n \nFY 2025 Program:  Continues to provide funding for  airframe support and training equipment .  \nIn addition, it continues to fund software and hardware development for M ulti-INT Increment 1 \n(IOC) correction of deficiencies and Increment 2 enhanced Multi -INT capabilities.  RQ -4 funds \nsupport infrastructure and system sustainment efforts, and the U.S. contribution to the NATO AGS \nduring program office liquidation. FY 2024 was the last year of procurement for MQ-4C.   \n \nPrime Contractor(s):  Northrop Grumman; Rancho Bernardo, CA  \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E\nRQ-4, USAF -              36.8        -              1.2          -              9.5          \nRQ-4, NATO -              0.8          -              0.0          -              0.9          \nMQ-4, USN -              164.0      -              312.5      -              458.4      \nSubtotal -              201.6      -              313.7      -              468.8      \nProcure me nt\nRQ-4, USAF -              41.0        -              -            -              -            \nMQ-4, USN 3             736.5      2             510.0      -              281.3      \nSubtotal 3             777.5      2             510.0      -              281.3      \n   Total 3             979.1      2             823.7      -              750.1      \nMQ-4C Triton / RQ-4 Global Hawk / NATO AGS\nFY 2024 FY 2025FY 2023\n \nNote: Includes Modification Program                                                                 Numbers may not add due to rounding \n \nMQ-4C Triton/RQ-4 Global Hawk/NATO AGS \nUS Navy Photo"
    },
    {
      "page": 26,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-8 \n \nArmed Overwatch provides Special \nOperations Forces  (SOF) with crewed \ndeployable, affordable, and sustainable \nmanned aircraft systems capable of \nexecuting Close Air Support (CAS), \nprecision strike, and armed \nIntelligence, Surveillance, and \nReconnaissance (ISR) requirements in \naustere and permissive environments \nfor use in i rregular warfare operations \nin support of the National Defense \nStrategy. \n \nMission:  Provides CAS, precision strike, and armed ISR. \n \nFY 2025 Program:  Funds the procurement and fielding of 12 Armed Overwatch aircraft, initial \nspares, prime contractor systems engineering and program management, support equipment, \ninterim contract support, two cockpit familiarization training devices, two weapon system trainers, \nmission planning systems, and other government costs to include emerging system safety \nenhancements. RDT&E investments continue for SOF integration, testing and aircraft \ncertifications and necessary verification test ing. Initial developments begin for modular payload \nintegration activities and required operational testing. \n \nPrime Contractor(s):   L-3 Harris; Waco, TX \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               1.2           -               2.0           -               2.0           \nProcure me nt 9              246.0       12            266.8       12            335.5       \n   Total 9              247.2       12            268.8       12            337.5       \nArmed Overwatch / Targeting\nFY 2024 FY 2025FY 2023\n \n                                                                                                                             Numbers may not add due to rounding  \n \nArmed Overwatch/ Targeting"
    },
    {
      "page": 27,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-9 \nThe AH -64E Apache program is a \nremanufacture effort  that integrates a \nmast-mounted fire control radar into an \nupgraded and enhanced AH-64 airframe.  \nThe remanufacture effort results in a \nzero-time Longbow Apache, which \nrestarts its service life and modernizes  \nthe aircraft with updated technologies \nand performance enhancements to keep \nit viable throughout its lifecycle.  The AH -64E program incorporates a new power train system \nthat restores the aircraft to its previous flight performance capabilities that have been reduced over \nthe years due to added weight.  The AH -64E has all -new open architecture computer systems , \nincluding an all -digital cockpit flight control.  The aircraft also has manned/unmanned teaming \ncapability with the Army’s Unmanned Aerial Systems , giving the system far greater targeting \ndistances.  Additionally, the AH -64E can share targeting data with Joint F orces via its onboard \nLink 16 system.   \n \nMission:  C onducts armed reconnaissance, close combat, mobile strike, and vertical maneuver \nmissions in day, night, obscured battlefields, and adverse weather conditions.   \n \nFY 2025 Program:  Funds the procurement of 31  AH-64E remanufactured aircraft.  FY 2025 is \nthe fourth year in a Multiyear Procurement Contract (FY 2022 – FY 202 5).  For capability \nenhancements, the FY 2025 program includes funding to begin designing, integrating, and \nqualifying an oil-cooled generator for the AH -64E to resolve issues with the current legacy air -\ncooled generator. \n \nPrime Contractor(s):  The Boeing Company; Mesa, AZ \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -              26.6        -              10.5        -              8.2          \nProcure me nt\nAH-64E Reman 38           787.8      42           828.9      31           570.7      \nModifications -              85.8        -              113.1      -              81.0        \nTotal 38           900.2      42           952.6      31           659.9      \nAH-64E Apache\nFY 2024 FY 2025FY 2023\n \nNote:  Includes Modification Program                                                                    Numbers may not add due to rounding \n \nAH-64E Apache \n            \n  \nUS Army Photo"
    },
    {
      "page": 28,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-10 \nThe CH-47F Improved Cargo Helicopter program \nprocures new and remanufactured Service Life \nExtension Program CH -47F helicopters.  The \naircraft includes an upgraded digital cockpit and \nmodifications to the airframe to reduce vibration.  \nThe upgraded cockpit contain s a digital data bus \nthat permits enhanced communications and \nnavigation equipment for improved situational \nawareness, mission performance, and survivability.  The new aircraft uses more powerful T55-\nGA-714A engines, improving fuel efficiency and lift performance.  The primary users of t hese \naircraft are heavy helicopter companies (CH -47F) and Special Operations Aviation (MH -47G).  \nThe Army plans to use the CH -47F as its heavy- lift helicopter until the late 2030s.  The \nrecapitalization of the MH -47G airframes is required to extend the useful life of legacy aircraft.  \nThe CH -47F Block II development effort is in Engineering and Manufacturing Development.  \nImprovements include increased lift, engine control, upgraded drive train components , and \nadvanced flight controls.   \n \nMission:  Performs heavy lift missions, including troop transport, air assault, resupply in combat, \ncombat support, and combat service support. \n \nFY 2025 Program:  Procures four MH-47G aircraft and six CH-47F aircraft.  Funds the continued \nmodernization of the Army’s only heavy lift helicopter, including integration and improvements \nthrough the program of record.   \n \nPrime Contractor(s):  The Boeing Company; Philadelphia, PA. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -              65.6        -              9.3          -              4.8          \nProcure me nt\nMH-47G Production 4             187.9      6             221.4      4             234.5      \nCH-47F Production 3             200.0      -              -            6             465.2      \nModifications -              49.4        -              20.7        -              15.8        \n   Total 7             502.9      6             251.4      10           720.3      \nCH-47 Chinook \nFY 2024 FY 2025FY 2023\n \nNote: Includes Modification Program  Numbers may not add due to rounding \n \nCH-47 Chinook \n            \n  \nUS Army Photo"
    },
    {
      "page": 29,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-11 \nThe UH-60 Black Hawk is a twin -engine, single-\nrotor, four -bladed utility helicopter designed to \ncarry a crew of four and a combat-equipped squad \nof 11 soldiers or an external load of  up to 9,000 \npounds.  The UH-60 comes in many variants, with \nmany modifications and capabilities to fulfill \ndifferent roles.  The Army variants can be fitted \nwith stub wings to carry additional fue l tanks or \nweapons.  The UH-60M Black Hawk is a digital \nnetworked platform with improved range and lift to support operational Commanders through air \nassault, general support command and control, and aeromedical evacuation.  A n HH-60M is a  \nUH-60M Black Haw k integrated with the m edical evacuation mission kit, which provides \nday/night and adverse weather emergency evacuation of casualties.   \n \nMission:  Provides a highly maneuverable, air transportable, troop -carrying helicopter for all \nintensities of conflict without regard to geographical location or environmental conditions.  It \nmoves troops, equipment, and supplies into combat , performing  aeromedical evacuation and \nmultiple functions supporting the Army’s air mobility doctrine.  \n \nFY 2025 Program:  Funds procure ment of  24 aircraft (9 UH-60M and 15 HH-60M), related \ninstallations, and government-furnished equipment.   FY 2025 is the fourth  year of a five -year \nmultiyear procurement contract (FY 2022 – FY 2026). \n \nPrime Contractor(s):  UH-60M: Airframe/CFE - Sikorsky, A Lockheed Martin Company; \n                                      Stratford, CT  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -              -            -              1.5          -              25.0        \nProcure me nt\nUH-60M 35           990.5      24           760.8      24           767.2      \nUH-60V 21           178.7      26           153.2      -              -            \n   Total 56           1,169.1   50           915.5      24           792.2      \nUH-60 Black Hawk\nFY 2024 FY 2025FY 2023\n \n                                                                                                                             Numbers may not add due to rounding \n \nUH-60 Black Hawk \n            \n  \nUS Army Photo"
    },
    {
      "page": 30,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-12 \nThe Future Long Range Assault Aircraft (FLRAA) \nis a major defense acquisition program that will \ndevelop and field the next generation of affordable \nvertical lift tactical assault/utility aircraft for the \nArmy.  This medium -lift tactical assault and \nmedical evacuation aircraft will augment the \nArmy’s H-60 Black Hawk utility helicopter fleet to \nprovide the combat aviation brigades with long-\nrange, high-speed, survivable options in contested \nenvironments.  The Army competitively awarded \nthe weapon system development contract in \nDecember 2022.     \n \nMission: Conducts air assault, urban assault/security, maritime interdiction, medical evacuation, \nhumanitarian assistance/disaster relief, tactical resupply, direct action, noncombatant evacuation, \nand combat search and rescue operations.  FLRAA will support the Army, including Special \nOperations Command (USSOCOM) and the Joint Force, in a contested, near -peer threat \nenvironment.  The FLRAA weapon system will retain the Army’s ability to project combat power \nwith transformational increases in range, speed, mobility, and payload over current Ar my and \nUSSOCOM aircraft. \n \nFY 2025 Program:  F unds post Milestone B activities and continued development of a digital \nbackbone architected to meet modular open system approach objectives and developmental \nprototype assembly and integration for qualification and test. \n \nPrime Contractor(s): Bell Helicopter Textron, Incorporated; Ft. Worth, TX \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -              664.8      -              1,044.1   -              1,260.2   \nProcure me nt -              -            -              -            -              -            \n   Total -              664.8      -              1,044.1   -              1,260.2   \nFuture Long-Range Assault Aircraft\nFY 2024 FY 2025FY 2023\n \n                                                                                                                             Numbers may not add due to rounding  \n \nFuture Long-Range Assault Aircraft \n            \n  \nUS Army Photo"
    },
    {
      "page": 31,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-13 \n \nThe U nited States  Navy MQ -25A Stingray and the \nUnmanned Carrier Aviation (UCA) Mission Control \nSystem (UMCS) program s are developing an \nunmanned capability to embark as part of the Carrier \nAir Wing (CVW) for aerial refueling and Intelligence, \nSurveillance, and Reconnaissance missions.  The MQ-\n25 will extend the CVW mission effectiveness range \nand mitigate the current Carrier Strike Group organic \nISR shortfall.  As the first carrier -based Group 5 \nUnmanned Aircraft System , the MQ -25 will pioneer \nthe integration of manned and unmanned operations ; \ndemonstrate complex sea- based Command, Control, \nCommunications, Computers, a nd Intelligence \ntechnologies; and pave the way for future multi-mission \nUAS to pace emerging threats.  The MQ -25 was previously funded under the Unmanned Carrier \nLaunched Airborne Surveillance and Strike program.  The program entered Engineering and \nManufacturing Development in the fourth quarter of FY 2018.  The Navy expects to provide the \nfleet with an Initial Operational Capability (IOC) for MQ-25 by FY 2026. \n \nMission:  Conducts aerial refueling as a primary mission and provides ISR as a secondary mission.   \n \nFY 2025 Program:  Funds continuation of Ground Control Station integration and begins ground \nand flight tests with the air vehicles.  All four Engineering Development Models (EDMs) and one \nof the three System Demonstration Test Articles (SDTAs) will be delivered to the test program \nand be available for ground and flight testing.  The FY 2025 budget funds three Low- Rate Initial \nProduction (LRIP) MQ-25 aircraft and advanced procurement supporting LRIP Lot 2 (three MQ-\n25 aircraft) long lead materials.  Also, it funds the UMCS program that builds, integrates, installs, \nand sustains the systems (control station, communications, and networks) required to operate the \nMQ-25 and performs ship installations associated with the MQ -25.  In FY  2025, the UMCS \nprogram will finalize the interface design and install the MD-5E Embarkable system.   \nPrime Contractor(s):  Airframe: Boeing; St. Louis, MO \n     UMCS: Lockheed Martin; Fort Worth, TX  \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               250.9       -               220.4       -               214.9       \nProcurement - MQ-25 1              748.2       3              596.3       3              553.0       \nPr ocur em ent - UMCS -               134.7       -               152.7       -               130.1       \n   Total 1              1,133.8    3              969.4       3              898.0       \nMQ-25 Stingray/Unmanned Carrier Aviation\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                             Numbers may not add due to rounding \nMQ-25 Stingray/Unmanned Carrier Aviation"
    },
    {
      "page": 32,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-14 \nThe F/A-18 E/F Super Hornet is a carrier -based \nmulti-role tactical fighter and attack aircraft.   Two \nversions are in production:  the single-seat E model \nand the two-seat F model.  The Super Hornet is an \nattack aircraft as well as a fighter through selected \nuse of external equipment and advanced \nnetworking capabilities to accomplish specific \nmissions.  This “force multiplier” capability gives \nthe operational commander more flexibility in \nemploying tactical aircraft in a rapidly  changing \nbattle scenario.  In its fighter mode, the aircraft \nserves as escort and fleet air defense.  In its attack \nmode, the aircraft provides force projection, \ninterdiction, and close and deep air support. \n \nMission:  Provides multi -role attack and strike fighter capability, which includes the traditional \napplications, such as fighter escort and fleet air defense, combined with the attack applications, \nsuch as interdiction and close air support. \n \nFY 2025 Program:   Continues Production Line Shutdown as FY 2023  is the last year of the \nE/F model multiyear procurement contract (FY 2021 - FY 2023).  Continues to fund spares, repair \nparts, and the Service Life Extension Program to maintain sufficient aircraft inventory to meet \nfleet operational requirements through FY 2046.  Development and integration of critical aircraft \nsystems, like the Infrared Search and Track  (IRST) pod, continues to ensure the F/A -18 E/F can \nmeet advanced threats expected in 2025 and beyond. \n \nPrime Contractor(s):  Airframe:  Boeing; St. Louis, MO \n                           Engine:  General Electric Company; Lynn, MA \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qt y $M\nRDT&E -               283.7       -               365.9       -               382.8       \nProcure me nt 8              1,780.3    -               1,466.2    -               1,422.8    \nTotal 8              2,064.0    -               1,832.1    -               1,805.6    \nF/A-18 E/F Super Hornet\nFY 2023 FY 2024 FY 2025\nNOTE:  Includes IRST and Modification funding.                                             Numbers may not add due to rounding  \nF/A-18 Super Hornet \nUS Navy Photo"
    },
    {
      "page": 33,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-15 \nThe E-2D Advanced Hawkeye is an airborne \nearly warning, all weather, twin -engine, \ncarrier-based aircraft designed to extend task \nforce defense perimeters.   The Advanced \nHawkeye provides improved battlespace target \ndetection and situational awareness, especially \nin the  littorals; supports the Theater Air and \nMissile Defense operations;  and improves \noperational availability for the radar system.  \nRelative to the E-2C aircraft, the E-2D aircraft \nprovides increased electrical power, a \nstrengthened fuselage, an upgraded radar \nsystem, communication s suite, and mission \ncomputer. \n \nMission:  Provides theater air and missile sensing and early warning; battlefield management \ncommand and control; acquisition tracking and targeting of surface warfare contacts; surveillance \nof littoral area objectives and targets; and tracking of strike warfare assets. \n \nFY 2025 Program:  Continues production line shutdown as FY 2023 was  the last year of the E -\n2D  multiyear procurement contract (FY 2019 – FY 2023).  Production line shutdown will occur \nin 2029 unless new orders are received.  Continues funding for associated support  and continued \ndevelopment of systems, in addition to the procurement of various equipment required to establish \norganic depot capability.   \n \nPrime Contractor(s):  Airframe:  Northrop Grumman Corporation;  \n                                                        Bethpage, NY (Engineering)  \n                                                        St. Augustine, FL (Manufacturing) \n                           Eng ine:  Rolls-Royce Corporation; Indianapolis, IN \n                           Radar:  Lockheed Martin Corporation; Syracuse, NY  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&\nE -               440.7       -               399.9       -               301.4       \nProcure me nt 7              1,206.2    -               182.8       -               197.7       \n   Total 7              1,646.9    -               582.7       -               499.1       \nE-2D Advanced Hawkeye\nFY 2023 FY 2024 FY 2025\n \n          Numbers may not add due to rounding \nE-2D Advance Hawkeye \nUS Navy Photo"
    },
    {
      "page": 34,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-16 \n \nThe CH-53K King Stallion is the only \nmarinized heavy -lift helicopter  and \nreplaces the U nited States  Marine \nCorps CH-53E Super Stallion, which \nwas introduced in 1980.  The CH-53K \nprovides improved lift and range \ncapabilities, payload, performance, \ncargo handling, reliability and \nmaintainability, interoperability, \nsurvivability, ship integration, and force protection.  The CH -53K is designed to support Marine \nAir-Ground Task Force (MAGTF) h eavy-lift requirements in the 21st- century joint environment \nand is the only heavy- lift platform that can lift the MAGTF ashore.  The CH -53K provides an \nunparalleled high-altitude lift capability with nearly three times the external lift capacity of the \nCH-53E.  The total CH-53K program of record quantity is 200 operational aircraft with 4 System \nDemonstration Test Articles and 196 aircraft funded with Aircraft Procurement, Navy.  The Navy \ncompleted initial operational test & e valuation in April 2022, achieved initial operational \ncapability in May 2022, and approved full-rate production in December 2022.   \n \nMission:  Conducts expeditionary heavy-lift assault transport of armored vehicles, equipment, and \npersonnel to support distributed operations deep inland from a sea-based center of operations.   \n \nFY 2025 Program:  Funds procurement of 19 aircraft , advance procurement for long -lead \nmaterials, and T-408 engine economic order quantity requirements.  FY 2025 is the first year of a \nnew two-year block buy contract for airframes (FY 2025 – FY 2026) and a new five -year multi-\nyear procurement contract for engines (FY 2025 – FY 2029).  The program also includes \ndevelopment funds for follow-on improvements and to stand up government test capabilities.  \n \nPrime Contractor(s):  Airframe: Sikorsky Aircraft Corporation; Stratford, CT \n                                      Engines: General Electric Company; Lynn, MA \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -              213.6      -              222.3      -              86.1        \nProcure me nt 12           2,258.0   15           2,196.0   19           2,598.9   \n   Total 12           2,471.6   15           2,418.3   19           2,685.0   \nCH-53K Heavy Lift Replacement Helicopter\nFY 2023 FY 2024 FY 2025\n \nNote:  Includes Modification Program                                                                    Numbers may not add due to rounding \n \nCH-53K Heavy Lift Helicopter"
    },
    {
      "page": 35,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-17 \n \nThe B-21 Raider, previously referred to as the Long \nRange Strike-Bomber, is a new, high- tech long range \nbomber that will replace B-1 and B-2 bombers.  The B-\n21 will be a key component of the joint portfolio of \nconventional and nuclear capable deep -strike \ncapabilities.  The B-21 will be delivered to operational \nbases in the mid-2020’s.  The B -21 has been designed \nas a dual capable aircraft, with the ability to employ \nnuclear weapons, per congressional direction, not later \nthan 2 years after conventional Initial Operational \nCapability ( IOC). The B -21 program is planning to \nachieve nuclear certification at the earliest opportunity.  \nHighly survivable, the B-21 Raider will have the ability to penetrate modern air defenses.  The Air \nForce plans to procure a minimum of 100 aircraft.  Manufacturing of the test aircraft is underway \nat Northrop Grumman’s facility in Air Force Plant 42.  The 420th Flight Test Squadron at Edwards \nAir Force Base (AFB) was reactivated on October 4, 2019 to prepare for B -21 flight test.  On \nMarch 27, 2019, the Secretary of the Air Force announced that Ellsworth AFB, South Dakota, \nWhiteman AFB, Missouri and Dyess AFB, Texas are the preferred Main Operating Base locations.  \nEllsworth AFB, South Dakota was approved as MOB #1 on June 3, 2021. \n \nMission:  Destroys strategic targets to debilitate an adversary’s capacity and capability to wage \nwar.  The B-21 will deliver the capability to operate in contested environments, counter emerging \nthreats, and support the nuclear triad by providing a visible and flexible nuc lear deterrent \ncapability.  Additional details are classified. \n \nFY 2025 Program:   Continues Engineering and Manufacturing Development of the B -21.  \nProcurement funds continue the transition into low rate initial production, which includes long \nlead parts.  Additional details are classified. \n \nPrime Contractor(s):  Northrup Grumman Corporation; Falls Church, VA \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT\n&E -               3,037.5    -               2,984.1    -               2,654.1    \nProcure me nt -               1,716.8    -               2,332.1    -               2,684.4    \n   Total -               4,754.3    -               5,316.2    -               5,338.5    \nB-21 Raider\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nB-21 Raider \nUSAF Photo"
    },
    {
      "page": 36,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-18 \n \nBombers provide an intercontinental \ncapability to rapidly strike surface targets.  \nThe Air Force legacy  bomber fleet includes \nthe B-1B, B-2, and B-52H aircraft.  The B-1B \nLancer, fielding completed in 1988, is a \nswing-wing, supersonic, long- range \nconventional bomber and carries the largest \npayload of both guided and unguided weapons \nin the Air Force inventory.  The multi-mission \nB-1B is the backbone of the U.S. long -range \nconventional bomber force and can ra pidly \ndeliver massive quantities of both precision \nand non-precision weapons against any adversary, any place in the world, at any time.  The B -2 \nSpirit, fielded in the 1997, is a multi- engine, long range  conventional and nuclear bomber \nincorporating low-observable technology that enables the B-2 to penetrate enemy air defenses and \nstrike high-value targets.  The B -52H Stratofortress, fielding completed in 1962, is a long range, \nsubsonic, strategic bomber that provides nuclear and conventional missions. \n \nMission:  Fly into enemy territory to destroy strategic targets such as major military installations, \nfactories, and ports to debilitate an adversary’s capacity to wage war.  The B -1B bomber can \nperform a variety of missions, including that of conventional carrier for theater operations and can \nrapidly deliver massive quantities of both precision and non- precision weapons against any \nadversary, worldwide, at any time.  The B -2 aircraft delivers both conventional and nuclear \nmunitions, capable of massive firepower in short time anywhere , is the only aircraft capable of \npenetrating enemy defenses to bomb heavily defended targets, and the only aircraft to carry the \n30,000 pound GBU-57 Massive Ordnance Penetrator.  The B-52H aircraft conducts both nuclear \nand conventional missions and carries the widest variety of weapons of all the bombers, including \nthe only aircraft to carry the AGM-86 Air Launched Cruise Missile, a nuclear cruise missile. \n \nFY 2025 Program:  Continues upgrades to modernize legacy bombers including avionics, \ncommunications, radar, engine, and weapons efforts. \n \nPrime Contractor(s):  B-2:  Northrop Grumman Aerospace Systems; Palmdale, CA  \n     B-1B, B-52H:  Boeing Defense; Oklahoma City, OK  \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               821.9       -               1,051.1    -               1,104.7    \nProcure me nt -               223.5       -               203.6       -               289.7       \n   Total -               1,045.4    -               1,254.7    -               1,394.4    \nBombers\nFY 2023 FY 2024 FY 2025\n \nNote: Includes Modification Program                                                                 Numbers may not add due to rounding \nBombers"
    },
    {
      "page": 37,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-19 \n \nThe KC -46A Pegasus provides aerial \nrefueling support to Air Force, Navy, \nMarine Corps , and allied  aircraft.  The \naircraft offers increased refueling \ncapacity, improved efficiency, and cargo \nand aeromedical evacuation capability \nover the current KC -135 Stratotanker, \nwhich is over 50 years old.  The KC -46A \nis the first phase of aerial refueling tanker \nrecapitalization, replacing approximately one-third of the current legacy tanker fleet.  The KC-46A \naircraft is assembled on the existing commercial 767 production line and militarized in the Everett \nModification Center, both in Everett, Washington.  Follow- on aerial refueling tanker pr ograms \nwill ultimately recapitalize the entire fleet over more than 30 years.  Boeing has delivered 80 \naircraft to the USAF as of January 13, 2024. \n \nMission:  Provides the capability to refuel joint and coalition receivers via a boom or drogue \nsystem and w ill augment the airlift fleet with cargo, passenger , and aeromedical evacuation \ncapabilities.  The Air Force uses tanker aircraft to support these strategic, operational, and tactical \nmissions across the entire spectrum of military operations.  The KC -46A aircraft will operate in \nday, night, and adverse weather to enable deployment, employment, and redeployment of U nited \nStates and coalition forces. \n \nFY 2025 Program:  Procures 15 aircraft and continues the Air Force’s development efforts of a \nmilitarized variant of the Boeing 767- 2C aircraft to in tegrate military capabilities into four \ndevelopment aircraft and the associated developmental and operational testing.  Funds also support \nthe development of technical manuals, training systems, and a collection of simulator and \nmaintenance data. \n \nPrime Contractor(s):  The Boeing Company; Seattle, WA \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qt y $M\nRDT&E -               140.4       -               124.7       -               93.6         \nProcure me nt 15            2,458.7    15            2,882.6    15            2,854.7    \nMods -               0.5           -               -             -               25.0         \n   Total 15            2,599.6    15            3,007.3    15            2,973.3    \nKC-46A Tanker\nFY 2023 FY 2024 FY 2025\n \nNote: Includes Modification Program                                                                 Numbers may not add due to rounding  \nKC-46A Tanker \nUSAF Photo"
    },
    {
      "page": 38,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-20 \n \nThe VC -25B P residential Aircraft \nRecapitalization program will replace the \ncurrent VC-25A (Boeing 747- 200) “Air \nForce One” aircraft with a new, modified \n747-8.  The  VC-25B will provide the \nPresident, staff, and guests with safe and \nreliable air transportation at the same level \nof security and communications \ncapability available in the White House.   \nThe 747-8 aircraft modifications will \ninclude an electrical power upgrade, dual \nauxiliary power units  usable in flight, a mission communication system, an executive interior, \nmilitary avionics, a self -defense system, autonomous enplaning and deplaning, and autonomous \nbaggage loading.  The Air Force awarded the $3.9 billion firm-fixed-price contract for engineering \nand manufacturing development, detailed design, modification, certification, and fielding of two \npresidential, mission-ready 747-8 aircraft in July 2018. \n \nMission:  Provides safe, secure, worldwide transport to ens ure the President can execute the \nconstitutional roles of Commander-in-Chief, Head of State, and Chief Executive. \n \nFY 2025 Program:   Continues the Engineering and Manufacturing Development phase of \nacquiring and modifying two commercial aircraft to field the capability by 2028. \n \nPrime Contractor(s):  The Boeing Company; Seattle, WA \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               79.6         -               490.7       -               433.9       \nProcure me nt -               -             -               -             -               -             \n   Total -               79.6         -               490.7       -               433.9       \nVC-25B Presidential Aircraft Recapitalization\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                            Numbers may not add due to rounding  \nVC-25B Presidential Aircraft Recapitalization"
    },
    {
      "page": 39,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-21 \nThe F -22 Raptor is a fifth- generation air \nsuperiority fighter aircraft.  The Raptor is \ndesigned to penetrate enemy airspace and \nachieve first-look, first-shot, first-kill capability \nagainst multiple targets.  It has unprecedented \nsurvivability and lethality, ensuring the Joint \nForces have freedom from attack, f reedom to \nmaneuver, and freedom to attack in the assurance \nof world-wide air dominance. \n \nMission:  Provides the U.S. enhanced air superiority/global strike capability to counter and defeat \nair-to-air and air -to-ground threats in highly contested environment by conducting counter -air, \ndestruction of enemy air defenses, and cruise missile defense missions. \n \nFY 2025 Program: Continues deliberate investments via the Raptor A gile Capability Release \nprogram to ensure F -22s are upgraded with state -of-the-art sensors, improved survivability, \nenhanced interoperability, and extended range and time on station.  The FY 2025 program \ncontinues critical planned modernization for F -22 aircraft via incremental capability upgrades , \nincremental development efforts, and key reliability and maintainability improvements that will \nenhance the F-22 Air Superiority and Global Strike capabilities in highly contested environments.  \nWith the completion of Increment 3.2B modernization, F -22 programs will continue to  release \nupgraded communications systems, navigation systems, reliability and maintainability \nimprovements, critical sensor enhancement capabilities, and low drag tanks/pylons capabilities to \nmeet advanced threats expected in 2026 and beyond. \n \nPrime Contractor(s):  Airframe:  Lockheed Martin; Marietta, GA and Fort Worth, TX  \n                                      Engine:  Pratt & Whitney; Hartford, CT\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qt y $M Qty $M\nRDT&E -               542.7       -               725.9       -               768.6       \nProcure me nt -               719.9       -               794.7       -               861.1       \n   Total -               1,262.6    -               1,520.6    -               1,629.7    \nF-22 Raptor\nFY 2023 FY 2024 FY 2025\n \nNote: Includes Modification Program                                                                 Numbers may not add due to rounding  \nF-22 Raptor"
    },
    {
      "page": 40,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-22 \n \nThe F-15E is a twin engine, dual seat, supersonic \ndual-role, all -weather, deep interdiction fighter \nwith multi- role air -to-air/air-to-ground \ncapabilities.  The F -15EX is a modernized \nderivative of the F -15E with advanced flight \ncontrols, superior sensors, and increased weapons \ncapacity and range needed to defend critical \nlocations in highly contested environments  by recapitalizing the divesting F -15C/D fleet.               \nThe F -15 C/D is a twin engine (F -15C single seat; F -15D dual seat), supersonic, all -weather, \nday/night, air superiority fourth- generation fighter aircraft (projected divestment target date of    \nFY 2026).   \n \nMission:  Supports the fifth- generation fighter fleet to gain and maintain a ir sup eriority and \nprovide global precision attack over the battlefield. \n \nFY 2025 Program:  Continues the procurement of the F-15EX aircraft and funds weapon system \nrequirements needed for operational conversion from F -15C/D to F -15EX.  T he Eagle \nPassive/Active Warning Survivability System production and installation efforts  will improve      \nF-15E/EX survivability by enhancing the ability to detect, deny, or defeat air and ground threats.  \nContinues F -15E modernization investment, focusing development efforts on the Operational \nFlight Program, weapons integration efforts, and test aircraft upgrades to meet the Air Force’s \ndevelopmental and operational test requirements .  Procurement funding continues modification \nand support investments in Advanced Display Core Processor II,  Data Transfer Module II,  \nMultifunctional Information Distribution System – Joint Tactical Radio System, and Mobile User \nObjective System / Second Generation Anti -Jam Tactical UHF Radio for NATO.   The FY 2024 \nbegan realigning the FYDP to Air Force divestment plans , projecting F -15C/D divestment  \ncompletions by FY 2026, while initiating partial divestment of F-15E fleet in FY 2025.\n \n \nPrime Contractor(s):  Boeing; St. Louis, MO   \n \n \nQty $M Qty $M Qty $M\nF-15EX\nRDT&E -               91.2         -               100.0       -               56.2         \nProcurement 24            2,735.8    24            2,898.0    18            1,808.5    \nSubtotal 24            2,826.9    24            2,998.0    18            1,864.7    \nF-15E Mods\nRDT&E -               258.9       -               64.9         -               178.6       \nProcurement -               452.2       -               315.5       -               317.8       \nSubtotal -               711.1       -               380.4       -               496.4       \n   Total 24            3,538.1    24            3,378.5    18            2,361.1    \nF-15EX Eagle II / F-15E Eagle\nFY 2023 FY 2024 FY 2025\n \nNote: Includes Modification Program                                                                 Numbers may not add due to rounding \nF-15 Eagle"
    },
    {
      "page": 41,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-23 \nThe HH-60W Program, formerly called  the \nCombat Rescue Helicopter (CRH)  and the  \nHH-60 Recapitalization, replaces the aging \nHH-60G Pave Hawk helicopter.  The HH-60W \nJolly Green II design is based on the  Army’s \nUH-60M Black Hawk, tailored  for Combat \nSearch and Rescue (CSAR) in all -weather \nsituations.  The HH-60W program leverage s \nin-service air vehicle designs and training \nsystems and integrates existing technologies \nand mission systems to build and acquire a new system.  Onboard defensive capabilities  and \nplanned upgrades will permit the HH-60W to operate in an environment with increased threats .  \nAn in -flight refueling capability will provide a n airborne -ready alert capability and extend its \ncombat mission range.  The Air Force acquired the last lot of aircraft in FY 2023, which completes \nthe planned procurement of 86 HH-60W aircraft. \n \nMission:  Conducts day and night marginal weather CSAR to recover downed aircrew and isolated \npersonnel in hostile environments.  The HH -60W will perform various  collateral missions, \nincluding casualty evacuation, medical evacuation, non-combat evacuation operations, civil search \nand rescue, international aid , disaster humanitarian relief , and insertion/extraction of combat \nforces. \n \nFY 2025 Program:   Procures  training devices, interim supply, contractor support for fielding \naircraft, and continued depot stand-up.  The funding also provides training for converting Kadena \nAFB and the Air National Guard to the HH-60W.   \n \nPrime Contractor(s): Sikorsky Aircraft Corporation (a Lockheed Martin Company);  \nStratford, CT \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               27.7         -               48.3         -               52.3         \nProcure me nt 20            1,209.1    -               282.5       -               191.6       \n   Total 20            1,236.8    -               330.8       -               243.9       \nHH-60W Combat Rescue Helicopter\nFY 2023 FY 2024 FY 2025\n \nNote: Includes Modification Program                                                                 Numbers may not add due to rounding \nHH-60W Combat Rescue Helicopter \nUSAF Photo"
    },
    {
      "page": 42,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-24 \nThe Advanced Pilot Training (APT) \nSystem, T-7A, Red Hawk, will replace \nthe Air Education and Training \nCommand’s fleet of T -38C aircraft, \ncurrently based in Mississippi, \nOklahoma, and Texas.  The APT \nprogram will provide aircraft, simulators, \nand advanced training capabilities needed to train future Air Force pilots to fly fourth and fifth \ngeneration fighter aircraft. The aircraft, with modern simulators, will enable a pilot training process \nthat produces pilots at a rate that meets the needs of the Air Force for the next several decades. \n \nMission:  Provides student pilots in the Specialized Undergraduate Pilot Training advanced phase \nand Introduction to Fighter Fundamentals, the skills and competencies required to transition more \neffectively into fourth and fifth- generation fighter and bomber aircraft.  The aircraft and \nmaintenance simulators will encompass a full range of physical devices and instructional \ntechniques (e.g., traditional classroom, online training, and virtual training). \n \nFY 2025 Program:  Continues execution of the fixed price Engineering and Manufacturing \nDevelopment (EMD) pending Milestone C sc heduled to occur in FY 2025 with the subsequent \npurchase of Low-Rate Production (LRIP) 1.  The production contract will include aircraft, spares, \nand Ground Based Training Systems.  Continues development, test, and evaluation efforts for the \nprogram.   \n \nPrime Contractor(s):  The Boeing Company; St. Louis, MO \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT\n&E -               32.5         -               77.3         -               84.0         \nProcure me nt -               10.5         -               -             7              235.2       \n   Total -               43.0         -               77.3         7              319.2       \nAdvanced Pilot Training (T-7A) \nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nAdvanced Pilot Training (T-7A) \nUSAF Photo"
    },
    {
      "page": 43,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-25 \n \nThe MH-139A program will procure 42 MH-139As to \nreplace the UH -1N fleet , which has significant \ncapability gaps in the areas of speed, range, endurance, \npayload capacity, and aircraft self -protection.  The \nMH-139A helicopters will eliminate these capability \ngaps, and the program will procure comprehensive \nTraining Systems.  The replacement MH-139A aircraft \nwill provide vertical airlift and support the \nrequirements of three Air Force major commands and \noperating agencies:  Air Force Global Strike Command \n(AFGSC), Air Force Reserve Command, and Air Force Material Command.  AFGSC is the Air \nForce lead command and operational capability requirements sponsor.  This program is an element \nof the Air Force's nuclear enterprise reform initiatives.\n \n \nMission:  Partially replaces the Vietnam-era UH-1N fleet that provides emergency response and \nconvoy support for the nuclear forces and address capability shortfalls in speed, range, endurance, \nand carrying capacity. Milestone C decision and low -rate initial production (LRIP) contract was \nawarded in March 2023; operational fielding will start in FY 2024. The program procured five  \naircraft in FY 2023 and seven in FY 2024 as part of the first LRIP. \n \nFY 2025 Program:  Procures a production lot of eight (8) aircraft with associated initial spares, \nsupport equipment, site activation support, training, publications and technical data, and other \nprogram management administration activities. \n \n \n \nPrime Contractor(s):  The Boeing Company; Ridley Park, PA \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qt y $M Qty $M\nRDT&E -               15.8         -               25.7         -               -             \nProcure me nt 5              197.4       7              249.1       8              333.4       \n   Total 5              213.3       7              274.8       8              333.4       \nMH-139A Grey Wolf\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                             Numbers may not add due to rounding  \nMH-139A Grey Wolf"
    },
    {
      "page": 44,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-26 \n \nThe E -7A Wedgetail program will replace the \ncurrent E -3G Airborne Warning and Control \nSystem (AWACS) aircraft.  The E -7A is an \nairborne early warning and control platform \nbased on the Boeing (737- 700) next generation \ndesign powered by twin CFM International \nCFM56-7 turbofan engines.  The E -7A provides \nimproved kill -chain effectiveness, enhanced \nsurvivability, reliability, and availability.  The E-7A's Multifunction Electronically Scanned Array \n(MESA) can be electronically steered, which offers better target detection and tracking, and more \nrobust electronic protection. \n \nMission:  Provides Airborne Moving Target Indicator (AMTI)/Battle Management Command and \nControl (BMC2) capability. \n \nFY 2025 Program:  Continues funding for the E-7A developmental contract to modify the current \nconfiguration baseline to incorporate M -code GPS, Mobile User Objective System (MUOS) \nsatellite communication, and mission system updates for cyber security and program protection.  \nThe E-7A Wedgetail acquisition is being managed under the Middle Tier Acquisition (MTA) rapid \nprototyping pathway. \n \nPrime Contractor(s):  The Boeing Company; Seattle, WA  \n    Northrop-Grumman (MESA radar); Baltimore, MD \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               411.7       -               681.0       -               418.5       \nProcure me nt -               -             -               -             -               -             \n   Total -               411.7       -               681.0       -               418.5       \nE-7A\nFY 2023 FY 2024 FY 2025\n     \n                                                                                                                        Numb ers may not add due to rounding \nE-7A"
    },
    {
      "page": 45,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nAircraft & Related Systems \n1-27 \n \nThe Air Force plans to acquire commercial -derivative \naircraft in the C-40 Fleet Expansion program, which will \naugment the current C -32A executive airlift fleet.  The \nacquisition will modify new-production business aircraft \nby integrating the military -specific modifications and \nSenior Leader Communications System -Airborne suite \nalready on the executive airlift fleet.   \n \nMission:  Supports the top five users: Vice President, First Spouse , Secretary of State, Secretary \nof Defense, and Chairman of the Joint Chiefs of Staff. \n \nFY 2025 Program:   Funds one commercial-derivative aircraft.  The acquisition will modify a \nnew-production, industry standard, business aircraft by integrating the military- specific \nmodifications and Senior Leader Communications System-Airborne suite already on the executive \nairlift fleet. \n \nPrime Contractor(s):  TBD  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               -             -               -             -               -             \nProcure me nt -               -             -               -             1              328.7       \n   Total -               -             -               -             1              328.7       \nC-40 Fleet Expansion\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                        Numb ers may not add due to rounding \nC-40 Fleet Expansion \nAir Force Photo: C-40C"
    },
    {
      "page": 46,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nThis page intentionally left blank."
    },
    {
      "page": 47,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nC4I Systems \n2-1 \nCommand, Control, Communications, Computers, and Intelligence \n(C4I) Systems \n \nThe Department is well underway in transforming and developing new concepts for the conduct \nof future joint military operations to achieve full spectrum dominance.  This overarching goal to \ndefeat any adversary or control any situation across the full range of military operations is achieved \nthrough a broad array of capabilities enabled by an interconnected network of sensors, shooters, \ncommand, control, and intelligence.  Net-centricity transformed the way information is managed \nto accelerate decision making, improve joint warfighting, and create intelligence advantages.  U.S. \nforces are heavily -networked and require reliable , secure, and trusted access to information and \ndepend on network-based interconnectivity for increased operational effectiveness.  By enhancing \ninformation sharing, dispersed forces are able to communicate, maneuver, share a common user -\ndefined operating picture, and successfully complete assigned missions more efficiently.  This \nportfolio also encompasses the development of technologies like gateways, waveforms, network \nmanagement, and information assurance. \n \nThe FY 2025 budget request displayed in this portfolio is $6.6 billion higher than what was \ndisplayed in the FY 2024 President’s Budget request.  The 45 percent increase is attributable to \nthe recategorization of programs from the Mission Support category into C4I and funding changes \nfor Combined Joint All-Domain Command (CJADC2), Artificial Intelligence (AI), Agile Software \ndevelopment, 5G communications and net-centricity service-based architecture. \n \nFY 2025 C4I Systems Total:  $21.1 Billion \n  \nAviation & \nSupport \nEquipment\n$1.8\nBase \nCommunications\n$2.0\nInformation \nSecurity\n$0.1\nTechnology \nDevelopment $8.5\nGround & Sea \nSupport\n$0.6\nCommunications & \nElectronics\n$7.9\nSupport \nEquipment\n$0.2\nNumbers may not add due to rounding \n$ in Billions"
    },
    {
      "page": 48,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nC4I Systems \n2-2 \n \nTactical Network Technology (TNT) \nModernization in Service (MIS) provides the \nArmy’s operational formations with \nmodernized At-the-Halt (ATH) and On -the-\nMove (OTM) satellite and line of sight \nnetwork connectivity through technological \nimprovement of the fielded tactical network \nbaseline.  This ATH  a nd OTM  TNT \ncapability keeps highly mobile and dispersed \nforces connected to one another from theater down to select company roles.  The TNT backbone \nallows forces to leverage Army and Joint resources through the Department of Defense \nInformation Network (DoDIN), providing tactical formations with reliable, secure, and seamless \nvideo, data, imagery, and voice services which enable multi-domain operations.  TNT MIS enables \nCombined Joint All Domain Command and Control (CJADC2) by providing network connectivity \nand transport for the ground domain, connecting the ground domain to the DoD Information \nNetwork (DoDIN) and enabling the Army's contribution to Joint Force Commanders. \n \nTNT MIS supports the near -term objectives of the Army Network Modernization Strategy by \nreplacing over time, non -sustainable/end of life equipment (switches, routers, servers, etc.) with \ntechnology that meets cyber and electronic warfare resiliency requirements of the expeditionary \nArmy.  This modernization reduces life cycle costs by reducing size, weight , and power; \nconsolidating capabilities that previously resided on individual hardware components ; and by  \nleveraging common commercial information technology solutions across various programs. \n \nMission:  Modernizes the Tactical Network as one the Army’s top six modernization priorities for \nmulti-domain operations and supports the Army of 2030 and 2040 initiatives. \n \nFY 2025 Program:  Procures and fields Mission Network refresh, initial spares, and \nmodernization of unsustainable end of life commercial technology in Corps through Battalion units \nacross the Army, Army Reserve, and Army National Guard by modernizing their network transport \nsystems and regional hub nodes. The FY 2025 Program also pilots Low Earth Orbit and Medium \nEarth Orbit satellite terminal capability in the ESB-E. \n \nPrime Contractor(s):  General Dynamics Mission Systems; Taunton, MA \n     Datapath Inc; Duluth, GA \n                                      L3Harris Corporation; Rochester, NY \n                                      Cubic Corporation-DTECH Labs; Ashburn, VA \n                                      Curtis-Wright Corporation, Pacstar; Portland, OR \n \nQty $M Qty $M Qty $M\nRDT&E -               -             -               -             -               -             \nProcure me nt -               362.9       -               358.6       -               280.8        \n   Total -               362.9       -               358.6       -               280.8        \nTactical Network Technology\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nTactical Network Technology"
    },
    {
      "page": 49,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nC4I Systems \n2-3 \nThe Handheld, Manpack, and Small Form Fit \n(HMS) radio program is a single Acquisition \nCategory IC program encompassing: handheld \nradios (one -channel Rifleman Radio (RR), two-\nchannel Leader Radio (LR), and Single -Channel \nData Radio (SCDR)) and Manpack (MP) r adios \n(Generation 1 and Generation 2 radios).  The HMS \nprovides voice and data communication to the \nexpeditionary Warfighter with an On-the-Move \n(OTM), At-the-Halt (ATH), and stationary Line of \nSight (LOS) / Beyond Line of Sight (BLOS) \ncapability for both dismounted personnel and platforms.  The radio systems are software \nreprogrammable, networkable, multi -mode systems capable of simultaneous voice and data \ncommunication.  The radios will support a variety of other platforms, including tactical end user \ndevice voice and data needs.  The HMS provides tailorable and scalable software -defined radio \nsystems to meet the communication needs of the U.S. Army, Air Force, Navy, Marine Corps, and \nSpecial Operations Command. \n \nMission:  Provide voice and data communications to the tactical edge and the expeditionary \nWarfighter with an OTM, ATH, and stationary LOS / BLOS capability for both dismounted \npersonnel and mounted platforms. \n \nFY 2025 Program:   Funds the  procurement of the LR  and M P radios for up to five Brigade \nCombat Teams, support equipment, fielding, non- recurring engineering, and platform vehicle \nintegration.  Provides for follow-on testing of the LR and MP products to demonstrate compliance \nwith program requirements to assess effectiveness, suitability, and survivability.  Supports safety, \nspectrum supportability, and certifications necessary to prepare products for fielding. \n \nPrime Contractor(s):  L3Harris Radio Corporation; Rochester, NY \n                                      Thales Communications Incorporated; Clarksburg, MD \n                                      Collins Aerospace; Cedar Rapids, IA \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E             -              4.3             -              4.3             -              4.3 \nProcure me nt             -          660.3             -          765.1             -          704.1 \n   Total             -          664.5             -          769.4             -          708.4 \nHandheld, Manpack, and Small Form Fit Radio\nFY 2023 FY 2024 FY 2025\n \n           Numbers may not add due to rounding \nHandheld, Manpack, and Small Form Fit Radio"
    },
    {
      "page": 50,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nC4I Systems \n2-4 \n \nThe United States is one of the most \ntechnologically advanced nations in the \nworld, with a vast network of \ninterconnected systems that support \ncritical infrastructure and services.  \nHowever, this reliance on technology also \nmakes the country vulnerable to \ncyberspace threats. \nOne of the main sources of cyber threats \ncomes from foreign state actors, who \nconduct cyber operations to advance their \nmilitary capabilities and global influence.  \nThese operations can range from espionage \nand data theft to cyber-attacks that disrupt critical infrastructure or target government agencies. \nIn addition to foreign state actors, there is a growing threat from non-state entities, such as criminal \norganizations and hackers.  These groups are becoming more sophisticated in their methods and \ntechniques, making it difficult to defend against cyber-attacks. \nThe FY 2025 cyberspace activities (CA) budget, aligned with the 2022 Department of Defense \n(DoD) National Defense Strategy (NDS), reaffirms the Department’s three enduring cyberspace \nmissions:  defend the DoD Information Network, defend the nation, and prepare to fight and win \nthe nation’s wars. \n \nMission:  Improve the cyber resiliency of the Joint Force and its supporting elements to ensure \nthey can execute their missions successfully in contested cyberspace environments; strengthen the \nJoint Force by conducting cyberspace operations that enhance U.S. military advantages, harden \nweapon systems through continuous cyber assessments and mitigation ; defend U.S. critical \ninfrastructure from malicious cyber activity; secure DoD information and systems, including DoD \ninformation on non- DoD owned networks, against ma licious cyber activity ; and expand DoD \ncyber cooperation with interagency, industry, and international partners. \n \nFY 2025 Program: Funds three focus areas: advancing cybersecurity (CS), cyberspace operations \n(CO), and cyber research and development (R&D) activities.  This aligns to the DoD's commitment \nto strengthening its cyber capabilities and protecting its critical networks and systems from \nevolving threats. \n \nPrime Contractor(s):  Various \n \n \n \n \n \n \n \nQty $M Qt y $M Qty $M\nRDT&E -               2,729.0    -               3,041.6    -               3,178.0    \nProcure me nt -               720.9       -               1,018.3    -               780.8       \n   Total -               3,449.9    -               4,059.9    -               3,958.8    \nCyberspace Activities\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                             Numbers may not add due to rounding  \nCyberspace Activities"
    },
    {
      "page": 51,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nC4I Systems \n2-5 \n \nThe Department of Defense (DOD) continues \nto improve its Command and Control (C2) \nstructure in a rapidly evolving battlespace.  \nThe joint all- domain approach, initiated in \nFiscal Year (FY) 2020, is the warfighting \ncapability necessary to keep pace with the \nvolume and complexity of data in modern \nwarfare and to deter, deny, and, if necessary, \ndefeat adversarial advancement. \nCombined Joint All Domain Command and \nControl (CJADC2) is C2 for 21st -century \nwarfighting that supports the Joint \nWarfighting function enabled by technology, not a single system we buy as product or program of \nrecord.  It is an ongoing effort to transform our C2 processes and strengthen the integration of data, \nanalytics, artificial intelligence (AI), and advanced networks, into modified Joint workflows that \nenable Joint command and control across all domains – land, sea, air, space, and cyberspace.\n  \nIn the FY 2025 CJADC2  budget, e ach Military Department contributes to CJADC2; FY 2025 \ninitiatives include the Army’s Project Convergence, the Navy’s Project Overmatch, and the Air \nForce’s Advanced Battle Management System ( ABMS).  The Chief Digital and Artificial \nIntelligence Office (CDAO) contributes with four distinct efforts: Joint Operating System (JOS), \nData Integration Layer (DIL), Global Information Dominance Experimentation (GIDE), and \nMission Command Applications (MCAs).   \n \nMission:  CJADC2 builds on the Air, Land Battle (Air Land Battle) framework of the Cold War, \nwith a modern version extends the integration framework from two domains (air and land) to all \ndomains including sea, space and cyber.  It accelerates the command -and-control function to a \ncontinuous real-time decision and feedback loop.  The JADC2 framework intends to provide the \nsensors, data, networks, and automated decision aids (AI) to make real-time command and control \n(C2) possible. \n \nFY 2025 Program: Provides $1.4 billion to continue development of the CJADC2 architecture. \n \nPrime Contractor(s):  Various \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               611.0       -               1,039.0    -               1,433.0    \n   Total -               611.0       -               1,039.0    -               1,433.0    \nCombined Joint All Domain Command & Control\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                             Numbers may not add due to rounding  \nCJADC2 Programs"
    },
    {
      "page": 52,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nThis page intentionally left blank."
    },
    {
      "page": 53,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nGround Systems \n3-1 \nGround Systems \n \nThe Department is modernizing its ground force capabilities to ensure the United States remains a \ndominant force capable of operating in all environments across the full spectrum of conflict.  The \nArmy and Marine Corps equip each soldier and Marine with the best equipment available to \nsucceed in both todays and tomorrow’s operations.  Ongoing technology research and concept \nexploration will benefit future Army and Marine Corps combat portfolios. \n \nThe ground forces modernization plan addresses the challenges  of the future operational \nenvironment.  In addition to upgrades to legacy equipment, the overall strategy embrace s new \ncapability, like the Armored Multi -Purpose Vehicle (AMPV ), the Amphibious Combat Vehicle  \n(ACV), the M10 Booker, as well as development of the XM30 CombatXM30 Combat Vehicle  \nwhich replaces the M2 Bradley Fighting Vehicle, previously OMFV.  The XM30 will comprise of \na fleet of vehicles with enhanced capabilities and a greater commonality of parts and components \nis being designed to be a optionally crewless platform. \n \nThe Army continues to modernize, and upgrade select Major Defense Acquisition Programs in its \nFY 2025 request, including Stryker vehicles, upgrading the Abrams Main Battle Tank to the \nM1A2C System Enhancement Package (SEP) V3 configuration, the M2 Bradley Fighting \nVehicles, the M109A7 Paladin 155mm howitzers , and the Armored Multi -Purpose Vehicle \n(AMPV).  The Marine’s ground force focus, in FY 2025, continues to be the Amphibious Combat \nVehicle (ACV).  The ACV will deliver shore and sea- based infantry to the battlefield in vehicles \ndesigned for future operational environments.  All the Services will procure the Joint Light Tactical \nVehicle (JLTV). \n \nFY 2025 Ground Systems Total:  $13.0 Billion \n \nSupport Vehicles\n$0.4\nTracked Combat \nVehicles\n$6.2\nLight Tactical \nVehicles\n$0.4\nWeapons\n$1.5\nComm. \nElectronics\n$1.2Equipment\n$3.3\n$ in Billions \nNumbers may not add due to rounding"
    },
    {
      "page": 54,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nGround Systems \n3-2 \n \nThe Joint Light Tactical Vehicle (JLTV) is a joint \nprogram currently in production for the Army and \nMarine Corps with procurements for the Navy and \nAir Force.  The JLTV replaces the High Mobility \nMultipurpose Wheeled Vehicle (HMMWV), \nwhich is the current light tactical vehicle.  The \nJLTV concept includes a 3.5-ton Combat Tactical \nVehicle and a 5.1-ton Combat Support Vehicle and \nis based on a family of vehicles focused on \nscalable armor protection , integrated \ncommunications, and vehicle agility and mobility required of the light tactical vehicle fleet.  The \nJLTV provides defensive measures to protect troops in transport, increase payload capability, and \nachieve commonality of parts and components to reduce the vehicle’s overall life cycle costs.  The \nJLTV pro gram optimizes performance, payload, and protection of the crew and vehicle while \nensuring a design that is transportable by CH-47, CH-53, and C-130 aircraft.      \n \nMission:  Provides protected, sustained, and networked light tactical mobility to the Joint forces \ncapable of worldwide deployment across the full spectrum  of military operations and mission \nprofiles under all weather and terrain conditions. \n \nFY 2025 Program:  Procures more than 2,609 JLTV vehicles, trailers, and associated vehicle kits \nof various configurations across the Department to fulfill multiple mission roles and requirements \nand minimize ownership costs for the light tactical vehicle fleet.\n  The vehicle kits will support the \nbaseline vehicle by providing the warfighter with the ability to augment the vehicle's configuration \nto respond to environmental conditions or threat situations. \n \nPrime Contractor(s):  Oshkosh Defense, LLC; Oshkosh, WI  \n                                      AM General, LLC; South Bend, IN \n \n \nQty $M Qty $M Qty $M\nRDT&E\nUSA -               9.4           -               27.2         -               27.0         \nUSMC -               2.7           -               2.6           -               10.7         \nSubtotal -               12.1         -               29.9         -               37.8         \nProcure me nt\nUSA 2,554       866.9       2,601       847.5       1,808       680.8       \nUSMC 1,051       436.7       396          232.5       674          340.5       \nUSAF 138          87.7         114          57.8         127          69.5         \nUSN 19            26.3         -               24.2         -               50.9         \nSubtotal 3,762       1,417.6    3,111       1,162.0    2,609       1,141.8    \n   Total 3,762       1,429.7    3,111       1,191.8    2,609       1,179.5    \nJoint Light Tactical Vehicle\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                              Numbers may not add due to rounding \nJoint Light Tactical Vehicle"
    },
    {
      "page": 55,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nGround Systems \n3-3 \n \n The M1A2 Abrams is the Army’s main battle \ntank, which first entered service in 1980.  Since \nending production in 1994, the Army has \nmodernized the Abrams  through System \nEnhancement Package (SEP) programs and \nEngineering Change Proposals (ECPs)  to \nimprove survivability, lethality, sustainability, \nand supportability.  Current modifications to the \nM1 Abrams SEP version 3 (SEPv3) include an \nupdated Armor suite ; Ammuni tion Data Link ; \nCommander’s Remote Operated Weapon \nStation - Low Profile  (CROWS-LP), Under \nArmor Auxiliary Power Unit  (APU); Electronics Upgrades ; Power Train Improvement s/ \nIntegration Optimization; and Active Protection System (APS) upgrades. \n \nMission:  D ominate adversaries through lethal firepower, unparalleled survivability, and \naudacious maneuver. \n \nFY 2025 Program:  Continues M1A2 Abrams SEPv3 tank production with procurement of 30 \nSEPv3 tank upgrades; includes technology maturation testing for incorporation of Meteorological \nSensor, Laser Warning Receiver, and Thermal Management System into the M1A2 SEPv3. In \nMay 2023, Army Senior Leaders (ASLs) approved a new, more comprehensive ECP called the \nAbrams M1E3, which resulted in a strategic shift to the Abrams Main Battle Tank (MBT) \nmodernization approach.  This change in strategy means the Army will not pursue the SEPv4 but \nwill roll-in various SEPv4 technologies into the Abrams M1E3.  The Abrams M1E3 ECP will \nharness new and developing technologies, which increase research and development funding, to \nproduce a lighter tank that is more operationally/tactically mobile, and survivable. \n \n \nPrime Contractor(s): General Dynamics Land Systems; Sterling Heights, MI   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT\n&E -               59.0         -               96.2         -               246.5       \nProcure me nt 90            1,238.7    34            800.3       30            773.7       \n   Total 90            1,297.7    34            896.5       30            1,020.2    \nM-1 Abrams Tank Modification/Upgrades\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nM-1 Abrams Tank Modification/Upgrades"
    },
    {
      "page": 56,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nGround Systems \n3-4 \n \nThe Armored Multi-Purpose Vehicle (AMPV) is the \nreplacement for the Army’s legacy M113 Armored \nPersonnel Carrier Family of Vehicles (FOV). The \nAMPV addresses shortcomings across the M113 \nFoV and provides improvements to Survivability; \nSize, Weight, Power, and Cooling (SWAP-C); and \nincorporates capability for future technologies and \nthe Army’s Network.  The AMPV consists of five \n(5) variants:\n General Purpose, Medical Treatment, \nMedical Evacuat ion, Mortar Carrier, and Mission \nCommand. AMPV had a successful Full Rate \nProduction (FRP) decision on August 21, 2023. The AMPV is one of the Army’s top 35 \nmodernization priorities, fulfilling the Army’s strategy of protection, mobility, reliability , and \ninteroperability. \n \nMission:  Enable units to operate more securely and effectively with the tanks, Bradley vehicles, \nand self-propelled artillery pieces within the Armored Brigade Combat Team (ABCTs). \n \nFY 2025 Program:  Funds the third order of Full Rate Production (FRP) with the procurement of \n81 vehicles.   \n \nPrime Contractor(s):  BAE Systems; York, PA  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               -             -               12.4         -               12.3         \nProcure me nt 213          1,237.0    91            554.8       81            515.3       \n   Total 213          1,237.0    91            567.1       81            527.7       \nArmored Multi-Purpose Vehicle (AMPV)\nFY 2023 FY 2024 FY 2025\n \n                                                                                                            Numbers may not add due to rounding \nArmored Multi-Purpose Vehicle"
    },
    {
      "page": 57,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \n Ground Systems \n3-5 \n \nThe Next Generation Squad Weapon \n(NGSW) Middle Tier Acquisition (MTA) \nRapid Prototyping and Fielding efforts are \ndeveloping a new Rifle (NGSW -R), \nAutomatic Rifle (NGSW -AR), and Fire \nControl (NGSW-FC) with a common 6.8mm \ncartridge in a variety of ammunition types \n(General Purpose, Special Purpose, Reduced \nRange, and blank) intended to replace the \nM16, M4A1 Carbines, and the M249 Squad \nAutomatic Weapon in the Close Combat \nForce.  These MTA Rapid Prototyping and \nFielding efforts support  Army \nModernization priorities (Build a More \nLethal Force) through enhancement of Joint \nLethality in contested environments like \nMulti-Domain Operations by eliminating \nerosion of close combat capability relative to \npeer competitors in complex terrain. \n \nMission:  Develop and field a NGSW, compliant with the Adaptive Squad Architecture, capable \nof defeating emerging protected and unprotected threats.  The NGSW aims to improve engagement \ntime, maximum effective range, accuracy, and target effects. \n \nFY 2025 Program:  Funds the procurement and fielding of 18,019 NGSW-R, 1,772 NGSW-AR, \nand 20,045 NGSW-FC.  The NGSW-R, NGSW-AR, NGSW-FC, and 6.8mm Common Cartridge \nare fielded concurrently to provide a squad level capability improvement to maintain overmatch \nagainst near peer enemy threats. \n \nPrime Contractor(s):    NGSW-R/AR: SIG Sauer; Newington, NH  \n NGSW FC: Vortex Optics; Barneveld, WI  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               33.0         -               35.3         -               22.1         \nProcure me nt 16,513     166.6       33,473     292.9       39,836     367.3       \n   Total 16,513     199.6       33,473     328.1       39,836     389.4       \nNext Generation Squad Weapon\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nNext Generation Squad Weapon"
    },
    {
      "page": 58,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nGround Systems \n3-6 \n \nThe Paladin Integrated Management (PIM) \nreplaces the current fleet of M109 Family of \nVehicles (FOV), the M109A6 Paladin 155mm \nHowitzer, and the Field M992A2 Artillery \nAmmunition Support Vehicle (FAASV), with \nmore robust platforms: the M109A7 Self \nPropelled Howitzer (SPH) and the M992A3 \nCarrier Ammunition Tracked (CAT). The \nArmy is using a two- increment approach to \nupgrade and modernize the existing M109 fleet \nto fill the capability gap le ft by the 2009 \ncancellation of the Non- Line of Sight Cannon (NLOS -C):  mobility improvements and, later, \nlethality, range, and reliability improvements.  The Army plans to procure 689 PIM sets and sustain \nthem through 2050.  The PIM Low-Rate Initial Production (LRIP) was extended in FY 2018 with \na successful Full Rate Production (FRP) decision in FY 2020. \n \nMission:  Provide the primary indirect fire support for Armored Brigade Combat Teams, armored \nand mechanized infantry divisions, and the full spectrum of operations.   \n \nFY 2025 Program:   Funds the continuation of FRP with the procurement of 20 system sets ; \ncontinues support of the Armament Upgrade Project to optimize capabilities and improve \nreliability for the M109A7 SPH with expected changes in the system's operational profile. \n \nPrime Contractor(s):  BAE Systems; York, PA    \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qt y $M\nRDT&E -               17.3         -               42.5         -               42.5         \nProcure me nt 59            1,009.5    24            469.2       20            417.7       \n   Total 59            1,026.8    24            511.6       20            460.2       \nPaladin Integrated Management (PIM)\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nPaladin Integrated Management (PIM)"
    },
    {
      "page": 59,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nGround Systems \n3-7 \n \nThe Stryker is a 19-ton wheeled armored vehicle \nthat provides the Army with a family of 24 \ndifferent platforms (10 flat-bottom, 7 Double V-\nHull, 7 Double V-Hull A1).  The Stryker family \nprovides a lethal, versatile, tactically agile joint \nforce capable of operational maneuver in a \ndynamic, asymmetric threat, and operational \nenvironment.  The Stryker is deployable by C-17 \nand C-5 aircraft and can be combat-capable upon \narrival in any contingency area.  The Stryker \nplatform has nine configurations, which include: \nthe Infantry Carrier Vehicle (ICV); \nReconnaissance Vehicle; Anti-Tank Guided \nMissile (ATGM); Nuclear, Biolog ical, Chemical, and Radiological Vehicle (NBCRV); Medical \nEvacuation Vehicle; Commander’s Vehicle; Fire Support Vehicle; Mortar Carrier; and Engineer \nSquad Vehicle. \n \nMission:  Provides rapid protected transport to the Infantry and Scouts of the Stryker Bri gade \nCombat Team (SBCT) allowing them to maneuver in open and urban terrain across the full \nspectrum of operations.   \n \nFY 2025 Program:  Continues Stryker DVHA1 procurement; integration and first fielding of the \n30mm cannon on the Infantry Carrier Vehicle Double V-Hull A1 30mm; procurement of Common \nRemote Operated Weapon System – Javelin (CROWS-J); fielding of 1 Stryker Brigade Combat \nTeam of CROWS -J (87 per SBCT); integration of the Fire Direction Center (FDC), and \nprocurement of Stryker Training Aids, Devices, Simulators, and Simulations (TADSS). \nProcurement of Double V -Hull A1 platforms to support Mission Command Platform (MCP) \nMission Equipment Package integration.\n  \n \nPrime Contractor(s):  General Dynamics Corporation; Sterling Heights, MI   \n \nICVVA1 30mm Contractor: Oshkosh Defense; Oshkosh, WI \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               64.2         -               24.8         -               14.1         \nProcure me nt 184          1,210.8    85            614.3       38            455.3       \n   Total 184          1,275.0    85            639.1       38            469.4       \nStryker Family of Armored Vehicles\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nStryker Family of Armored Vehicles"
    },
    {
      "page": 60,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nGround Systems \n3-8 \n \nThe M10 Booker (formerly, Mobile Protected \nFirepower (MPF)) is a protected, long range, \nprecision direct-fire capability that ensures Army \nInfantry Brigades freedom of movement during \noffensive operations and defeats attacking enemy \nduring defensive operations. The M10 is \nconfigured to operate in environments with \nrestricted terrain commonly faced by light \ninfantry, such as those found in the Pacific Area \nof Operations. \n \nOn June 24, 2022, Booker had a successful Milestone C which was followed by a Low-Rate Initial \nProduction (LRIP) contract award to General Dynamics Land Systems (GDLS).  During LRIP, \nthe Army will complete evaluation of Booker system performance on production vehicles, verify \nsystem operational effectiveness and suitability, establish an initial Booker production base, and \nexecute an orderly production ramp-up leading into Full Rate Production (FRP).  Booker First Unit \nEquipped (FUE) is targeted for FY 2025. \n \nMission:  Provide Army Infantry Bridges with the mobile, protected firepower capability \nnecessary to defeat enemy prepared positions, destroy enemy armored vehicles, close with the \nenemy through fire and maneuver, and ensure freedom of maneuver and action in close contact \nwith the enemy.   \n \nFY 2025 Program:   Funds completion of Booker LRIP Phase developmental and operational \ntesting, production of the initial FRP lot of 33 vehicles, maintenance of  system software, \nmonitoring of potential system obsolescence, engineering changes, management of  the Booker \nTechnical Data Package (TDP), and fielding of LRIP vehicles to the Booker First Unit Equipped \n(FUE). \n  \nPrime Contractor(s):  General Dynamics Land Systems; Sterling Heights, MI   \n \n \n \n \n \n \n \n  \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               60.8         -               102.2       -               48.1         \nProcure me nt 29            349.7       33            394.6       33            460.6       \n   Total 29            410.5       33            496.8       33            508.7       \nM10 Booker\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nM10 Booker (formerly Mobile Protected Firepower)"
    },
    {
      "page": 61,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nGround Systems \n3-9 \n \nThe FMTV is a complete series or family of \nvehicles based on a common chassis with \nautomatic transmission and that vary based on \ndifferent payload and mission requirements.  The \nFMTV operates throughout the theater as \nmultipurpose transportation and unit mobility \nvehicles by Combat, Combat Support, and \nSustainment Units.  The FMTV variants consist of \nthe Light Medium Tactical Vehicle 3 -Ton Cargo, \nand Van models ; Medium Tactical Vehicle 8- ton \nCargo Standard Wheelbase; Long Wheelbase, \nTractor, Expansible Van; Wrecker; 10 -ton Dump; \n8.8-ton Load Handling System; and three types of \ncompanion trailers.  Eighty percent of the FMTV’s parts are common with similar engines , \ntransmissions, drivelines, power trains, tires, and cabs. The A2 program, an evolution of the \nFMTV’s A1P2 vehicle program, incorporates new technologies to rebalance the iron triangle of \npayload, performance, and protection.  The vehicle is capable of transporting a heavier payload \nover more difficult terrain in a shorter amount of time with greater protection than its predecessor.   \n \nMission:  Provides unit mobility and resupply of equipment and personnel for rapidly deployable \nworldwide operations on primary and secondary roads, trails, cross-country terrain, and all climatic \nconditions. \n \nFY 2025 Program:   Funds the procurement of  240 Armor Capable Medium Tactical Vehicle \nTrucks and Trailers for both the Army and Air Force.  The various Medium Tactical Vehicles fill \nthe 8-ton truck requirement, fulfill Army modularity requirements,  and modernize the medium \nfleet, reduce operating and support costs, resolve potential operational deficiencies, and operate \nthroughout the theater as a multi-purpose transportation vehicle used by combat, combat support, \nand combat support units, as well as support the mission of Command Post Infrastructure (CPI2). \n \n \nPrime Contractor(s):  Oshkosh Defense, LLC; Oshkosh, WI \n \n \n \n \n \n \n \n \nQty $M Qty $M Qt y $M\nRDT&E -               21.4         -               28.2         -               15.1         \nProcure me nt\nUSA 266          211.4       221          110.7       208          133.9       \nUSAF 11            1.1           32            4.0           32            4.5           \nSubtotal 277          212.5       253          114.7       240          138.5       \n   Total 277          233.9       253          142.9       240          153.5       \nFamily of Medium Tactical Vehicles (FMTV)\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nFamily of Medium Tactical Vehicles (FMTV)"
    },
    {
      "page": 62,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nGround Systems \n3-10 \n \nThe Family of Heavy Tactical Vehicles  (FHTV) \nconsists of the Palletized Load System (PLS), the \nHeavy Expanded Mobility Tactical Truck \n(HEMTT), the Modular Catastrophic Recovery \nSystem (MCRS), the Enhanced Heavy Equipment \nTransporter System ( EHETS), and the Medium \nEquipment Trailer (MET).  The PLS is a 16.5-ton, \n10-wheel tactical truck with self-load/unload capability.  The PLS carries its payload on flat rack \ncargo bed, trailer, or International Standards Organization (ISO) containers.  The HEMTT is a \n10-ton, 8-wheel (8x8) truck that comes in several configurations:  Tanker to refuel tactical vehicles \nand helicopters; Tractor to tow the Patriot missile system and the Multi- Launch Rocket System  \n(MLRS); Wrecker to recover vehicles; and Cargo truck with a material handling crane.  The MCRS \nis comprised of the Prime Mover  (M983A4 LET), Fifth Wheel Towing Recovery Device  \n(FWTRD), and the Tilt Deck Recovery Trailer  (TDRT).  Coupled with the Prime Mover, the \nMCRS can recover all Stryker variants and an estimated 95 percent of Mine Resistant Ambush \nProtected (MRAP) vehicles currently in theater.  The EHETS is comprised of the M1300 Tractor \nand M1302 Semitrailer .  The MET, when coupled with an M1300 tractor, provides a system to \ntransport intermediate weight combat vehicles that cannot clear a 4- meter underpass while \ntransported on an EHETS trailer.  \n \nMission:  Provide transportation of heavy cargo to supply and re -supply combat vehicles and \nweapons systems.  The PLS is fielded to transportation units, ammunition units, and forward \nsupport battalions with the capability to self-load and transport a 20-foot container.  The upgraded \nHEMTT A4 provides logistics support behind quick-moving forces such as the M-1 Abrams and \nStryker.  The HEMTT family carries all types of cargo, especially ammunition and fuel, for line \nhaul, local haul, unit resupply, and other missions in the tactical environment to support modern, \nhighly mobile combat units.  The MCRS recovers large, wheeled vehicle platforms in severe off-\nroad conditions either in lift/toe or transport mode.  The EHETS is used to transport, recover, and \nevacuate a combat loaded M1 Series main battle tank, an M88, or similar heavy loads.  The MET \nwill be required to haul combat vehicles under a 4-meter underpass. \n \nFY 2025 Program:  Funds the procurement of 37 PLS Trailers,  102 MET trailers, 12 M983A4 \ntractors, 22 HEMTTs, and 22 Forward Repair Systems.  Funds also resource the Common Tactical \nTruck as the next generation of tactical trucks to meet the Army’s Tactical Wheeled Vehicle \nmodernization strategy and develop predictive logistics for the FHTV fleet.  \n \nPrime Contractor(s):  Oshkosh Corporation; Oshkosh, WI \n \n \n \n \n \nQty $M Qty $M Qt y $M\nRDT&E -               51.3         -               44.2         -               50.0         \nProcure me nt 436          275.0       96            66.4         195          98.9         \n   Total 436          326.3       96            110.6       195          148.9       \nFamily of Heavy Tactical Vehicles\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nFamily of Heavy Tactical Vehicles \n \nArmy photo of a PLS"
    },
    {
      "page": 63,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nGround Systems \n3-11 \n \nThe XM30 Combat Vehicle (previously \nOMFV), as part of an  Armored Brigade \nCombat Team (ABCT), will replace the \nBradley Infantry Fighting Vehicle to provide \nthe capabilities required to defeat a future \nnear-peer competitor's  force. The XM30 is \nan optionally manned platform that \nmaneuvers Soldiers to a point of positional \nadvantage to engage in close combat and \ndeliver decisive lethality  during the \nexecution of combined arms maneuver. It is \ndesigned to operate with and may operate \nwithout a crew and Soldiers under armor based on the commander's  decision. It delivers decisive \nlethality during the execution of combined arms maneuver while also controlling maneuver \nrobotics and semi -autonomous systems. The XM30 is a Middle Tier Acquisition Rapid \nPrototyping (MTA-RP) program.  The Army anticipates transitioning from an MTA-RP to a Major \nCapability Acquisition Pathway at Milestone B in the 2\nnd quarter of Fiscal Year (FY) 2025 and \nplans to enter Low -Rate Initial Production (LRIP) in the 1 st quarter FY 2028 with a Full Rate \nProduction (FRP) decision slated for FY 2030. \n \nMission: Maneuvers soldiers in the Forward Operating Environment to a position of advantage to \nengage in close combat and deliver decisive lethality. The XM30 Combat Vehicle is a Middle Tier \nAcquisition - Rapid Prototyping Program that must exceed current capabilities while overmatching \nsimilar threat class systems. It must be optimized for urban and rur al terrain areas, while also \ndefeating pacing threats, and be characterized by the ability to spiral in advanced technologies as \nthey mature. The capabilities desired focus to improve lethality, protection, mobility, range, \nsurvivability. \n \nFY 2025 Program:  Funds the fully digital, detailed prototype vehicle designs from Preliminary \nDesign Review (PDR) through to the Critical Design Review (CDR) in preparation for the \nprototype builds and testing portion of Phase 3&4 in the program’s development. \n \nPrime Contractor(s):  TBD   \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT\n&E -               519.1       996.7       504.8       \nProcure me nt -               -             -               -             -               -             \n   Total -               519.1       -               996.7       -               504.8       \nXM30 Combat Vehicle\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                              Numbers may not add due to rounding \nXM30 Combat Vehicle (formerly OMFV) \nUSG \nConcept \nDesign"
    },
    {
      "page": 64,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nGround Systems \n3-12 \n \nThe Amphibious Combat Vehicle (ACV) is an \narmored personnel carrier that replaces the aging \nAmphibious Assault Vehicle.  The Marine Corps has \nrefined its ACV strategy based on several factors \nincluding:  knowledge gained through multiyear \nanalysis and ongoing development of its Ground \nCombat Tactical Vehicle Strategy.  The ACV \nacquisition strategy competitively awarded two \nvendors with Engineering, Manufacturing, and \nDevelopment contracts to build 16 test vehicles each (32 total) in November 2015.  The ACV \ncompleted Milestone C in June 2018 and down selected to one vendor, BAE Systems, and awarded \nthat vendor with the Low-Rate Initial Production (LRIP) contract.  In a third quarter  \nFY 2019 acqui sition decision memorandum, the Navy departed from the program’s P resident’s \nBudget FY 2020 acquisition strategy to authorize a third LRIP Lot consisting of 56 vehicles.  The \nprogram began Full Rate Production in FY 2021 with the procurement of 72 vehicles.  The ACV \nprogram will develop and procure multiple Mission Role Variants (MRVs).   \n \nMission:  Provides protected mobility and general support lift to elements of Marine Infantry \nbattalions.  The ACV is an advanced generation, eight-wheeled armored personnel carrier, capable \nof mitigating cap ability gaps by providing improved lethality against dismounted enemy troops \nthrough more effective land and water tactical mobility, and increased force protection and \nsurvivability from blasts, fragmentation, and kinetic energy threats.  The first ACV-P delivers \ncombat ready Marines from ship -to-shore connector craft to  mass forces at littoral penetration \npoints and continue to maneuver onward to inland objectives.     \n \nFY 2025 Program:  Initiates the production of 80 Improved Lethality 30MM variants (ACV-30s), \nplus procurement of related items such as Production Support, Systems Engineering/Program \nManagement (SE/PM), Engineering Change Orders (ECOs), Government Furnished Equipment \n(GFE), and Integrated Logistics Support (ILS). \n \nPrime Contractor(s):  BAE Systems; York, PA   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qt y $M\nRDT&E -               86.9         -               103.2       -               60.2         \nProcure me nt 74            518.5       80            557.6       80            810.3       \n   Total 74            605.4       80            660.8       80            870.5       \nAmphibious Combat Vehicle\nFY 2023 FY 2024 FY 2025\n \n         Numbers may not add due to rounding \nAmphibious Combat Vehicle"
    },
    {
      "page": 65,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissile Defense Programs \n4-1 \nMissile Defense Programs \nThis category includes development and procurement of weapon systems to counter adversary’s \noffensive missile systems to include ballistic missiles, cruise missiles and hypersonic weapons .  \nThe Missile Defense Agency is specifically tasked to lead the Department’s missile defense system \nmission; however, the five Military Services have acquisition and operational roles in m issile \ndefeat and defense.  A missile defense system includes ground and sea-based interceptor missiles; \nassociated land, sea and space-based missile warning; command, control, battle management, and \ncommunications; and development of advanced technologies designed to meet emerging threats .  \nOther significant investments include construction, targets and countermeasures, and associated \ntesting activities.  Encompassed in this category are all programs that are either critical to the \nfunctionality of the ballistic missile defense system, tactical ballistic missile interceptor programs \nor support missile defense as a primary mission.  The program is consistent with the 2022 Missile \nDefense Review, which calls for the development and fielding of a n integrated defense of the \nhomeland and forward-deployed forces.   \nThe budget request continues funding for projects designed to increase the capability and capacity \nof the United States to detect, disrupt/defeat (left-of- launch), and defend against use of ballistic \nmissiles against the United States, its deployed forces,  allies, and partners, to include current and \nprojected threats to the U.S. Homeland.  The budget request funds tactical air and missile defense \ninterceptor inventories for the Patriot Advanced Capability -3 M issile Segment Enhancement .  \nFY 2025 request invests in Standard Missile  (SM-3) and SM -6 variants, and Terminal Hi gh \nAltitude Area Defense programs.  In addition, the FY 2025 request includes funding for the defense \nof the Guam territory; continues research of a space sensor layer; continues development of Next \nGeneration Interceptors and invests in development efforts against non- traditional missile threats \nsuch as hypersonic weapons, cruise missiles, and unmanned aircraft systems. \nFY 2025 Missile Defense Programs:  $13.5 Billion \n  \nBallistic Missile \nDefense System\n$8.7\nAdvanced Component \nDevelopment\n$0.5\nTactical Missile \nDefense\n$2.7\nOperational System \nDevelopment\n$1.0\nCommunications & \nElectronics\n$0.6\n$ in Billions \n Numbers may not add due to rounding \nNote:  Total FY 2025 Missile Defeat and Defense (MDD) request is $28.4 billion. The Missile Defense total shown does \nnot include non-traditional Missile Defeat programs, such as hypersonic weapons and defenses . The FY 2025 MDD total \nincludes the Missile Defense Agency $10.4 billion request, and the Military Service tactical missile defense investments, \nbut does not include the Department’s Science and Technology funding , Service Personnel funding, or Operation and \nMaintenance funding."
    },
    {
      "page": 66,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissile Defense Programs \n4-2 \nThe Ground-based Midcourse Defense (GMD) element is a Missile Defense \nAgency program and a key component of the Missile Defense System, \nproviding Combatant Commanders with the capability to engage missiles in \nthe midcourse phase of flight.  This phase, compared to boost or terminal, \nallows significant time for sensor viewing from multiple platforms and \nprovides multiple engagement opportunities for hit-to-kill interceptors.  The \nGround Based Interceptor  (GBI) is made up of a three -stage, solid fuel \nbooster, and an exoatmospheric kill vehicle.  When launched, the multi -\nstage, solid fuel booster missile carries the kill vehicle toward the target’s \npredicted location in space.  Once released from the booster, the kill vehicle \nuses data received in-flight from ground-based radars and its own on-board \nsensors to defeat the incoming missile by ramming the warhead with a \nclosing speed of approximately 15,000 miles per hour.  Interceptors are \ncurrently emplaced at Fort Greely, Alaska and Vandenberg Air Force Base, \nCalifornia.  The GMD fire control centers are established in Colorado and \nAlaska. N ext Generation Interceptor (N GI) acquisition covers the \ndevelopment, integration and testing of an All Up Round boost vehicle/ kill \nvehicle system capable of surviving both the natural and hostile \nenvironments while countering the evolving threats to the Homeland. \n \nMission:  Provides the Combatant Commanders with capability to defend the United States, \nincluding Hawaii and Alaska, against long-range ballistic missiles in the midcourse phase of flight. \n \nFY 2025 Program:   Strengthens Homeland Missile Defense. Continues  to develop a Next \nGeneration Interceptor. Continues the design and development activities for two competitive \ninterceptor development contracts.  N ext Generation Interceptor funding provides for the initial \nrequirements analysis, design, development, prototyping, integration and relevant environment \ntesting to mature the booster, payload, sensor, and design- specific critical technologies and \ntechnology e lements.  Upgrades and consolidates ground testing infrastructure and facilities. \nUpgrades and replaces ground system infrastructure  fire control/kill vehicle software to improve \nthe reliability and cybersecurity resiliency of the GMD weapon system.  Funds Ground, Cyber and \nFlight testing to support the Integrated Master Test Plan. \n \nPrime Contractor:   Boeing Defense and Space; Huntsville, AL  \nNext Generation Interceptor: Northrop Grumman (Gold); Chandler, AZ  \nLockheed Martin (Black); Huntsville, AL \n \n \n \nQty $M Qty $M Qt y $M\nRDT&E -               2,550.9    -               3,076.3    -               2,505.4    \nProcure me nt -               11.3         -               -             -               20.8         \n   Total -               2,562.2    -               3,076.3    -               2,526.2    \nGround-based Midcourse Defense and \nImproved Homeland Defense Interceptors\nFY 2023 FY 2024 FY 2025\n \n        Numbers may not add due to rounding \nGround-based Midcourse Defense"
    },
    {
      "page": 67,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissile Defense Programs \n4-3 \nThe Terminal High Altitude Area Defense (THAAD) is a \nkey element of the missile defense system.  The THAAD \nBattery provides interceptors, using “Hit-To-Kill” \ntechnology to destroy missiles inside and outside the \natmosphere.  A Battery nominally  consists of 6 truck-\nmounted launchers, 48 Interceptors  (8 per launcher), one \nArmy/Navy Transportable Radar Surveillance and Control \nMode 2 (AN/TPY -2) radar, a Tactical Fire \nControl/Communications component, and the Heavy \nExpanded Mobility Tactical Trucks (HEMTTs). \n  \nMission:  Provides Combatant Commanders with a \nglobally transportable , rapidly deployable  capability \nagainst short -range, medium -range, and limited \nintermediate-range ballistic missile threats inside or \noutside the atmosphere during terminal phase of flight. \n \nFY 2025 Program:  Procures 12 THAAD Interceptors, Interceptor obsolescence mitigation, \nstockpile reliability requirements, and THAAD Battery Ground Component Obsolescence \nmodifications. Provides software upgrades to improve reliability, availability and readiness, \ndefense planning, and improved capability to engage Short- Range Ballistic Missile ( SRBM), \nMedium Range Ballistic Missiles ( MRBM), and limited Intermediate Range Ballistic Missiles \n(IRBM) threats.  These development efforts will enhance THAAD’s capability against global \noperational threats.  Provides flight and ground testing, test operations and infrastructure, war -\ngames, and exercises to execute Integrated Master Test Plan requirements.  \n \nPrime Contractor:  Lockheed Martin Corporation; Dallas, TX, Sunnyvale, CA, and  \n                                  Huntsville, AL \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               262.1       -               267.9       -               393.0       \nProcure me nt 18            240.0       11            216.8       12            247.0       \n   Total 18            502.0       11            484.7       12            639.9       \nTerminal High Altitude Area Defense (THAAD)\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                            Numbers may not add due to rounding  \nTerminal High Altitude Area Defense"
    },
    {
      "page": 68,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissile Defense Programs \n4-4 \nSea-Based Weapons System (Aegis Ballistic Missile \nDefense (BMD)) is the naval element of the missile defense \nsystem and provides an enduring, operationally effective, and \nsupportable missile defense capability on Aegis cruisers, \ndestroyers, and Ashore to defend U.S. deployed forces and \nour allies. Aegis Sea-Based Weapon Systems build upon the \nexisting Navy Aegis Weapons System (AWS) and Standard \nMissile-3 (SM -3) design. Upgrades are being made to the \nweapon system and SM -3 designs which expand capability \nthrough a series of incremental, evolutionary improvements \nto counter ever more sophisticated long-range threats.  Aegis \nMissile Defense will also begin activities requ ired to evolve \nthe MDS to address cruise missile and hypersonic threats. \n \nMission:  Provides a forward-deployable, mobile, and Aegis Ashore capability to detect and track \nmissiles of all ranges in all phases of flight with the ability to destroy missiles in the midcourse \nand terminal phases.  \n \nFY 2025 Program:  Procures 12 SM-3 Block IIA’s.  Pivots from and discontinues the SM-3 Block \nIB procurements in favor of SM-3 Block IIA, and further integrates the Block IIA missile into the \nAWS.  Funds capability upgrades of the Aegis Baseline 5 (BMD 4.x) and Aegis Baseline 9 (BMD \n5.x) Weapon Systems and the development of Aegis BL 10 (BMD 6).  Procures one (1) BMD 5.x \nhardware shipset.  Continues technology maturation and prototyping support for the AN/ SPY-1 \nDigital Receive Upgrades (DRU) to improve sensitivity, tracking performance, and resource \nutilization.  Funds development of Aegis assets for the Defense of Guam.  Funds Ground and Flight \ntesting in support of the Integrated Master Test Plan requirements.  \n \nPrime Contractors:  Aegis Weapon System:  Lockheed Martin Corporation; Moorestown, NJ                                   \n                        SM -3 Interceptor:  Raytheon Company; Tucson, AZ and Huntsville, AL \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qt y $M\nRDT&E -           751.9    -           887.2    -           784.3    \nProcure me nt (Inte rce ptors) 71         1,072.2  39         807.6    12         491.4    \nProcurement (HW/SW Installs) 5           72.2      9           27.8      1           32.0      \n   Total 76         1,896.3  48         1,722.6  13         1,307.7  \nSea-Based Weapons System\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                             Numbers may not add due to rounding  \nSea-Based Weapons System"
    },
    {
      "page": 69,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissile Defense Programs \n4-5 \n \nThe Army’s Phased Array Tracking Radar to \nIntercept of Target ( PATRIOT) system is an \nextremely capable, long -range air defense \nguided missile system, which provides \nprotection of ground combat forces and high-\nvalue assets.  The PATRIOT air and missile \ndefense system, which includes the Advanced \nCapability (PAC-3) missile and Lower Tier Air \nand Missile Defense Sensor (LTAMDS), \nprovides defense against tactical ballistic \nmissiles, cruise missiles, and air -breathing \nthreats worldwide\n.  \n \nThe PATRIOT system is deployed by a Fire Unit organized within a Battalion.  Each Fire Unit \nconsists of the Engagement Control Station, a Radar Set, an Electric Power Plant, Launching \nStations, and the Battery Command Post and includes ancillary support equipment.  Both the Fire \nUnit and the Battalion have dedicated support, communications, and mai ntenance vehicles, with \nlimited missile reload and transport capability via the Guided Missile Transporter.  The PAC -3 \nunits are the Combatant Commanders’ most capable asset to protect forward deployed forces. \n \nMission:  Contributes to the Ballistic Missile Defense System overall situational awareness for \nshort-range terminal ballistic missile and unmanned system threats.  It can cue other systems while \nprotecting Joint assets.  The PATRIOT  force is 15 battalions; many remain forward stationed in \nmultiple theaters of operation. \n \nFY 2025 Program:  Implements critical capability, readiness and sustainability modifications and \ncontinues software enhancement for improved combat identification, improved communications, \ninteroperability, supportability, electronic warfare capabilities; and supports transition to the \nIntegrated Air and Missile Defense architecture.  FY 2025 LTAMDS development funding \ncontinues to support the Pacific Deterrence Initiative.  FY 2025 funding will also support \nprocurement of four sensors and Milestone C decision in FY 2025.  \n \nPrime Contractor(s):  Raytheon Integrated Defense Systems; Tewksbury, MA \n \n                                      Lockheed Martin Missiles and Fire Control; Dallas, TX \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               513.4       -               993.9       -               317.9       \nProcure me nt -               463.0       -               212.2       4              688.8       \nTotal -               976.3       -               1,206.1    4              1,006.7    \nFY 2023 FY 2024 FY 2025\nPATRIOT Advanced Capability/PAC-3\n \n                                                                                                                             Numbers may not add due to rounding \nPATRIOT Advanced Capability (PAC-3)/LTAMDS"
    },
    {
      "page": 70,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissile Defense Programs \n4-6 \n \nThe Missile Segment Enhancement (MSE) is a \nperformance improvement to the existing Phased \nArray Tracking Radar to Intercept of Target  \n(PATRIOT) Advanced Capability- 3 (PAC -3) \nmissile. The MSE’s improved capability is achieved \nthrough a higher performance solid rocket motor, \nmodified lethality enhancer, more responsive control \nsurfaces, upgraded guidance software, and \ninsensitive munitions improvements. \n \nThe PAC-3 MSE employs kinetic energy to des troy \ntargets through a hit -to-kill capability and provides \nthe range, accuracy, and lethality to effectively \nintercept and destroy tactical ballistic missiles, air -\nbreathing threats, cruise missiles, and unmanned \naerial systems.  This missile engages maneu vering and advanced threats earlier, expanding \noperational battlespace performance against complex threats. These improvements result in a more \nagile, lethal interceptor missile with enh anced Insensitive Munitions  compliance.  The PAC -3 \nMSE is the latest generation interceptor fired from the PATRIOT system. \n \nMission:  Provide the Combatant Commanders with a hit -to-kill, surface-to-air missile that can \nintercept tactical ballistic missiles, cruise missiles, and air -breathing threats that have chemical, \nbiological, radiological, nuclear, and conventional high explosive warheads.  The MSE extends \nthe PAC-3 range, filling a critical performance gap, and affords greater protection for deployed \nU.S. and allied forces. \n \nFY 2025 Program:   Funds the production of 230 MSE missiles, Field Surveillance Program , \nPAC-3 Missile Support Center, Obsolescence, System Engine ering/Program Management, and \nGovernment/Software Engineering.\n  Funds the second year of a Multiyear Procurement (MYP) \ncontract. \n \n \n \n \n \n \nPrime Contractor(s):  Lockheed Martin Missiles and Fire Control; Dallas, TX \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qt y $M Qty $M\nRDT&E -               -             -               -             -               -             \nProcure me nt 252          2,471.4    230          1,212.8    230          963.1       \n   Total 252          2,471.4    230          1,212.8    230          963.1       \nPAC-3/Missile Segment Enhancement\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                             Numbers may not add due to rounding \nPAC-3/Missile Segment Enhancement"
    },
    {
      "page": 71,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-1 \nMissiles and Munitions \nMunitions is a general term for ammunition and missiles.  Ammunition consist s of bombs, \ngrenades, rockets, mines, projectiles, and other similar devices.  There are conventional and \nnuclear missiles used for both tactical and strategic purposes.  Many munitions are precision-\nguided, enhancing the attack of a broader target set, wit h limited low -collateral damage.  Some \nprograms include non- explosive articles that enhance the performance of other munitions.  For \nexample, the Joint Direct Attack Munitions (JDAM) adds guidance capability when attached to a \ngravity bomb, making it a “smart” precision-guided bomb.  \n \nIn FY 2025, the Department focused on critical high performance, standoff , and precision strike \nweapons to deliver munitions with greater penetration power.  Improvements to these weapons \nincrease range and precision effects in contested environments against high- value land attack \ntargets.  This  requires munitions with farther standoff, multi-mode seekers, robust guidance \nsystems, and less time for target se lection.  The Department has made investments to expand \nproduction capacity, procure munitions at favorable economic rates, and strengthen the industrial \nbase.  Precision guided munitions are manufactured on fully utilized production lines , so pricing \neconomies are secured at economically feasible rates.   The Department is increasing investments \nin the next generation nuclear cruise missile, the Long Range Stand- off weapon as well as the \nGround Based Strategic Deterrent ballistic missile system.   \n \nThe munition portfolio continues the seven Multiyear Procurement (MYP) programs of which four \nare part of the Large Lot Procurement (LLP) pilot MYP strategy, which aims to maximize weapon \nproduction efficiency with a procurement Buy-to-Budget approach. \nFY 2025 Missiles and Munitions Total:  $29.8 Billion \n \n \n \nConventional \nAmmunition\n$5.9\nTactical Missiles\n$16.0 Strategic \nMissiles\n$7.2\nTechnology \nDevelopment\n$0.7\n$ in Billions \nNumbers may not add due to rounding \nNumbers do not include Operation and Maintenance (O&M)"
    },
    {
      "page": 72,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-2 \nThe Joint Direct Attack Munition (JDAM) is a \njoint Air Force and Navy program led by the \nAir Force.  The JDAM improves the existing \ninventory of general purpose gravity bombs by \nintegrating a Global Positioning System \n(GPS)/inertial navigation guidance capabil ity \nthat improves accuracy and adverse weather capability.  A Laser JDAM variant increases \noperational flexibility for an expanded target set.  The laser sensor kit added to the JDAM weapon \nkit provides the ability to attack targets  of opportunity, including moving land and maritime \ntargets, when designated by an airborne or ground laser.  JDAM tail kit procurement has \ntransitioned to use the St rategic Anti -Jam Beam forming Receiver (SABR) GPS receiver and \nantenna, which provide enhanced resistance to GPS jamming over earlier production variants. \n \nMission:  Enhances DoD conventional strike system capabilities by providing the ability to \nprecisely attack time-critical, high value, fixed or maritime targets under adverse environmental \nconditions and from all altitudes.\n \n \nFY 2025 Program:  Continues production of JDAM tail kits , including the SABR-Y upgraded \nGPS receiver and the JDAM tail kit hardback design used for the BLU -137 penetrator warhead.  \nThe FY 2025 minimum sustainment rate will be achieved. \n \nPrime Contractor(s):  The Boeing Company; St. Charles, MO \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nProcure me nt\nUSAF 5,345       252.0       1,772       132.4       1,500       125.3       \nUSN 1,930       76.7         1,464       73.7         1,460       75.1         \n   Total 7,275       328.7       3,236       206.1       2,960       200.4       \nJoint Direct Attack Munition\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                             Numbers may not add due to rounding  \nJoint Direct Attack Munition \nUSAF Image"
    },
    {
      "page": 73,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-3 \nThe Small Diameter Bomb (SDB) Increment I is \nan Air Force program providing increased kills per \nsortie on current and future aircraft platforms.  The \nSDB I is a conventional 250 lb. small sized, \nprecision guided air-to-ground weapon that can be \ndelivered from both fighter  and bomber  aircraft \nfrom standoff or close air support.  The SDB I is a \nfixed and stationary target attack weapon. \n \nMission:  Destroy targe ts from a medium-range \nstandoff or close air support position deliverable \nby both fighter and bomber aircraft, with higher \nload-out and less collateral damage compared to \nother weapons. \n \nFY 2025 Program:   Continues production of weapons integrated with the Strategic Anti -Jam \nBeam-forming Receiver to support Air Force inventory objectives and Foreign Military Sales. \n \nPrime Contractor(s):  Boeing Company; St. Charles, MO \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               -             -               -             -               -             \nProcure me nt 740          52.7         874          48.7         604          42.3         \n   Total 740          52.7         874          48.7         604          42.3         \nSmall Diameter Bomb I\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                              Numbers may not add due to rounding \nSmall Diameter Bomb I"
    },
    {
      "page": 74,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-4 \nThe Small Diameter Bomb (SDB) II is a joint Air \nForce and Navy program led by the Air Force to \nprovide a conventional , small sized, precision \nguided air -to-ground weapon that can be \ndelivered from both fighter and bomber aircraft to \nattack mobile and fixed targets through adverse \nweather from standoff.  The SDB II incorporates \na tri-mode seeker and datalink, which expands the \nuse to moving targets. \n \nMission:  Destroys targets from a medium -range \nstandoff position deliverable by both fighter and \nbomber aircraft, with higher load- out and less \ncollateral damage compared to other weapons. \n \nFY 2025 Program: SDB II continues to advance toward full rate production and integration  \nefforts on multiple platforms while expanding weapon capabilities such as  improved anti -jam \nmilitary code GPS receiver and enhanced cryptographic datalink.  \n \nPrime Contractor(s):  Raytheon Missile & Defense; Tucson, AZ \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E\nUSAF -               38.0         -               37.5         -               29.9         \nUSN -               41.6         -               52.2         -               19.7         \nSubtotal -               79.6         -               89.7         -               49.6         \nProcure me nt\nUSAF 2,007       480.4       920          291.6       868          328.4       \nUSN 378          100.7       250          65.9         280          76.1         \nSubtotal 2,385       581.1       1,170       357.5       1,148       404.5       \n   Total 2,385       660.7       1,170       447.2       1,148       454.1       \nSmall Diameter Bomb II\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                              Numbers may not add due to rounding \nSmall Diameter Bomb (SDB) II \nUSAF Image"
    },
    {
      "page": 75,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-5 \n \n \nThe Joint Air -to-Surface Standoff \nMissile (JASSM) provides a survivable, \nprecision cruise missile to kill hard, \nmedium, and soft targets.  It is a \n2,000-pound class weapon with a multi-\npurpose, hardened blast frag penetrator \nwarhead.  The JASSM can cruise autonomously in adverse weather, day or night, to defeat high \nvalue targets even when protected by next generation defenses.  The JASSM navigates to a pre -\nplanned target using a Global Positioning System-aided inertial navigation system and transitions \nto automatic target correlation using an imaging infrared seeker in the terminal phase of flight.   \nThe range for the JASSM-Baseline (BL) variant (AGM-158A) is greater than 200 nautical miles.  \nThe JASSM -BL is integrated on the F -15E, F -16, B -52, B -1, and B -2 aircraft and concluded \nprocurement in FY 2016.   \n \nThe JASSM-Extended Range (ER) variant has four configurations, AGM-158B, AGM-158B-2, \nAGM-158B-3, and AGM-158D, which ha ve a more fuel -efficient engine, greater fuel capacity, \nand add 2.5 times the standoff range at greater than 500nm.  The JASSM-ER maintains the same \nouter mold line and low-observable properties as JASSM-BL, but replaces the turbojet engine with \na higher thrust, more fuel-efficient turbofan engine. The AGM-158B is currently integrated on the \nF-15E, F-16, B-1, B-2, and B-52 aircraft. The AGM-158B-2 includes multiple initiatives via a \nsingle system level update including Electronic Safe and Arm Fuze (ESAF) and Missile Control \nUnit (MCU) upgrades, a new GPS receiver for highly contested environments, and warfighter \ncapability enhancements through agile software development.  The developmental AGM-158B-3 \nbuilds on AGM -158B-2 updates, with included M -Code GPS capability.  The AGM-158D is in \ndevelopment with the goal of enhancing performance  with new wing and chine designs, the \nintegration of a Weapon Data Link (W DL) for post -launch retargeting capability, and software \nupdates for increased survivability. The threshold aircraft for AGM-158D is the B-1. \n \nMission:  Destroys high value targets from a long- range standoff position deliverable by fighter \nand bomber aircraft. \n \nFY 2025 Program:   Funds the second year of a Multiyear Procurement (MYP) contract .  \nContinues production of the AGM-158B and AGM-158B-2, and development efforts on the AGM-\n158B-3, and AGM-158D.   \n \nPrime Contractor(s):  Lockheed Martin Missiles and Fire Control; Orlando, FL \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               123.9       -               132.9       -               183.5       \nProcure me nt 600          835.0       550          1,685.7    550          825.1       \n   Total 600          958.9       550          1,818.6    550          1,008.6    \nJoint Air-to-Surface Standoff Missile\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                             Numbers may not add due to rounding  \nJoint Air-to-Surface Standoff Missile \nUSAF Image"
    },
    {
      "page": 76,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-6 \nThe Air Intercept Missile -9X (AIM-\n9X), also known as Next Generation \nSIDEWINDER, is a short range  air-\nto-air missile that provides launch -\nand-leave warfighting capability.  \nThe AIM-9X Block II is an infrared \nmissile with a staring focal plane array imaging infrared (IR) seeker and high- angle off-boresight \ncapability.  It is mounted on a highly maneuve rable (thrust vectored) airframe, along with digital \nguidance and IR signal processing that results in enhanced acquisition ranges, improved IR \ncounter-countermeasures capability, and robust engagement zones for first shot/first kill air-to-air \nperformance.  The AIM-9X is a joint Navy/Air Force program led by the Navy. \n \nMission:  Destroys low and high altitude, high- speed enemy targets in an electronic \ncountermeasures environment. \n \nFY 2025 Program:   Procures the 1 1th lot of Full Rate Production (FRP)  Block II missiles. \nContinues engineering, manufacturing, and development for the System Improvement Program \n(SIP) III software and SIP IV hardware and software development effort s.  The hardware effort \nincludes design and development of the advanced sensor and electronics unit.  The software effort \nincludes completion of development of Operational Flight Software (OFS) 9.5X and 10.4X, and \ncontinued development of OFS 10.5X and 11.5X.  \n \nPrime Contractor(s):  Raytheon Missile & Defense; Tucson, AZ \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E\nUSAF          -         33.4          -         42.0          -         34.9 \nUSN          -         33.0          -         36.4          -         31.4 \nSubtotal          -         66.4          -         78.4          -         66.3 \nProcure me nt\nUSAF        497     220.9        192       95.6        205     107.1 \nUSN        122     201.4        147       78.2        157       86.0 \nSubtotal        619     422.3        339     173.8        362     193.1 \n   Total        619     488.6        339     252.2        362     259.4 \nAir Intercept Missile – 9X\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                             Numbers may not add due to rounding  \nAir Intercept Missile \nUSAF Image"
    },
    {
      "page": 77,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-7 \nThe Advanced Medium Range Air-to-\nAir Missile (AMRAAM) is an all-\nweather, all-environment, radar \nguided missile developed to improve \ncapabilities against low and high-\naltitude, high-speed targets in an \nelectronic countermeasures environment.  The AMRAAM is a joint Navy/Air Force program led \nby the Air Force. \n \nMission:  D estroys low and high altitude, high- speed enemy targets in an electronic \ncountermeasures environment.  The AMRAAM is a fire -and-forget air-to-air missile and is the \nU.S.’s primary beyond visual range intercept missile.  The current generation, AIM -120D, has a \ntwo-way datalink, Global Position System-enhanced Inertial Measurement Unit, an expanded no-\nescape envelope, improved high-angle off-boresight capability, and increased range over previous \nvariants. \n \nFY 2025 Program:   Funds the second year of a Multiyear Procurement (MYP) contract .  \nContinues production of the AIM -120D and addresses component parts obsolescence as well as \nfuture warfighting improvements. \n \nPrime Contractor(s):  Raytheon Missile & Defense; Tucson, AZ \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E\nUSAF          -         36.1          -         53.7          -         53.6 \nUSN          -         30.4          -         29.2          -         29.6 \nSubtotal          -         66.4          -         82.9          -         83.2 \nProcure me nt\nUSAF        319     371.1        457     701.5        462     447.4 \nUSN        306     335.9        374     439.2        261     279.6 \nSubtotal        625     707.0        831  1,140.7        723     727.0 \n   Total        625     773.4        831  1,223.6        723     810.2 \nAdvanced Medium Range Air-to-Air Missile\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                             Numbers may not add due to rounding  \nAdvanced Medium Range Air-to-Air Missile \nUSAF Image"
    },
    {
      "page": 78,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-8 \nThe Chemical Demilitarization Program (CDP) is composed of \ntwo Major Defense Acquisition Programs, which are the \nAssembled Chemical Weapons Alternatives (ACWA) Program \nand the U.S. Army Chemical Materials Activity.  The goal of \nboth programs is to destroy a variety of United States chemical \nagents and weapons, including the destruction of former \nchemical weapon production facilities. The CDP is responsible \nfor the elimination of the existing U.S. chemical weapons \nstockpiles in compliance with the obligations of Chemical \nWeapons Convention, which entered into force in 1997, including meeting the commitment \ndestruction deadline of September 30, 2023; but not later than the congressionally mandated \ndeadline of December 31, 2023, while ensuring the safety and security of the workers, the public, \nand the environment.  On July 7, 2023, complete destruction of the declared U.S. chemical \nweapons stockpile was achieved, and the CDP continues with the closure phase of the two ACWA \nprogram sites.  The Chemical Agents and Munitions Destruction, Defense (CAMD,D) \nappropriation funds the CDP mission.  The funding for the Recovered Chemical Warfare Material \n(RCWM) Program Support Functions level of effort mission in support of the RCWM Program \nhas been realigned from the CAMD,D appropriation account to the Office of the Under Secretary \nof Defense for Acquisition and Sustainment (OUSD(A&S)), for the management and oversight of \nthe enduring RCWM Program Support Functions, in order to maintain these capabilities once the \ndestruction of the U.S. chemical weapons stockpile, through the ACWA program mission, is \ncompleted. \nMission:  There are two mission areas funded by the CAMD,D appropriation: \n• Decontaminate and decommission the ACWA program sites (Colorado and Kentucky) \nand continue secondary waste disposal from the Kentucky site. \n• Support the Chemical Stockpile Emergency Preparedness Pro gram (CSEPP) \nemergency response capabilities for communities surrounding chemical weapons \nstockpile storage sites and  begin CSEPP close-out activities following completion of \nthe ACWA program destruction operations and chemical surety activities , including \nsecondary waste disposal. \n \nFY 2025 Program:   Continue decontamination and decommissioning closure activities at \nColorado and Kentucky, and complete secondary waste disposal from the Kentucky site.  Continue \nthe CSEPP efforts for emergency response capabilities at Kentucky and closeout activities.   \nPrime Contractor(s):  Bechtel National Incorporated; Pueblo, CO  \n  Bechtel Parsons, Joint Venture; Richmond, KY \n \nQty $M Qty $M Qt y $M\nChemical Agents and \nMunitions Destruction -               1,059.8    -               1,091.8    -               775.5       \n   Total -               1,059.8    -               1,091.8    -               775.5       \nChemical Demilitarization\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nChemical Demilitarization"
    },
    {
      "page": 79,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-9 \n \nThe Joint Air -to-Ground Missile (JAGM) system \nprovides an improved air -to-ground missile \ncapability for rotary -wing aircraft and unmanned \naircraft systems.  The JAGM is an aviation -\nlaunched, precision-guided munition for use against \nhigh-value stationary, moving, and relocatable land \nand naval targets.  The JAGM is different than the \nHELLFIRE AGM-114R in that it utilizes a multi -\nmode seeker to provide precision point and fire -\nand-forget targeting day or night in adverse \nweather, battlefield obscured conditi ons, and \nagainst a variety of countermeasures.  A multi -\npurpose warhead provides lethal effects against a range of target types, from armored vehicles, \nthin-skinned vehicles, and maritime patrol craft, to urban structures and field fortifications.  The \nJAGM delivers the Joint services a single air -to-ground missile with improved lethality, \noperational flexibility, and a reduced logistics footprint. \n \nMission:  Engages and defeats high value stationary, moving, and relocatable land and naval \ntargets with precision point and fire -and-forget targeting day or night, in adverse weather, \nbattlefield obscured conditions, and against a variety of countermeasures. \n \nFY 2025 Program:  Continues Full Rate Production for Joint Services. \n \nPrime Contractor(s):  Lockheed Martin Missiles and Fire Control; Orlando, FL \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qt y $M\nRDT&E\nUSA             -              2.3             -              3.0             -              3.0 \nUSN             -              0.4             -              0.4             -            20.7 \nSubtotal             -              2.6             -              3.4             -            23.7 \nProcure me nt\nUSA           704        216.0           901        303.4             23          47.6 \nUSN           300          78.4           264          79.3           182          76.8 \nSubtotal        1,004        294.4        1,165        382.7           205        124.4 \n   Total        1,004        297.1        1,165        386.1           205        148.1 \nJoint Air-to-Ground Missile (JAGM)\nFY 2023 FY 2024 FY 2025\n                                                                                                         Numbers may not add due to rounding \nJoint Air-to-Ground Missile"
    },
    {
      "page": 80,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-10 \n \nThe Long Range  Anti-Ship Missile (LRASM) is a \nNavy-lead joint interest (Navy/Air Force) program \nthat provides Combatant Commanders the ability to \nconduct anti-surface warfare operations  and deny the \nsanctuary of maneuver to high-value adversary surface \ncombatants protec ted by an Integrated Air Defense \nSystem with long -range surface- to-air missiles.  \nLRASM is a precision guided anti -ship missile with \nsemi-autonomous guidance, day/night and all-weather capability, which integrates a multi-modal \nsensor suite, a weapons datalink, enhanced digital anti-jam Global Positioning System capabilities, \nand a 1,000 lb. penetrator/blast fragmentation warhead.  LRASM achieved Early Operational \nCapability (EOC) on the Air Force B-1 bomber in December 2018 and on the Navy F/A-18E/F in \nNovember 2019.  In FY 2024, the Navy begins procuring the LRASM C-3 Extended Range (ER) \nvariant, an AGM -158C derived capability to enhance long range strike and existing OASuW \ncapability for the Navy F/A -18E/F.  LRASM C -3 provides the C++ software, BLOS Weapons \nData Link, advanced survivability, and the JASSM-ER range and strike capability.  LRASM shares \na production line with the Joint Air-to-Surface Standoff Missile (JASSM). \n \nMission:  Provide robust anti-surface warfare capability to ensure freedom of maneuver, maintain \nsea lines -of-communication, and extend joint warfighter combat reach in contested maritime \nenvironments. \n \nFY 2025 Program:  Funds the second year of a Multiyear Procurement (MYP) contract.  Procures \n205 LRASM and funds telemetry kit installations.  Continues C -3 system level testing, tooling, \nand test set development with planned flying test bed events.   \n \nPrime Contractor(s):  Lockheed Martin Missiles and Fire Control; Orlando, FL \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               6.3           -               -             -               16.3         \nProcure me nt\nUSN 66            219.7       91            639.6       90            326.4       \nUSAF 57            211.6       27            187.7       115          354.1       \nSubtotal 123          431.3       118          827.3       205          680.5       \nTotal 123          437.6       118          827.3       205          696.8       \nLong Range Anti-Ship Missile (LRASM)\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                  Numbers may not add due to rounding \nLong Range Anti-Ship Missile (LRASM)"
    },
    {
      "page": 81,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-11 \n \nThe Military departments develop, procure and \nfield conventional and leap- ahead ammunition \nproviding Joint Warfighters and Allied Partners \novermatch capabilities. \n \nMission:  Provide for the production and fielding \nof ammunition. Includes small, medium, and large \ncaliber direct fire ammunition; artillery and \nmortar projectiles; grenades, area denial, shoulder \nlaunched munitions, rocket -assisted projectiles, \ncountermine, and pyrotechnics.    \n \nFY 2025 Program:  Procures various ammunition cartridges for use by the Army, Navy, Marine \nCorps, and Air Force to fulfill combat and training mission requirements. \n \nGovernment-Owned, Contractor-Operated Production Facilities: \n• Holston Army Ammunition Plant, Kingsport, Tennessee:  Produces and develops Insensitive \nMunitions Explosives (IMX); synthesizes and manufactures high explosive compounds such as \nResearch Department Explosive (RDX) and High Melting Explosive (HMX). \n• Iowa Army Ammunition Plant, Middletown, Iowa:  Assembles and p acks: medium - and large-\ncaliber ammunition; large ammunition; high explosive artillery; medium - and - large caliber \nmortars; insensitive munitions; smart munitions mines/scatterable mines; m issile \nassembly/missile warheads; and rocket-assisted projectiles. \n• Lake City Army Ammunition Plant, Independence, Missouri: Produces upgraded small caliber \nammunition (5.56mm, 7.62mm, .50 Cal, and 20mm) and develop s the Next Generation Squad \nWeapon. \n• Radford Army Ammunition Plant, Radford, Virginia:  Produc es propellants, energetics , and \nmunitions.  \n• Scranton Army Ammunition Plant, Scranton, Pennsylvania:  Manufactures large caliber metal   \nprojectiles and mortar projectiles. \n \nCommercial-Owned, Contractor-Operated Production Facilities: \n• Ammunition facilities exist in the United States, Canada, and allied nations, comprising over 250 \ncompanies, over 1,200 end items and 1,300 components; major National Technology and \nIndustrial Base (NTIB) include GD -OTS, AMTEC, Raytheon, and BAE Systems. Foreign \nsuppliers include Nammo (Sweden), UTM Ltd (UK), and Poongsan (Korea). \n \n \n \nQty $M Qty $M Qty $M\nProcure me nt\nUSA        -      8,737.4          -    2,967.6          -    2,702.6 \nUSN        -      1,690.3          -    1,293.3          -    1,747.9 \nUSAF        -         840.0          -       703.2          -       709.5 \n   Total        -    11,267.7          -    4,964.0          -    5,160.0 \nProcurement of Ammunition\nFY 2023 FY 2024 FY 2025\n \n                                                                                                        Numbers may not add due to rounding \nAmmunition"
    },
    {
      "page": 82,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-12 \n \nThe Advanced Anti -Radiation Guided Missile – \nExtended Range (AARGM -ER) program will \nintegrate hardware and software upgrades to the \nAARGM missile guidance and control sections, a \nnew rocket motor, and a control actuation s ystem \ninto a new outer mold line able to be launched from \nFA-18 E/F, EA -18G and is compatible with F -35 \ninternal bay platforms.  AARGM-ER's capabilities \nwill provide improved extended range, increased \nsurvivability and effectiveness against complex, \nnew, and emerging threats.  The AARGM -ER is a \njoint Navy/Air Force program led by the Navy.  \n \nMission:  AARGM-ER production units will prosecute integrated air defense systems supporting \nsuppression and destruction of enemy air defenses missions. \n \nFY 2025 Program:  Procures 157 missiles for the Navy and 128 missiles for the Air Force on the \nfull rate production contract. Advance procurement funding is included for subcomponents \nproviding critical 14- month time savings for missile delivery .  RDT&E funding continues \nexpansion of the F/A-18 employment envelope, F-35 weapon integration, development of a virtual \nstore training capability, and AARGM-ER integration into the mission planning tool.   \n \nPrime Contractor(s):  Northrup Grumman Corporation Defense Systems; Northridge, CA \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E\nUSN             -            89.2             -            59.6             -            28.7 \nUSAF             -          243.1             -          298.6             -          375.5 \nSubtotal             -          332.2             -          358.1             -          404.2 \nProcure me nt\nUSN           100        181.3             83        195.7           157        248.6 \nUSAF             42          78.0             14          41.9           128        173.4 \nSubtotal           142        259.3             97        237.6           285        422.0 \nTotal           142        591.5             97        595.8           285        826.2 \nAdvanced Anti-Radiation Guided Missile - Extended Range (AARGM - ER)\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                             Numbers may not add due to rounding  \nAdvanced Anti-Radiation Guided Missile"
    },
    {
      "page": 83,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-13 \nThe Guided Multiple Launch Rocket System \n(GMLRS) is a family of surface-to-surface artillery \nrockets which are fired from the M142 High \nMobility Artillery Rocket System (HIMARS) and \nthe M270A1/A2 Mult iple Launch Rocket System  \n(MLRS) launchers.  They provide a responsive, all-\nweather, rapidly deployable precision strike \ncapability.  The GMLRS guidance set combines an \nInertial Measurement Unit with a Global \nPositioning System receiver to provide a high level of accuracy to maximize effects against a \nvariety o f targets.  Production of the first variant, the M30 GMLRS Dual Purpose Improv ed \nConventional Munition (DPICM) with a cluster munition (CM) warhead, was terminated in \nresponse to the June 2008 Department of Defense (DoD) Policy on CM and Unintended Harm to \nCivilians.  The GMLRS program now produces two other warhead variants with a range of 15-\n70+ kilometers.  The M31A2 GMLRS Unitary can precisely engage point targets utilizing a single \n200-pound, low collateral damage, high- explosive warhead.  The M30A2 GMLRS Alternative \nWarhead (AW) is a non-cluster munition used to engage area and imprecisely located targets.  All \nUnitary and AW models in inventory and in production comply with the requirements outlined in \nthe November 2017 update to DoD  Policy on CM.  The latest rocket models are configured with \nthe Insensitive Munitions Propulsion System  (IMPS) that improves Soldier safety and launcher \nsurvivability.  The Army is currently executing an Extended Range (ER) GMLRS modification to \ndouble the current maximum range and an Enhanced AW (EAW) warhead modification to provide \nincreased lethality against light/medium anti-armor capability. \n \nMission:  Complements cannon artillery fires by suppressing, neutralizing,  or destroying enemy \nindirect fire support, air defense capabilities, and other light materiel/personnel targets. \n \nFY 2025 Program:   Fu nds the second year of a Multiyear Procurement (MYP) contract.  \nContinues production of current rocket variants and development/qualification of modifications to \nextend the maximum range and enhance warhead effectiveness. \n \nPrime Contractor(s):  Lockheed Martin Corporation; Dallas, TX and Camden, AR. \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -           19.4         -           76.0         -           20.6         \nProcure me nt\nUSA -           2,170.2    -           942.3       -           1,219.8    \nUSN -           7.3           -           8.9           -           1.6           \nSubtotal -           2,177.5    -           951.2       -           1,221.4    \nTotal -           2,196.9    -           1,027.2    -           1,241.9    \nGuided Multiple Launch Rocket System\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nGuided Multiple Launch Rocket System \nUS Army Photo"
    },
    {
      "page": 84,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-14 \nThe Javelin is highly effective against a variety of targets at extended ranges under day/night, \nbattlefield obscurants, adverse weather, and \nmultiple counter-measure conditions.  The \nsystem’s soft -launch feature permits firing from \nenclosures commonly found in complex urban \nterrain.  The system consists of a reusable \ncommand launch unit (CLU) and a modular \nmissile encased in a disposable launch tube \nassembly.  The CLU provides stand- alone all -\nweather and day/night surveillance capability.  \nJavelin provides precision effects in either a top -\nattack or direct -attack mode to defeat armored \nvehicles, fortifications , and soft targets in full \nspectrum operations.  It uses an imaging infrared \ntwo-dimensional staring focal plane array seeker and a tandem warhead with two shaped charges, \na precursor warhead to defeat reactive armor, and a primary warhead to penetrate base armor and \nother structures.  It is effective against stationary and moving targets. \n \nMission:  Provides the dismounted soldier with the only man-portable, fire-and-forget system that \nis highly lethal against targets ranging from main battle tanks to fleeting targets of opportunity \nfound in current threat environments. \n \nFY 2025 Program:  Continues procurement of the JAVELIN FGM -148F (F model) missile and \nLightweight Command Launch Unit  \n \nPrime Contractor(s):   Javelin Joint Venture (Raytheon Missiles & Defense;  Tucson, AZ and \n \n                          Lockheed Martin; Orlando, FL) \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E          -         15.9          -           7.8          -         10.4 \nProcure me nt\nUSA     2,415     874.5        541     199.5        930     326.1 \nUSMC     1,313     257.9          91       54.9        123       61.6 \nSubtotal     3,728  1,132.4        632     254.4     1,053     387.7 \nTotal     3,728  1,148.3        632     262.2     1,053     398.1 \nJavelin Advanced Anti-Tank Weapon System - Medium\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                             Numb ers may not add due to rounding \nJavelin Advanced Anti-Tank Weapon System \n \nUSMC Photo"
    },
    {
      "page": 85,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-15 \nThe Precision Strike Missile (PrSM ) is  the \nArmy’s next generation surface -to-surface \nballistic missile that replaces and improves \nupon the Army Tactical Missile System \n(ATACMS).  PrSM will provide Joint Force \nCommanders with a 24/7, all weather \ncapability to attack critical and time sensitive \narea and point targets including threat air \ndefense, missile launchers, command and \ncontrol centers, assembly/staging areas, and \nhigh payoff targets at all depths of the multi -\ndomain battlefield.  PrSM provides field \nartillery units with long range and deep strike capability while supporting brigade, division, corps, \nArmy, theater, Joint/Coalition Forces, and Marine Air -Ground Task Forces in full, limited, or \nexpeditionary operations. \n \n  \nMission:  Destroy/neutralize/suppress targets at ranges from 70-400 km (threshold) using missile-\ndelivered indirect precision fires.  \n  \nFY 2025 Program:  Procures additional Increment 1 missiles with Launch Pod Missile Containers \nand tooling investments to increase production in the future.   \n  \nPrime Contractor(s):  Lockheed Martin Missiles and Fire Control; Grand Prairie, TX  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E          -       250.0          -       272.8          -       184.0 \nProcure me nt          42     162.9        110     384.1        230     492.6 \nTotal          42     412.9        110     656.9        230     676.6 \nPrecision Strike Missile\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                   Numbers may not add due to rounding \nTactical Tomahawk Cruise Missile \nPrecision Strike Missile"
    },
    {
      "page": 86,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-16 \nThe Trident II (D5) is a submarine launched ballistic missile.  It \nprovides the most survivable, second- strike capability in our \nnation’s nuclear triad.  The Trident II missile is carried on the \nOHIO-class and will be carried on the COLUMBIA-class Fleet \nBallistic Missile Submarines.  The D5 Life Extension (D5LE) \nProgram is currently being executed to extend the life of the \nTrident II to match the extended 42-year life of the OHIO Class \nSubmarine.  Funding for the D5 Life Extension 2 (D5LE2) is \nnecessary now to ensure the Trident II will meet the needs of the \nfleet beyond 2039 and extend the life of Trident II through the \n2080s.  The D5LE and D5LE2 ensure the Trident II will address \ncomponent obsolescence, inventory depletion,  and provide  \nmodularity for adaptability to evolving threats.  The importance \nof this program as a key component to the sea-based leg of the nuclear triad was re-confirmed by \nthe President and Congress with the renewal of the New Strategic Arms Reduction Treaty in 2021. \n \nMission:  Aboard a virtually undetectable platform, the submarine launched fleet ballistic missile \ndeters nuclear war by means of assured second- strike capability in response to a major attack on \nthe United States or its allies. \n \nFY 2025 Program:  Continues to support the production of the redesigned missile which will be \ndeployed on the COLUMBIA-class Fleet Ballistic Missile Submarine.  Funds support procurement \nof Trident II D5LE warhead components, Solid Rocket Motors, the Mk4B Shape Stable Nose Tip \n(SSNT), and replacement of D5 legacy tooling and test support equipment.  Development efforts \nof the D5LE2 include system studies and architecture development, W93/Mk7 warhead subsystem \ndesign reviews, as well as Submarine Launched Ballistic Missile (SLBM) and strategic guidance \ntechnologies in order to deliver a System Requirements Review in FY 2025. \n \nPrime Contractor(s):  Lockheed Martin Corporation; Sunnyvale, CA \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qt y $M\nRDT&E -               304.0       -               321.6       -               403.4       \nProcure me nt -               1,390.5    -               1,548.6    -               2,062.3    \n   Total -               1,694.5    -               1,870.2    -               2,465.7    \nTrident II Ballistic Missile Modifications\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nTrident II Ballistic Missile Modifications \nUS Navy Photo"
    },
    {
      "page": 87,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-17 \nThe Standard Missile -6 (SM -6) is a \nsurface Navy Anti -Air Warfare missile \nthat provides area and ship self -defense.  \nThe missile is intended to project power \nand contribute to raid annihilation by \ndestroying manned fixed and rotary wing \naircraft, Unmanned Aerial Vehicles  \n(UAV), Land Attack Cruise Missiles, and Anti-Ship Cruise Missiles in flight.  It was designed to \nfulfill the need for a vertically launched, extended range missile compatible with the Aegis \nWeapon System to be used against extended range threats at -sea, near land, and overland.  The \nSM-6 combines the tested legacy of STANDARD Missile-2 (SM-2) propulsion and ordnance with \nan active Radio Frequency seeker modified from the AIM-120 Advanced Medium Range Air-to-\nAir Missile (AMRAAM), allowing for over -the-horizon engagements, enhanced capability at \nextended ranges, and increased firepower. \n \nMission:  Provides all -weather, anti -aircraft armament for cruisers and destroyers.  The most \nrecent variant of Standard Missile is SM-6, which incorporates an AMRAAM seeker for increased \nperformance, including overland capability. \n \nFY 2025 Program:   Funds the procurement of 125 SM -6 IA missiles and canisters under the \nsecond year of a Multiyear Procurement (MYP) contract.  The factory will operate at the maximum \nproduction rate.  RDT&E funding completes Block IB rocket motor  prototyping, begins rocket \nmotor Engineering and Manufacturing Development, continues new Electronic Unit efforts for \nSM-6, continues Aegis architecture and design for SM-6 Block IB extended range capability, the \nprocurement of Block IB components including ground test and controlled test vehicle hardware, \nMK-29 Mod I canisters for the Block IB flight and safety qualification testing, and seven (7) fleet \nexperimentation rounds.   \n \nPrime Contractor(s):  Raytheon Missiles & Defense; Tucson, AZ \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E             -       298.3             -       418.2             -       468.3 \nProcure me nt           125     489.1           125  1,196.8           125     755.2 \n   Total           125     787.5           125  1,615.0           125  1,223.5 \nStandard Missile-6\nFY 2023 FY 2024 FY 2025\n                                                                                                          Numbers may not add due to rounding \nStandard Missile 6 \nUS Navy Photo"
    },
    {
      "page": 88,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-18 \nThe RM-116 Rolling Airframe Missile  (RAM) is a \nhigh firepower, lightweight complementary self -\ndefense system to engage anti -ship cruise missiles.  \nThe systems design is based upon the infra red (IR) \nseeker of  the Stinger  (FIM-92) missile, and the \nwarhead, rocket motor, and fuse from the Sidewinder  \n(AIM-9) missile.  The missile uses Radio Frequency  \nfor midcourse guidance, and transitions to IR guidance \nfor terminal engagement.  The current RM -116 \nconfiguration is Block II (RIM -116C). Block 2A \nincludes software modifications to improve raid \nperformance and Block 2B includes an upgraded seeker and missile to missile link.   \n \nMission:  Provides high firepower close-in defense of combatant and auxiliary ships by utilizing \na dual mode, passive radio frequency/infrared missile in a compact 21 missile launcher. \n \nFY 2025 Program:   Procure s 148 RAM missiles, 4 Block 1 to 2B Ordnance Alterations \n(ORDALTS), and 70 Block 2 to 2A ORDALTS.\n  \n \nPrime Contractor(s):  Raytheon Missiles & Defense; Tucson, AZ \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E          -         16.7          -         11.1          -         19.2 \nProcure me nt        100       92.1        120     114.9        148     141.0 \n   Total        100     108.9        120     126.0        148     160.2 \nRolling Airframe Missile\nFY 2023 FY 2024 FY 2025\n                                                                                                        Numbers may not add due to rounding \nRolling Airframe Missile \nUS Navy Photo"
    },
    {
      "page": 89,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-19 \nNaval Strike Missile (NSM) funding is \nrequired to support Navy Over The Horizon  \n(OTH) Weapon System program for Littoral \nCombat Ship (LCS) and Frigate, Guided \nMissile (FFG) Ships.  The program provides a \nlong-range anti-surface offensive capability to \nimprove the ship's ability to defend against \nenemy surface ships.  NSM provides the \nMarine Corps' Navy/Marine Corps \nExpeditionary Ship Interdiction System \n(NMESIS) with a ground- based anti -ship capability .  Missile components include a missile \nencased in a firing canister consist ing of a flight vehicle that is  mechanically and electrically \nconnected within a weapon canister.  The flight vehicle's major components are operationally \njoined, consisting of an explosive warhead, propulsion system, guidance system, initiation system, \nand other components.  The weapon canister is a mechanical structure with electrical \ninterconnections that is used to support and restrain the flight vehicle during loading and unloading \noperations.  The weapon canister allows the flight vehicle to connect to the Missile Launch System \nwithout being exposed to the environment.  The Navy and Marine Corps procure the same NSM \nconfiguration.   \n \nMission:  Destroys low and high altitude, high- speed enemy targets in an electronic \ncountermeasures environment. \n \nFY 2025 Program:   Funds the second year of a Multiyear Procurement ( MYP) to procure 12 \nNSMs for the Navy and 90 NSMs for the Marine Corps.  RDT&E efforts support LCS operational \ntest flight execution and live fire test and evaluation efforts. \n \nPrime Contractor(s):  Kongsberg Defence and Aerospace; Kongsberg, Norway \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               8.1           -               5.2           -               2.0           \nProcure me nt\nUSN 39            59.0         13            35.7         12            29.3         \nUSMC 115          174.4       90            209.0       90            174.8       \nSubtotal 154          233.4       103          244.7       102          204.1       \nTotal 154          241.5       103          249.9       102          206.1       \nNaval Strike Missile\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                             Numbers may not add due to rounding  \nNaval Strike Missile"
    },
    {
      "page": 90,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-20 \nTomahawk is a combat -proven, long- \nrange strike weapon that delivers a  \n1,000 lb. class warhead at ranges greater \nthan 900 nm.  Tomahawk is launched \nfrom U.S. Navy surface and submarine \ncombatants and provides a high \nprecision, all-weather, deep-strike attack capability against fixed and mobile targets .  Because of \nTomahawk’s capability, more than 2,000 Tomahawk combat expenditures have occurred to date.  \nKey weapon features include:  precision navigation/guidance; robust anti-jam Global Positioning \nSystem (GPS) capabilities; high responsiveness and mission flexibility due to an in-flight re-\ntargeting capability; and the ability to transmit Battle Damage Indication  reports prior to weapon \nimpact. \n \nMission:  Provides precision strike against long and medium range tactical targets. \n \nFY 2025 Program:  Continues the procurement of Tomahawk missiles for the Marine Corps and \nshifts the Navy’s focus  to mid-life recertification phase efforts to increase the service life of the \nmissile.  Funds the development of a maritime strike variant to engage surface target and the Joint \nMulti-Effects Warhead System for optimal lethality. \n \nPrime Contractor(s):  Raytheon Missiles & Defense; Tucson, AZ \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               119.8       -               122.8       -               200.7       \nProcure me nt\nUSN 55            738.8       -               706.3       -               449.4       \nUSMC 13            43.0         34            105.2       22            115.2       \n   Subtotal 68            781.7       34            811.5       22            564.7       \nTotal 68            901.5       34            934.3       22            765.4       \nTactical Tomahawk Cruise Missile\nFY 2023 FY 2024 FY 2025\n \nIncludes modification programs                                                                          Numbers may not add due to rounding  \nTactical Tomahawk Cruise Missile \nUS Navy Photo"
    },
    {
      "page": 91,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-21 \nThe LGM-35A Sentinel, formerly known as the Ground Based Strategic \nDeterrent program is the Air Force effort to replace the aging LGM -30 \nMinuteman III intercontinental ballistic missile  (ICBM) weapon system.  The \nMinuteman III missile fleet was fielded in the 1970s with an initial 10 -year \nservice life while its command and control (C&C) as well as launch systems date \nback to the 1960s.  Sentinel  will modernize or replace Minuteman III flight , \nC&C, and launch systems, including missile silos, control centers and other \nground infrastructures.  The new Sentinel weapon system will meet existing user \nrequirements, while having the adaptability and flexibility to address changing \ntechnology and threat environments  through 2075.  As a critical part of the \nnuclear triad, Sentinel will continue sustaining strategic stability, while hedging \nagainst vulnerabilities in other portions of the triad.  S hould deterrence  fail, \nSentinel will decisively defeat adversary targets while guaranteeing  retaliatory \ncapabilities as authorized  and directed by the President.  The program e ntered \nthe Engineering and Manufacturing Development (EMD) phase in September \n2020.  Deployment is projected to begin in the late 2020s.   \n \nMission:  Provides land-based strategic nuclear deterrence, assurance, and \nstability by delivering a responsive and resilient capability . That assures allies \ndo not need to expand their  own capability, dissuades proliferation, and deters \nadversaries. \n \nFY 2025 Program:  Funds activities in support of EMD to include:  advancing the test series for \nboth Development Test & Evaluation and Operational Test & Evaluation across the air vehicle, \nlaunch facility, launch center, and all other test support assets.  The proposed budget encompasses \nthe completion of sub-system Critical Design Reviews (CDR), leading up to the Weapon System \nCDR.   Additionally, it involves initiating utility corridor trenching for the Operational Weapon \nSystem Article (OWSA) and commencing the associated  conversion of first two (2) Launch \nFacilities and two (2) Launch Centers.  T he FY 2025 budget also supports advance procurement \nfor six Secondary Launch Platform – A irborne aircraft group -B kits in support of incremental \nMinuteman III capability; as well as security systems and associated equipment for new facilities \nat Vandenberg SFB and F.E. Warren AFB.   \n \nPrime Contractor(s):  Northrop Grumman Corporation; Roy, UT \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               3,434.6    -               3,746.9    -               3,721.0    \nProcure me nt -               2.8           -               543.5       -               10.9         \n   Total -               3,437.5    -               4,290.4    -               3,731.9    \nSentinel\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nLGM-35A Sentinel"
    },
    {
      "page": 92,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nMissiles & Munitions \n5-22 \nLong Range Stand -Off (LRSO) Weapon is a nuclear cruise \nmissile capable of penetrating and surviving complex advanced \nintegrated air defense systems in  GPS-denied environments \nfrom significant stand-off ranges.  The LRSO replaces the Air \nLaunched Cruise Missile (ALCM) which entered service in  \n1982 and is well past its original 10 -year service life  design.  \nLRSO details are classified to protect critical program \ninformation.  The program entered the En gineering and \nManufacturing Development (EMD) phase in July 2021.   \n \nMission:  R etains penetrating and survivable capabilities \nagainst advanced Integrated Air  Defense Systems in  GPS-\ndenied environments from significant stand-off ranges, ensuring a credible deterrent.  Combined \nwith nuclear capable bombers, LRSO provides the nuclear triad with a clear, visible, and tailorable \ndeterrent.  LRSO provides the President and U.S. Forces the ability to project power and hold at \nrisk any target at any locati on on the globe.  LRSO also provides a hedge against future \ntechnological and geopolitical uncertainties.   \n \nFY 2025 Program:  Funds the LRSO cruise missile  procurement, allowing the Air Force to \npurchase ancillary equipment, warhead support equipment, and field trainers required to be in \nplace for initial Nuclear Surety Inspection (INSI).  The INSI must be accomplished prior to fielding \nthe weapon system and attaining Initial Operational Capability.  Additionally, the FY  2025 PB \nrequest includes $140 million in Advanced Procurement funding, to procure long lead time \ncomponents and maintain the LRSO production schedule. \n \n \nPrime Contractor:  Raytheon Company; Tucson, AZ \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               921.9       -               911.4       -               623.5       \nProcure me nt -               31.5         -               66.8         -               210.3       \n   Total -               953.3       -               978.2       -               833.8       \nLong Range Stand-Off Weapon\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nLong Range Stand-Off Weapon"
    },
    {
      "page": 93,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nShipbuilding & Maritime Systems \n6-1 \n$ in Billions \nShipbuilding and Maritime Systems \nA central principle to the United States Maritime Strategy is forward presence, which promotes \nconflict deterrence by ensuring forces are in a position to expeditiously respond to conflict.  \nTherefore, sea services must procure, build, and maintain maritime systems in accordance with \nmission needs.  The funding in this category finances developmental efforts, equipment \nprocurements, and construction of ships that will allow the U.S. Navy to maintain maritime  \ndominance and superiority well into the 21st century. \n \nThe Department is requesting $4.0 billion for the Submarine Industrial Base to increase production \ncapacity, to improve  Virginia Class submarine production, while sustaining the Columbia Class \nsubmarine annual rate of production.   \n \nThe FY 202 5 Shipbuilding Portfolio includes funding for the construction and service life \nextension of 12 vessels and procurement of two used sealift vessels.  Six  battle force fleet ship s \nwill begin construction:  One SSN 774 Virginia class nuclear attack submarine, equipped with the \nVirginia Payload Module ; two DDG 51 Arleigh Burke c lass Flight III destroyers; one FFG \nConstellation class Frigate; one LPD-17 San Antonio class Amphibious ship; and one Medium \nLanding Ship.  \nFY 2025 Shipbuilding and Maritime Systems Total:  $48.1 Billion \n \n \nOutfitting & \nPost Delivery\n$2.6\nSubmarine \nCombatant\n$19.6\nShip Equipment\n$6.8\nSupport Ships\n$2.7\nSurface Combatant\n$13.5 Technology \nDevelopment\n$2.9\nNumbers may not add due to rounding \n$ in Billions"
    },
    {
      "page": 94,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nShipbuilding & Maritime Systems \n6-2 \nAircraft carriers are the centerpiece of  U.S. Naval \nforces.  The CVN 78 class ships include new \ntechnologies and enhancements that  improve \nefficiency and operating costs as well as reduced \ncrew requirements.  This new class brings improved \nwarfighting capability, quality-of-life improvements \nfor Sailors, and reduced total  ownership costs.  \nUSS Gerald R. Ford is the first aircraft carrier \ndesigned with all electric utilities, eliminating steam \nservice lines from the ship, reducing maintenance \nrequirements and improving corrosion control.  The \nnew A1B reactor, Electromagnetic Aircraft Launch System (EMALS), Advanced Arresting Gear \n(AAG) and Dual Band Radar (DBR) all offer enhanced capability with reduced manning.  The \nship's systems and configuration are optimized to maximize the sortie generation ra te (SGR) of \nattached strike aircraft. \n \nMission:  Provides the United States with the core capabilities for forward presence, deterrence,  \nsea control, power projection, maritime security, and humanitarian assistance.  The Gerald R. Ford \nclass will be the pr emier forward asset for crisis response and early decisive striking power in a \nmajor combat operation. \n \nFY 2025 Program:  Funds continued construction for three carriers USS John F. Kennedy (CVN \n79), USS Enterprise (CVN 80) and USS Doris Miller (CVN 81).  CVN 80 and CVN 81 comprise \na two-carrier procurement contract, awarded in FY 2019, which is expected to yield approximately \n$4.0 billion in savings.  Additional funding includes outfitting, training equipment, and continued \ndevelopment of ship systems. \n \nPrime Contractor(s):  Huntington Ingalls Industries; Newport News, VA   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qt y $M Qty $M\nRDT&E -               157.0       -               118.2       -               96.7         \nProcure me nt -               3,048.7    -               2,586.2    -               2,242.7    \n   Total -               3,205.7    -               2,704.4    -               2,339.4    \nCVN 78  Gerald R. Ford Class Nuclear Aircraft Carrier\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nCVN 78 Gerald R. Ford Class Nuclear Aircraft Carrier"
    },
    {
      "page": 95,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nShipbuilding & Maritime Systems \n6-3 \nThe Columbia c lass Ballistic \nMissile Submarine  (SSBN) will  \nreplace the current Ohio  class of \nFleet Ballistic Mis sile Submarine.  \nThe USS  Columbia program will \ndeliver 12 SSBNs with the \nnecessary capability  and capacity \nto meet the sea- based strategic \ndeterrence mission beyond \nretirement of the current submarine \nforce and with sufficient mission \ncapability to counter credible \nthreats through 2080. \n \nConstruction began in FY  2021 for FY  2028 delivery when the first Ohio class boats begin \ndecommissioning.  The nuclear propulsion systems will be acquired from the nuclear industrial \nbase under the direction of Naval Reactors.  The program includes the development and \nconstruction of a Common Missile Compartment (CMC) capable of hosting the TRIDENT II \nmissile system, a jointly conducted effort with the United Kingdom to support the Dreadnought  \nclass SSBN. \n \nMission:  Provides a sea-based strategic nuclear force.  Maintains an appropriate state of readiness \nto assist in deterring nuclear attack on the United States and its allies.  Launches missiles against \ntargets should deterrence fail.  Performs extended strategic deterrent patrols without requiring \nassistance or replenishment. \n \nFY 2025 Program:  Funds the second of two increments of funding for the second boat ( USS \nWisconsin SSBN 827), future boats’ advance procurement, and detail design and construction of \nContractor Furnished Equipment (CFE) and Government Furnished Equipment (GFE).  Advance \nprocurement includes CFE and GFE Long Lead Time Material; continuous production of m issile \ntubes; advance construction; Economic Order Quantity for multi -program procurement; and \ncontinuous production of shipyard manufactured items.  FY 2025 also continues funding research \nand development of nuclear technologies and ship systems such as the propulsion system, combat \nsystems technology, and CMC.   The request also supports the submarine industrial base to reduce \nthe Columbia class’s construction schedule risk.     \n \nPrime Contractor(s):  General Dynamics; Groton, CT \nHuntington Ingalls Industries; Newport News, VA \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               401.3       -               311.5       -               234.0       \nProcure me nt -               5,871.8    1              5,906.5    -               9,644.6    \n   Total -               6,273.2    1              6,218.0    -               9,878.7    \nColumbia Class Ballistic Missile Submarine Program \nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nSSBN 826 Columbia Class Ballistic Missile Submarine \nArtist conception courtesy of the U.S. Navy"
    },
    {
      "page": 96,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nShipbuilding & Maritime Systems \n6-4 \nThe Virginia class submarine is a multi-\nmission nuclear -powered attack \nsubmarine that provides the Navy with \nthe capabilities to maintain undersea \nsupremacy in the 21st century.  \nCharacterized by advanced stealth and \nenhanced features for Special \nOperations Forces, this submarine is \nable to operate in deep water and littoral \nenvironments.  Equipped with vertical \nlaunchers and torpedo tubes, the submarine is able to launch Tomahawk cruise missiles and \nheavyweight torpedoes.  Block V variants will incorporate Acoustic Su periority and the Virginia \nPayload Module (VPM), which is an 84-foot hull section with four additional payload tubes, each \ncapable of carrying seven Tomahawk cruise missiles or various other payloads.  The VPM helps \nmitigate the loss of undersea strike capability with the retirement of the Navy’s four guided missile \nsubmarines (SSGNs) in the mid-2020s.  \n \nMission:  Seeks and destroys enemy ships and submarines across a wide spectrum of scenarios, \nworking independently and in concert with a battle group, separate ships, and independent units.  \nProvides theater commanders with critical time sensitive information for accurate knowledge of \nthe battlefield. \n \nFY 2025 Program:  Funds the first  Block VI boat as part of a  new multiyear procurement (MYP) \ncontract that begins in FY 2025 (nine boats total).  The FY 2025 request also funds  advance \nprocurement for four boats in future years, economic order quantity funds for future MYP boats \nin FY 2025 – FY 2029 and outfitting and support equipment.  FY 2025 continues funding \ndevelopment of future payload integration, test and evaluation of new capabilities, future Block \ndevelopment, and combat systems improvements.     \n \nPrime Contractor(s):  General Dynamics Corporation; Groton, CT \n                                      Huntington Ingalls Industries; Newport News, VA   \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               295.8       -               225.9       -               265.4       \nProcure me nt 2              6,974.9    2              10,619.7  1              7,943.9    \n   Total 2              7,270.7    2              10,845.6  1              8,209.3    \nSSN 774 Virginia Class Submarine\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nSSN 774 Virginia Class Submarine \nCourtesy of the US Navy"
    },
    {
      "page": 97,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nShipbuilding & Maritime Systems \n6-5 \nThe Arleigh Burke  class (DDG 51) guided \nmissile destroyers provide a wide range of \nwar fighting capabilities in multi- threat air, \nsurface, and subsurface environments.  The \nDDG 51 class is armed with a vertical \nlaunching system, which accommodates 96 \nmissiles, and a 5 -inch gun that provides \nNaval Surface Fire Support to forces ashore \nand anti-ship gunnery capability against other \nships.  This is the first class of destroyers with \na ballistic missile defense capability.  The \nArleigh Burke  class includes four separate \nvariants:  DDG 51 -71 represent the original design, designated Flight I ships, and are being \nmodernized to current capability standards; DDG 72-78 are Flight II ships; DDG 79-124 and DDG \n127 ships are Flight IIA ships; and DDG 125, DDG 126, and DDG 128 – DDG 146 will be \nconstructed as Flight III ships with the Air and Missile Defense Radar (AMDR) capability. \n \nMission:  Operates within a carrier strike group or independently to provide multi -mission \noffensive and defensive capabilities.  Conducts Anti -Air Warfare, Anti-Submarine Warfare, and \nAnti-Surface Warfare. \n \nFY 2025 Program:   Funds two Flight III DDG 51 class destroyers  in the third year of the  \nFY 2023 – FY 2027 multi-year procurement contract for nine ships with two options, economic \norder quantity funding for the FY 2026 – FY 2027 ships, outfitting costs, completion costs and \ncontinued development of ship systems. \n  \nPrime Contractor(s):  General Dynamics Corporation; Bath, ME  \n                                      Huntington Ingalls Industries; Pascagoula, MS \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               199.1       -               268.9       -               227.3       \nProcure me nt 3              8,021.7    2              4,805.6    2              6,844.1    \n   Total 3              8,220.8    2              5,074.5    2              7,071.3    \nDDG 51 Arleigh Burke Class Destroyer\nFY 2023 FY 2024 FY 2025\n \n                                                                                                                             Numbers may not add due to rounding \nDDG 51 Arleigh Burke Class Destroyer \nUS Navy Photo"
    },
    {
      "page": 98,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nShipbuilding & Maritime Systems \n6-6 \nThe Constellation class (FFG -62) guided missile \nfrigates are lethal and survivable multi-mission small \nsurface combatants.  With the Constellation class, the \nNavy will maximize the small surface combatant \nsurvivability and capabilities in the anti- surface \nwarfare, anti -submarine warfare, electromagnetic \nmaneuver warfare, air warfare mission areas, while \nkeeping the ship affordable as a part of a \"high- low\" \nmix of surface ships.  The Constellation  class will \nform into strike groups and Large Surface Combatant \naction groups while maintaining the ability to operate \nindependently.  The ships in this class will have a \nMK48 Mod 2 Gun Weapon System, a MK41 Vertical \nLaunch System, and a Rolling Airframe Missile  \n(RAM) Guided Missile Weapon System (GMWS). \n \nMission:  Provides the Fleet with escort mission capabilities, performs naval- presence missions \nand conducts offensive operations. \n \nFY 2025 Program:  Requests funding for one  Constellation class ship and continues research \nand development of ship systems and testing efforts.  \n \nPrime Contractor(s):  Fincantieri Marinette Marine; Marinette, WI   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qt y $M\nRDT&E -               106.2       -               113.0       -               107.7       \nProcure me nt 1              1,444.8    2              2,173.7    1              1,170.4    \n   Total 1              1,551.1    2              2,286.7    1              1,278.1    \nConstellation Class Guided Missile Frigate\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nConstellation Class Guided Missile Frigate"
    },
    {
      "page": 99,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nShipbuilding & Maritime Systems \n6-7 \n The CVN Refueling Complex Overhaul \n(RCOH) life extension program involves \nrefueling and modernizing the nuclear-powered \nfleet aircraft carriers.  During the RCOH, the \nnuclear fuel and obsolete parts are replaced, \nmajor system are modernized; and corrosion \ndamage is repaired.  Nimitz class aircraft carriers \nare designed for a 50- year life span , and the \nRCOH is performed approximately mid way \nthrough the ship’s lifespan. \n \nMission:  Refuel and upgrade the Nimitz class \naircraft carriers at mid -life to ensure reliable \noperations during the remaining 25 plus years of \nship life using only the normal maintenance \ncycle. \n \nFY 2025 Program:  Funds the first of three years of full funding for  the  USS Harry S Truman \n(CVN 75) with the RCOH scheduled to being in FY 2025.  The FY 2025 request also funds cost \nto complete and outfitting for the USS John C. Stennis (CVN 74).   \n \nPrime Contractor(s):  Huntington Ingalls Industries; Newport News, VA   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qt y $M Qty $M\nRDT&E -               -             -               -             -               -             \nProcure me nt -               689.9       -               895.6       1              1,738.3    \n   Total -               689.9       -               895.6       1              1,738.3    \nCVN Refueling Complex Overhaul\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nCVN Refueling Complex Overhaul"
    },
    {
      "page": 100,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nShipbuilding & Maritime Systems \n6-8 \nThe LPD Flight II is the new variant of the \nSan Antonio class Amphibious Transport \nDock ship.  This flight II variant is designed \nto be adaptable and will be used across the \nrange of military operations, from major \ncombat operations to humanitarian \nassistance and disaster relief .  Utilizing the \nLPD 17 class’ p roven hull, the Flight II \nships will feature a fully capable flight deck \nand hangar, a well deck, and the vehicle and \ncargo capacities to support and sustain more \nthan 500 combat-equipped marines for up to \n30 days .  The ship will feature a Rolling \nAirframe Missile (RAM) Block 2 system; the MK 46 Gun system, and the AN/SPQ-9B radar.  The \nLPD 17 Flight II functionally replaces LSD 41 class ships and LSD 49 class ships. \n \nMission:  Transports and lands Marines, their equipment, and supplies by embarked Landing Craft \nAir Cushion (LCAC) or conventional landing craft and amphibious assault vehicles (AAV) \naugmented by helicopters or vertical take -off and landing aircraft (MV 22).  These ships support \namphibious assault, special operations, or expeditionary warfare missions and serve as secondary \naviation platforms for amphibious operations. \n \nFY 2025 Program:  Funds 1 LPD (LPD-33), development funds for testing, outfitting costs, and \ncost-to-complete. \n \nPrime Contractor(s):  Huntington Ingalls Industries; Pascagoula, MS \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               18.8         -               21.3         -               12.8         \nProcure me nt 1              1,989.4    -               56.3         1              1,640.2    \n   Total 1              2,008.2    -               77.6         1              1,653.0    \nLPD-17 San Antonio  Class Amphibious Transport Dock\nFY 2023 FY 2024 FY 2025\nNumbers may not add due to rounding \nLPD 17 San Antonio Class Amphibious Transport Dock \nArtist Conception courtesy of HII"
    },
    {
      "page": 101,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \n Shipbuilding & Maritime Systems \n6-9 \nThe John Lewis class Fleet Replenishment \nOiler (T -AO) program is building a new \nclass of fleet oilers for the Navy.  The \nUSNS John Lewis (T-AO 205) is the lead \nship in this class.  The T -AO provides fuel \nand cargo delivery to support fleet \noperations.  Compared to the previous class \nof oilers, the John Lewis class has increased \nspace for dry cargo, a helicopter refueling \ncapability, and a double hull  to guard \nagainst oil spills and to comply with \ninternational agreements concerning ship \npollution.  The lead ship, the USNS  John \nLewis (T-AO 205), delivered in July 2022. \n \nMission:  Transfers fuel and lubricants to Navy surface ships operating at sea to extend at-sea time \nfor the ships and embarked aircraft.  The T-AO Class operates as shuttle ships from resupply posts \nto customer ships.  Additionally, in conjunction with a T-AKE, they will accompany and stay on-\nstation with a Carrier Strike Group to provide fuel as required to customer ships. \n \nFY 2025 Program:  Funds outfitting costs, and cost-to-complete for prior year ships.   \n \nPrime Contractor(s):  General Dynamics, National Steel and Shipbuilding Co.; San Diego, CA \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               0.2           -               0.1           -               -             \nProcure me nt 1              1,060.5    1              967.6       -               261.2       \n   Total 1              1,060.7    1              967.7       -               261.2       \n John Lewis Class Fleet Replenishment Oiler\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nT-AO 205 John Lewis Class Fleet Replenishment Oiler \nArtist conception courtesy of NASSCO"
    },
    {
      "page": 102,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nShipbuilding & Maritime Systems \n6-10 \nThe Unmanned Surface Vessel (USV) is a multi -mission \nvessel designed to provide low cost, high endurance, \nreconfigurable ships that can accommodate various \npayloads for unmanned missions and augment the Navy's \nmanned surface force.  Future missions and payloads will \nbe informed as the concept of operations is developed.  \nWhile unmanned surface vehicles are new additions to fleet \nunits, they are intended to be relatively low developmental \ntechnologies that combine robust and proven commercial \nvessel designs with existing military payloads to rapidly and \naffordably expand the capacity and capability of the surface \nfleet.  The program benefits from years of investment and \nfull-scale demonstration efforts in autonomy, endurance, \ncommand and control, payloads and testing from the \nDefense Advanced Research Projects Agency’s (DA RPA) Anti-Submarine Warfare Continuous \nTrail Unmanned Vessel and Office of Naval Research’s Medium Displacement Unmanned Surface \nVessel/Sea Hunter and Office of the Secretary of Defense Strategic Capabilities Office’s Ghost \nFleet Overlord Large USV experimentation efforts.  \n \nMission:  Supports combatant ships by providing additional Anti -Surface Warfare and Strike \ncapacity. \n \nFY 2025 Program:  Funds continued development and testing of medium and large Unmanned \nSurface Vessels and continues research and development of payload systems .  FY 2025 also \ncontinues development work in USV core capabilities of system autonomy, sensors and \nperception, and Command, Control, Communications, Computer & Intelligence (C4I).   \n \nPrime Contractor(s):  TBD \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               300.1       -               237.9       -               185.2       \nProcure me nt -               -             -               -             -               -             \n   Total -               300.1       -               237.9       -               185.2       \nMedium and Large Unmanned Surface Vessels\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nMedium and Large Unmanned Surface Vessels"
    },
    {
      "page": 103,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nShipbuilding & Maritime Systems \n6-11 \nUSS America class ships are large -\ndeck, amphibious assault ships \ndesigned to support ground forces.  \nThis class can transport a combination \nof helicopters and vertical take- off \nand landing aircraft.  The first two \nships, USS America (LHA 6) and \nUSS Tripoli (LHA 7), ar e designated \nas Flight 0 Variants and include an \nenlarged hangar deck, enhanced \naviation maintenance facilities, \nincreased aviation fuel capacity, and \nadditional aviation storerooms as \ncompared to the previous Tarawa \n(LHA 1) class ships.  The USS Bougainville (LHA 8) is designated the first Flight I ship and will \nreincorporate a well deck for operational flexibility.  The well deck will enable surface operations \nwhile maintaining the aviation capabilities.  The USS Fallujah (LHA 9) is the second Flight I ship \nand has an LHA 8 baseline design. \n \nMission:  Provides forward presence and power projection as an integral part of joint, interagency, \nand multinational maritime expeditionary forces.  Operates for sustained periods in transit to and \noperations in an Amphibious Objective Area to include the embarkation, deployment, and landing \nof a Marine Landing Force and supporting forces by helicopters and tilt rotors supported by Joint \nStrike Fighters F-35B.   \n \nFY 2025 Program:  Funds advance procurement for LHA 10 (FY 2027 ship), outfitting costs, and \ncost to complete for LHA 8. \n \nPrime Contractor(s):  Huntington Ingalls Industries; Pascagoula, MS \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT\n&E -               12.2         -               19.4         -               11.7         \nProcure me nt 1              1,415.7    -               1,854.9    -               222.7       \n   Total 1              1,428.0    -               1,874.2    -               234.4       \nLHA America Class Amphibious Assault Ship\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nLHA America Class Amphibious Assault Ship \nArtist Conception courtesy of HII"
    },
    {
      "page": 104,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nShipbuilding & Maritime Systems \n6-12 \nThe Medium Landing Ship (LSM) is a \nmedium-sized landing ship that enables \ndistributed maneuver and logistics such as \nDistributed Maritime Operations , Littoral \nOperations in a Contested Environment, and \nExpeditionary Advanced Base Operations in \nsupport of the Marine Littoral Regiment \n(MLR). It is designed to fill the gap in \ncapability between the Navy's large, \nmultipurpose amphibious warfare class  \n(LHA/LPD) and s maller landing vessels  \n(LCAC/LCU).  \n \nMission:  Provides a highly maneuverable, mobile, independent, intra -theater range ship to \ncomplement the mix of traditional amphibious warfare ships.  This ship will deploy tailored \nlogistics, select power projection and support strike capabilities via the embarked MLR. \n \nFY 2025 Program: Funds the lead ship (new start in FY 2025) and continuing development \nefforts. \n \nPrime Contractor(s):  TBD \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT\n&E -               11.1         -               14.7         -               6.0           \nProcure me nt -               -             -               -             1              268.1       \n   Total -               11.1         -               14.7         1              274.1       \nMedium Landing Ship\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \nMedium Landing Ship \nArtist Conception courtesy of HII"
    },
    {
      "page": 105,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nSpace Based Systems \n7-1 \nSpace Based and Related Systems \nSpace assets support deployed U.S. forces by providing communications services, navigation \ncapabilities, and information collected by remote sensors such as weather satellites and intelligence \ncollection systems.  Space forces contribute to the overall effectiveness of U.S. military forces by \nacting as a force multiplier that enhances combat power.  This investment addresses growing \nthreats, complicating an adversary’s ability to counter U.S. space superiority, while enhancing the \nDepartment’s ability to identify, characterize, and attribute all threatening actions in space.  The \ncapability to control space contributes to achieving information superiority and battle space \ndominance.  Procurement of launch vehicles and launch services are typically funded 2 years prior \nto launch.  Under existing budget policy, the first two satellites of a new system are financed with \nResearch, Development, Test and Evaluation (RDT&E) funding and the  remainder of follow-on \nsatellites are fully funded with Procurement funding. \nThe FY  2025 budget highlights include funding for development of new Resilient Missile \nWarning/Missile Tracking architectures, along with Next Generation Overhead Persistent Infrared \n(NG OPIR) space and associated ground architectures; continues funding for the Evolved Strategic \nSATCOM (ESS) and Protected Tactical, Wideband, and Narrowband secure/survivable/jam -\nresistant capabilities.  The budget also funds the procurement of two GPS III Follow-on satellites; \nseven National Security Space Launch (NSSL) launch s ervices for medium and heavy lift cla ss \nsatellites and four launches for Space Development Agency (SDA) proliferated Low Earth Orbit \nTransport Layer development. \nFY 2025 Space Based Systems Total:  $25.2 Billion \n \nNumbers may not add due to rounding \n$ in Billions \nAdvanced Component \nDevelopment\n$5.1\nTechnology \nDevelopment\n$0.2\nSystem \nDevelopment\n$5.6\nComm. & \nElectronics\n$0.5\nOperational System \nDevelopment\n$9.2\nSupport \nActivities\n$0.1\nManagement \nSupport\n$0.2\nSpace \nProcurement\n$4.3"
    },
    {
      "page": 106,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nSpace Based Systems \n7-2 \n \nThe Space Forces’ Launch Enterprise consists \nof the National Security Space Launch (NSSL) \nprogram and Rocket System Launch Program \n(RSLP).  NSSL provides highly reliable launch \nservices for medium and heavy lift class \nnational security satellites.  The RSLP provides \nprocurement of small launch and rideshare \nservices, suborbital targets and experimental \nflights, and restoration of excess ballistic \nmissile assets for reuse. \n  \n \nMission:  To be the Guardians of Assured Access -- Launching when and where the nation needs \nit. Launch Enterprise provides  highly reliable launch services and support under the NSSL \nprogram and launch services with tailorable mission assurance and support under the RSLP  for \nDoD, Intelligence Community, and other government agencies.  Maintains assured access to space \nfor the nation through the NSSL program , which includes a robust industrial base and three \naffordable and highly reliable families of launch vehicles.   \n \nFY 2025 Program:  Procures seven Space Force Launch Services (LS) using the competitively \nawarded NSSL Phase 3 contract and four Space Development Agency launch services.  Launches \nare usually ordered 24 months prior to the planned mission.  Funds Launch Service Support (LSS) \nefforts, which are non- discrete tasks necessary to support vital national security space launches \nwithout driving undue costs to commercial launch services.   \n \nPrime Contractor(s):   NSSL, RSLP:  SpaceX; Hawthorne, CA \n NSSL, RSLP:  United Launch Alliance (ULA); Centennial, CO \n RSLP:  Northrop Grumman; Corinne, UT \n RSLP:  Rocket Lab, USA; Long Beach, CA \n RSLP:  VOX Space; El Segundo, CA \n \n \n \n \n \n \n \n \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -              317.5      -              141.4      -              129.4      \nProcure me nt 10           1,987.5   15           2,861.7   11           2,268.4   \n   Total 10           2,305.0   15           3,003.1   11           2,397.8   \nLaunch Enterprise\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \n \nLaunch Enterprise \nDelta IV \nFalcon \nHeavy Falcon 9 Atlas V Vulcan \nPhotos courtesy of ULA and SpaceX"
    },
    {
      "page": 107,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nSpace Based Systems \n7-3 \n \nThe Global Positioning System (GPS) provides \nworld-wide, 24-hour a day, all-weather 3-dimensional \npositioning, navigation, and timing (PNT) \ninformation for military and civilian users.  The GPS \nIII space vehicles (SVs) will be fully backward \ncompatible with legacy signals while delivering new \ncapabilities and enhancements, to include a new \nGalileo-compatible signal (civilian) and a more \npowerful M -code (military) signal.  The GPS Next \nGeneration Operational Control System (OCX) will \nprovide command, control, and mission support for \nthe GPS constellation, including GPS III and all legacy satellites.  Further capabilities will be \nintroduced with GPS III Follow -on (IIIF), such as Regional Military Protection.  Military GPS \nUser Equipment (MGUE) provides secure and accurate PNT capabilities to warfighters for ground, \naircraft, ships, and weapons systems, enabling continued operations in the most contested \nenvironments. \n \nMission:  Provides worldwide PNT to military and civilian users.  \n \nFY 2025 Program:  Funds independent, technical, systems engineering and integration support \ncritical to managing SVs 08-10 storage, launch, and checkout activities, and the acquisition of GPS \nIIIF SVs 21 and 22 .  Funds continued development of the GPS IIIF SVs 11- 20.  Support s \ntransitioning of constellation operations from the legacy Operational Control Segment (OCS) to \nOCX.  Funds the testing and lead platform integration of MGUE Increment 1.  Funds development \nefforts for MGUE Increment 2 and design activities to address MGUE Increment 1 obsolescence.  \nFunds the GPS Program Office’s responsibility as the Prime Integrator (Enterprise Integration) to \nsynchronize space, control, and user segment programs and to manage civil/military specifications \nand requirements. \n \nPrime Contractor(s):   OCX, MGUE:  Raytheon Company; Aurora CO \n  GPS IIIF:  Lockheed Martin Corporation; Denver CO \n  MGUE:  BAE Systems; Cedar Rapids IA \n MGUE:  L3Harris; Anaheim CA \n OCX, MGUE:  Raytheon Company; El Segundo CA \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               919.4       -               980.1       -               762.0       \nProcure me nt 2              753.1       -               279.7       2              757.7       \n   Total 2              1,672.5    -               1,259.8    2              1,519.7    \nGlobal Positioning System Enterprise\nFY 2023 FY 2024 FY 2025\n \nNumbers may not add due to rounding \n \nGlobal Positioning System Enterprise \nImage courtesy of Lockheed Martin \nGPS IIIF"
    },
    {
      "page": 108,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nSpace Based Systems \n7-4 \n \nNext Generation Overhead Persistent Infrared \nProgram (OPIR) fields two Geosynchronous Earth \nOrbit (GEO), two Polar satellites in Highly Elliptical \nOrbit (HEO).  Resilient Missile Warning and Missile \nTracking (MW/MT) are devloping  to field 39 Low \nEarth Orbit (LEO), and up to nine Medium Earth Orbit \n(MEO) satellites.  These systems will rapidly deliver \nstrategically survivable missile warning capabilities, which detect advances made in adversarial \nmissile technology and addresses counter-space systems with added resiliency features.  Resilient \nMW/MT offers coverage of all phases of missile warning and tracking of advanced missile threats, \nincluding hypersonic missile systems. \n• SBIRS HEO payloads 01-04 and GEO space vehicles (SV) 01-06 are on orbit and operationally \naccepted; SV 06 launched 4 Aug 2022 and was operationally accepted on March 2023. \n• Next-Gen OPIR will launch four satellites:  Two GEO with target launch dates of 2025 and \n2027; and two Polar free-flyer satellites in HEO with target dates of 2028 and 2030. \n• Future Operationally Resilient Ground Evolution (FORGE) program delivers a cyber-resilient, \ngovernment owned ground system that w ill supports SBIRS,Next-Gen OPIR and Resilient \nMW/MT. \n• SBIRS Survivable Endurable Evolution (S2E2) upgrades current mobile ground systems to \nSBIRS GEO capability to meet survivable, endurable missile warning requirements. \n• Resilient MW/MT develops proliferated constellations to provide additional coverage for all \nphases of missile warning, missile tracking, and fire control capability. \n \nMission:  Provides warning and tracking of strategic missile attack on the United States, its \ndeployed forces, and its allies.  Supports missile defense, battlespace awareness, and technical \nintelligence. \n \nFY 2025 Program:  Funds continue development of Next -Gen OPIR satellites and the FORGE \nground system development.  Also f unds development of Resilient MW/MT LEO and MEO; \nlaunch of LEO constellation begins in FY 2025. \n \nPrime Contractor(s):  Next-Gen GEO:  Lockheed Martin; Sunnyvale, CA \n  Next-Gen Polar:  Northrop Grumman; Redondo Beach, CA \n  Missile Warning, FORGE:  Raytheon; Aurora, CO \n  Resilient MW/MT: Multiple competitive contractors \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -                4,573.1     -                4,927.0     -                4,677.8     \nProcurement -                149.0        -                39.4          -                -              \n   Total -                4,722.1     -                4,966.4     -                4,677.8     \nSpace Based Missile Warning Systems\nFY 2023 FY 2024 FY 2025\n \n  Numbers may not add due to rounding \nImage courtesy of Lockheed Martin \nSpace Based Missile Warning Systems"
    },
    {
      "page": 109,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nSpace Based Systems \n7-5 \n \nThe Space Force bins SATCOM in three capability sets: \n1. Strategic – for Nuclear Command, Control, and Comms \n• Evolved Strategic SATCOM (ESS) - Plans prototypes \nfor next-generation strategic constellation. \n• Strategic SATCOM Terminals - Provides secure/ \nsurvivable/jam-resistant capabilities. \n2. Protected Tactical – to enable tactical communications \ncapabilities in contested environments \n• Enhanced Polar System -Recapitalization (EPS -R) Acquires two hosted payloads for \nSATCOM in the North Polar Region as part of a partnership with Norway. \n• Protected Tactical Enterprise Service (PTES) - Develops the ground infrastructure to provide \nresilient SATCOM capabilities over existing military and commercial SATCOM systems \nand enables the future use of the Protected Tactical SATCOM (PTS) system. \n• PTS - A genus of satellites that provides users the ability to obtain communications services \nin contested environments. \n3. Wideband and Narrowband – to provide voice and data services in less contested areas \n• Wideband Global SATCOM (WGS)  - WGS Satelite Vehicle ( SV) 1- 10 are operational. \nDelivers WGS SV 11 and 12, with greater capacity than WGS SV 10;  projected available \nfor launch in FY 2025 and 2027, respectively. Enhances the legacy WGS ground system to \nsupport WGS SV 11 and 12 capabilities. \n• Mobile User Objective System (MUOS)  - Acquires two additional satellites to extend  the \nuse of the Wideband Code Division Multiple Access waveform. \n \nMission:  Provides worldwide secure voice, video, and data communications for DoD users. \n \nFY 2025 Program:   Funds continue selected SATCOM development activities. Initiates PTS \nprototype payload launch vehicle integration and PTS  Engineerin g and Manufacturing \nDevelopment (EMD) phase for the new purpose-built high-throughput anti-jam satellite system. \n \n \n \nPrime Contractor(s):  ESS, PTS, PTES, WGS:  Boeing Satellite Systems; El Segundo, CA \n  ESS, PTS, EPS-R, WGS:  Northrop Grumman; Redondo Beach, CA \n  MUOS SLE:  Up to 2 contractors TBD \n  MUOS Ground:  General Dynamics; Scottsdale, AZ \n  Strategic SATCOM Terminals: Raytheon; Malborough, MA  \n \n \n \n \n \nQty $M Qty $M Qty $M\nRDT&E -               2,185.9    -               3,673.7    -               3,793.4    \nProcure me nt -               600.7       -               355.1       -               409.6       \n   Total -               2,786.5    -               4,028.8    -               4,203.0    \nSatellite Communications (SATCOM) Projects\nFY 2023 FY 2024 FY 2025\n \nNumbers in table reflect AF/SF programs and may not add due to rounding \n \nImage courtesy of Northrop Grumman \nSatellite Communications (SATCOM) Projects"
    },
    {
      "page": 110,
      "text": "FY 2025 Program Acquisition Costs by Weapon System \nThis page intentionally left blank."
    },
    {
      "page": 111,
      "text": ""
    },
    {
      "page": 112,
      "text": "defense.gov"
    }
  ]
}