{
  "filename": "gao-25-107491.pdf",
  "total_pages": 61,
  "pages": [
    {
      "page": 1,
      "text": "ARMY \nMODERNIZATION \nAir and Missile \nDefense Efforts Would \nBenefit from Applying \nLeading Practices \nReport to Congressional Committees\nJune 2025 \nGAO-25-107491 \nReissued with a revision on June 18, 2025, to correct the figure title \non the Highlights page. \nUnited States Government Accountability Office"
    },
    {
      "page": 2,
      "text": "United States Government Accountability Office \n  \nHighlights \nHighlights of GAO-25-107491, a report to \ncongressional committees \n \nJune 2025 \nARMY MODERNIZATION \nAir and Missile Defense Efforts Would Benefit from \nApplying Leading Practices \nWhat GAO Found \nThe Army’s air and missile defense mission is to protect soldiers, equipment, and \nfacilities from air and missile threats, such as cruise missiles and rockets. These \nare capabilities that near-peer competitors, such as Russia and China, have \ninvested in. To address these threats, the Army is pursuing multiple efforts to \nmodernize its air and missile defense capabilities. \nArmy Futures Command is responsible for developing requirements for future \nArmy systems. It identified four capabilities that the Army needs and developed \nrequirements to meet those needs. For example, the Army developed \nrequirements for a short-range air defense system, the Sgt. Stout. \nManeuver-Short Range Air Defense Sgt. Stout    \n \n \nSince 2021, the Army has identified seven air and missile defense efforts to \ndevelop and acquire needed capabilities and increased its requests in the \nPresident’s Budget to support them. For example, the Army’s requests for the \nefforts increased from $8.8 billion to $11.8 billion from fiscal years 2021 through \n2025. The Army also chose acquisition pathways intended to speed \ndevelopment, production, and delivery of capabilities for most efforts. \nThe Army’s development of the seven modernization efforts did not fully apply \nleading practices for product development. Most efforts use 3D modeling and \nsimulation, in which a static representation of a product is tested with predefined \ndata to understand how it will function in a specific situation. In contrast, leading \ncompanies use modern design tools like digital twins (dynamic virtual \nrepresentations of products) and digital threads (common information sources) \nearly and as part of an iterative development approach. Digital twins can enable \ndesign updates in real time. Digital threads connect stakeholders with real-time \ndata across the product life-cycle to help inform decisions. \nFully using these tools can provide efficiencies, such as the ability to anticipate \npotential design flaws and reduce costs. Assessing the benefits and affordability \nof using these modern design tools can better position the Army to more quickly \nchange designs than is possible with 3D modeling and simulations alone, \nspeeding the delivery of capability to the soldier. \nFor more information, contact Mona Sehgal at \nsehgalm@gao.gov. \nWhy GAO Did This Study \nSince 2018, the Army has focused on \nmodernizing its air and missile defense \nsystems to counter those of near-peer \ncompetitors. \nA Senate report and the House report \naccompanying the National Defense \nAuthorization Act for Fiscal Year 2024 \ninclude provisions for GAO to review \nand assess the Army’s air and missile \ndefense modernization efforts. GAO’s \nreport (1) describes how the Army \ndeveloped the requirements to \nmodernize these efforts; (2) describes \nhow the Army is acquiring the systems; \nand (3) assesses the extent to which \nthe Army applied leading practices for \nproduct development to these efforts. \nGAO reviewed the Army’s processes \nfor identifying capability needs and \ndeveloping requirements for air and \nmissile defense efforts. GAO also \nreviewed the Army’s acquisition \napproaches, analyzed its President’s \nBudget requests since fiscal year \n2021, and assessed the efforts against \nleading practices for product \ndevelopment that GAO identified in \nprior work. GAO interviewed officials \nfrom Army requirements and program \noffices and the Department of Defense. \nWhat GAO Recommends \nGAO is making six recommendations, \nincluding that the Army should \nimplement an iterative product \ndevelopment approach, and assess \nthe benefits and affordability of \nimplementing modern design tools for \nits air and missile defense efforts. DOD \nconcurred with these \nrecommendations."
    },
    {
      "page": 3,
      "text": "Page i GAO-25-107491  Army Modernization \nLetter  1 \nBackground 3 \nArmy Futures Command Identified Capability Needs for Air and \nMissile Defense and Developed Capabilities to Address Them 12 \nArmy Prioritized Rapid Development and Fielding of Air and \nMissile Defense Capabilities, Increasing Its Budget Requests, \nbut Has Had Limited Success 17 \nThe Army Did Not Consistently Apply Leading Practices, Including \nModern Design Tools, For Air and Missile Defense \nModernization Efforts 35\n \nConclusions 45 \nRecommendations for Executive Action 45 \nAgency Comments 46 \nAppendix I Objectives, Scope, and Methodology 48 \n \nAppendix II Comments from the Department of Defense 52 \n \nAppendix III GAO Contact and Staff Acknowledgments 55 \n \nTable \nTable 1: Characteristics of Key Modern Design Tools 42 \n \nFigures \nFigure 1: Selected Department of Defense Adaptive Acquisition \nFramework Pathways 8 \nFigure 2: Acquisition Pathways and Oversight Offices for Selected \nAir and Missile Defense Modernization Efforts 18 \nFigure 3: Integrated Battle Command System Selected Events \nTimeline 20 \nFigure 4: Maneuver-Short Range Air Defense Sgt. Stout Selected \nEvents Timeline 23 \nFigure 5: Maneuver-Short Range Air Defense Next Generation \nShort Range Interceptor Selected Events Timeline 24 \nFigure 6: Directed Energy Maneuver-Short Range Air Defense \nSelected Events Timeline 25 \nContents"
    },
    {
      "page": 4,
      "text": "Page ii GAO-25-107491  Army Modernization \nFigure 7: Indirect Fire Protection Capability Increment 2 Selected \nEvents Timeline 27 \nFigure 8: Indirect Fire Protection Capability High Energy Laser \nSelected Events Timeline 29 \nFigure 9: Indirect Fire Protection Capability High Power \nMicrowave Selected Events Timeline 30 \nFigure 10: Lower Tier Air and Missile Defense Sensor Selected \nEvents Timeline 31 \nFigure 11: Counter-small Unmanned Aircraft Systems (C-sUAS) \nFormal Acquisition Programs 33 \nFigure 12: Comparison of Linear and Iterative Development \nApproaches 36"
    },
    {
      "page": 5,
      "text": "Page iii GAO-25-107491  Army Modernization \n \nAbbreviations \n \nA-CDD Abbreviated Capabilities Development Document \nAFC Army Futures Command \nCDD Capabilities Development Document \nCDID Capabilities Development and Integration Directorate \nCFT cross-functional team \nC-sUAS Counter-small Unmanned Aircraft Systems \nDE directed energy \nDOD Department of Defense \nFAR Federal Acquisition Regulation \nFoCUS Family of Counter-Unmanned Aircraft Systems \nFS-LIDS Fixed Site Low, slow, small Unmanned Aircraft System \nIntegrated Defeat System \nFY fiscal year \nHEL high energy laser \nHPM high power microwave \nIBCS Integrated Battle Command System \nIFPC Indirect Fire Protection Capability \nLTAMDS Lower Tier Air and Missile Defense Sensor \nMCA major capability acquisition \nM-LIDS Mobile Low, slow, small Unmanned Aircraft System \nIntegrated Defeat System \nM-SHORAD Maneuver-Short Range Air Defense \nMTA middle tier of acquisition \nNGSRI Next Generation Short Range Interceptor \nPEO MS Program Executive Office Missiles and Space \nRCCTO Rapid Capabilities and Critical Technologies Office \nRF rapid fielding \nRP rapid prototyping \nThis is a work of the U.S. government and is not subject to copyright protection in the \nUnited States. The published product may be reproduced and distributed in its entirety \nwithout further permission from GAO. However, because this work may contain \ncopyrighted images or other material, permission from the copyright holder may be \nnecessary if you wish to reproduce this material separately."
    },
    {
      "page": 6,
      "text": "Page 1 GAO-25-107491  Army Modernization \n441 G St. N.W. \nWashington, DC 20548 \nJune 17, 2025 \nCongressional Committees \nFor over 20 years, the Army prioritized counterinsurgency operations in \nthe Middle East, resulting in limited investment in air and missile defense \ncapabilities. Today, the Army’s air and missile defense capabilities are \nchallenged by a wide array of current and emerging air and missile \nthreats from near-peer competitors, notably China and Russia, which \nhave invested in a range of air and missile capabilities. This near-peer \ncompetitive advantage endangers U.S. military personnel, equipment, \nand facilities as well as the Army’s success on the battlefield. As a result, \nthe Army is pursuing multiple efforts to modernize its air and missile \ndefense capabilities to effectively deter or engage and defeat adversaries \non the battlefield. \nA Senate report and the House report accompanying the National \nDefense Authorization Act for Fiscal Year 2024 include provisions for us \nto review and assess the Army’s air and missile defense modernization \nefforts.\n1 Our report (1) describes how the Army developed the \nrequirements to support its modernization of air and missile defense \nprograms and efforts; (2) describes how the Army is acquiring the \nsystems to modernize its air and missile defense programs and efforts; \nand (3) assesses the extent to which the Army applied leading practices \nfor product development for its air and missile defense modernization \nprograms and efforts. \nFor the first objective, we reviewed the Army’s requirements process and \napplicable documents, such as directed requirements, abbreviated \ncapabilities development documents, and capabilities development \ndocuments. This allowed us to understand how the Army identified the \nrequired capabilities it needed and developed the requirements for \nsystems in development. Our review of documents included Army studies \nthat informed the modernization efforts. \nFor the second objective, we reviewed the Army’s acquisition approaches \nfor systems identified in its 2021 Modernization Strategy and for Counter-\nsmall Unmanned Aircraft Systems. We focused on the 2021 \n \n1S. Rep. No. 118-58, at 18 (2023); H. Rep. No. 118-125 at 6 (2023); and National Defense \nAuthorization Act for Fiscal Year 2024, Pub. L. 118-31 (2023). \nLetter"
    },
    {
      "page": 7,
      "text": "Page 2 GAO-25-107491  Army Modernization \nModernization Strategy for our review because Army officials said it \nidentified the Army’s 35 signature modernization efforts, six of which were \nfor air and missile defense. We also focused on Counter-small Unmanned \nAircraft System for our review, which Army officials told us the department \nadded as a modernization effort in 2022. We reviewed acquisition plans, \nprogram status updates, and changes to Army requests in the President’s \nBudget and associated schedules since fiscal year 2021. \nFor the third objective, we assessed whether each air and missile \ndefense effort’s development approach was iterative or linear and \ndiscussed our applicable leading practices for product development for \neach effort.2 To identify the development approach for each air and \nmissile defense modernization effort, we reviewed Army documentation \nand interviewed Army officials from each effort as well as Army Futures \nCommand and the Army Rapid Capabilities and Critical Technologies \nOffice. To determine the extent to which the Army applied leading \npractices for product development, we reviewed documents provided by \nthe Army and interviewed officials from the five offices overseeing \ndevelopment of the efforts. \nFor each of the objectives, in addition to the documentary evidence that \nwe analyzed by objective above, we conducted interviews with \nDepartment of Defense (DOD) and Army officials on the Army’s air and \nmissile defense requirements process, acquisition efforts, the President’s \nBudget requests, and use of leading practices for product development. \nWe conducted in-person interviews with air and missile defense \nrequirements and program offices at Fort Sill, Oklahoma, and Redstone \nArsenal, Alabama, the only two offices that provide such support. \nAppendix I further describes our objectives, scope, and methodology. \nWe conducted this performance audit from March 2024 to June 2025 in \naccordance with generally accepted government auditing standards. \nThose standards require that we plan and perform the audit to obtain \nsufficient, appropriate evidence to provide a reasonable basis for our \nfindings and conclusions based on our audit objectives. We believe that \nthe evidence obtained provides a reasonable basis for our findings and \nconclusions based on our audit objectives. \n \n2GAO, Leading Practices: Iterative Cycles Enable Rapid Delivery of Complex, Innovative \nProducts, GAO-23-106222 (Washington, D.C.: July 27, 2023); and Leading Practices: \nAgency Acquisition Policies Could Better Implement Key Product Development Principles, \nGAO-22-104513 (Washington, D.C.: Mar. 10, 2022)."
    },
    {
      "page": 8,
      "text": "Page 3 GAO-25-107491  Army Modernization \n \nFrom 2001 to 2023, the Army focused its military operations on fighting \ninsurgents on the ground in Iraq and Afghanistan. According to a 2020 \nCongressional Research Service report, due to the Army’s reliance on the \nAir Force to provide air superiority over the battlefield to protect ground \nforces from aerial attacks, the Army limited its investments in air and \nmissile defense capabilities. This contributed to a degradation in such \ncapabilities.\n3 The 2018 National Defense Strategy shifted military \nplanning and operations from counterinsurgency to large-scale combat \noperations against near-peer adversaries.\n4 As a result, the Army began a \ncampaign to modernize its major weapon systems with new capabilities to \nsupport its new warfighting concept of multi-domain operations.\n5 \nAccording to the Army Air and Missile Defense Vision 2028, air and \nmissile defense is vital to the Army’s ability to conduct multi-domain \noperations.6 Air and missile defense’s mission is to protect the Army’s \nforces and critical assets, among other things, from air and missile threats \nsuch as cruise missiles, rockets, fixed and rotary wing aircrafts, and \nuncrewed aircraft systems or drones. The Army notes that employing a \nmix of capabilities creates a layered defense system to achieve the best \nresults when responding to threats. \nThe 2021 Army Modernization Strategy (hereafter the “Modernization \nStrategy”) identified the modernization of air and missile defense as one \n \n3Congressional Research Service, U.S. Army Short-Range Air Defense Force Structure \nand Selected Programs: Background and Issues for Congress, July 23, 2020. \n4Department of Defense, Summary of the 2018 National Defense Strategy of the United \nStates of America: Sharpening the American Military’s Competitive Edge (Jan. 19, 2018). \n5The multi-domain operations concept centers on presenting adversaries with multiple \nchallenges through the combination of capabilities across land, air, sea, cyber, and space \nsimultaneously. The Army plans to have a multi-domain operations-capable force in a \nsingle theater by 2028. A domain is an area of activity within the operating environment in \nwhich operations are organized and conducted. For example, the Army recognizes five \ndomains: land, air, sea, cyber, and space. See GAO, Future Warfare: Army Is Preparing \nfor Cyber and Electronic Warfare Threats, but Needs to Fully Assess the Staffing, \nEquipping, and Training of New Organizations, GAO-19-570 (Washington, D.C.: Aug 15, \n2019). \n6Department of the Army, U.S. Army Space and Missile Defense Command, Army Air and \nMissile Defense 2028 March 2019. \nBackground \nArmy Air and Missile \nDefense Modernization"
    },
    {
      "page": 9,
      "text": "Page 4 GAO-25-107491  Army Modernization \nof its six overall priorities for development and procurement.7 The \nModernization Strategy further identified six signature air and missile \ndefense modernization efforts:8 \n• Integrated Battle Command System (IBCS) is a software-based fire \ncontrol system that links sensors and weapons to form an integrated \nfire control network. This system is the primary development effort \nunder the Army’s Integrated Air and Missile Defense concept. \n• Maneuver-Short Range Air Defense (M-SHORAD) is a family of \nsystems mounted onto Stryker combat vehicles. Increment 1 (Sgt. \nStout) includes a suite of weapons, including Stinger missiles and a \n30-millimeter automatic cannon.9 Increment 3 (Next Generation Short \nRange Interceptor or NGSRI) will replace the Stinger missiles on Sgt. \nStout with new missiles that are intended to be mounted and soldier-\nportable as well as new 30-millimeter ammunition. Future increments \nwill include the use of vehicles other than Stryker. \n• Directed Energy (DE) M-SHORAD (Increment 2) incorporates a 50 \nkilowatt-class laser onto a Stryker combat vehicle in place of the \nmissiles and cannon on Sgt. Stout. DE M-SHORAD is one increment \nof the M-SHORAD family of systems. \n• Indirect Fire Protection Capability (IFPC) Increment 2 is a mobile, \nground-based weapon system with missiles that integrates with an \nexisting sensor and IBCS.10 \n• IFPC High Energy Laser (HEL) and High Power Microwave (HPM) \nuse a 300 kilowatt-class laser and a high-power microwave, \n \n7See U.S. Army, Army Modernization Strategy: Investing in the Future (2021). The Army’s \nstated order of importance of the six modernization priorities are: Long Range Precision \nFires, Next Generation Combat Vehicles, Future Vertical Lift, Army Network, Air and \nMissile Defense, and Soldier Lethality. The priorities consist of 35 efforts to develop \ntechnologically advanced new equipment and upgrades to existing systems.  \n8When fielding capabilities such as air and missile defense, the Army also develops the \ndoctrine, training, personnel, facilities and other “planning elements” necessary to support \nthe capability. In 2024, we recommended that the Army adjust its planning element \nprocess. The Army concurred with our recommendation but as of February 2025, had not \nyet implemented it. See GAO, Army Modernization: Actions Needed to Support Fielding \nNew Equipment, GAO-24-107566 (Washington, D.C.: July 15, 2024). \n9The Army renamed M-SHORAD Increment 1 to “Sgt. Stout” in June 2024 to honor \nVietnam War hero Sgt. Mitchell William Stout, an Army air defense soldier who earned the \nCongressional Medal of Honor. \n10According to Army officials, the Indirect Fire Protection Capability is also known as the \nIntegrated Fire Protection Capability."
    },
    {
      "page": 10,
      "text": "Page 5 GAO-25-107491  Army Modernization \nrespectively. While these systems are referred to as IFPC, these \nvariants are a separate development effort from IFPC Increment 2. \n• Lower Tier Air and Missile Defense Sensor (LTAMDS) is a \nmultifunction, 360-degree radar that will replace the current Patriot \nradar.  \nIn addition to the six air and missile defense efforts identified in the \nModernization Strategy, Army officials told us that the department \nsubsequently identified Counter-small Unmanned Aircraft Systems (C-\nsUAS) as an additional air and missile defense capability. According to \nofficials, in 2022, the Army added C-sUAS to the air and missile \nmodernization portfolio. C-sUAS systems offer a variety of threat defeat \ncapabilities, including radars, kinetic weapons, and electronic warfare \ntechnology. The Army is pursuing six C-sUAS formal acquisition \nprograms, as well as numerous other C-sUAS systems that have been \ndeployed or are in prototyping.\n11 \nThe six C-sUAS formal acquisition programs are: \n• Fixed Site Low, slow, small Unmanned Aircraft System Integrated \nDefeat System (FS-LIDS), \n• Mobile Low, slow, small Unmanned Aircraft System Integrated Defeat \nSystem (M-LIDS), \n• Coyote Launchers and Interceptors (Coyote), \n• Ku-Band Radio Frequency System Family of Radars, \n• Handheld/Dismounted C-sUAS Systems for use by individual soldiers, \nand \n• Family of Counter-UAS Systems. \n \nThe Army must define and validate requirements before acquiring a \nmateriel solution such as a radar or missile. Requirements describe the \ncapability to be achieved using operational performance attributes—\ntestable and measurable characteristics—to design a system intended to \naddress identified capability needs.  \n \n11A formal acquisition program is a designated and structured effort managed in \naccordance with DOD acquisition policies, procedures, and funding requirements \nestablished by regulations and statute.   \nArmy Requirements and \nAcquisition Processes"
    },
    {
      "page": 11,
      "text": "Page 6 GAO-25-107491  Army Modernization \nDepending on the acquisition strategy, the Army may choose to create a \nmore flexible, less formalized set of desired capabilities and use \nprototypes and testing to refine the capabilities into formal requirements. \nThese desired capabilities can be documented in an Abbreviated \nCapabilities Development Document (A-CDD) at a high-level. The A-CDD \nis reviewed and approved by the Army Requirements Oversight Council, \nwhich includes the Army’s civilian and military leadership. The Army uses \nA-CDDs to facilitate rapid prototyping and to help inform and develop \nrequirements before finalizing them. The Army documents specific key \nperformance parameters and key system attributes that a proposed \nmateriel solution must meet in a Capabilities Development Document.\n12 \nThe CDD is reviewed and validated by DOD’s chief military officers \nthrough the Joint Requirements Oversight Council.13 CDDs are required \nfor acquisition programs on the major capability acquisition pathway.14 \nIn January 2020, DOD established the Adaptive Acquisition Framework.15 \nThe framework emphasizes several principles that include simplifying \nacquisition policy, tailoring acquisition approaches, and conducting data-\ndriven analysis. The Adaptive Acquisition Framework includes six \nacquisition pathways that have distinct processes for pathway decision \nevents, cost and schedule goals, and documentation. The four pathways \nthat the Army used for its air and missile defense modernization efforts \nare as follows:16 \n \n12Key performance parameters are measurable parameters that define the critical \nperformance of a proposed system. Key system attributes are measurable attributes that \ndefine important performance characteristics of the proposed system.  \n13Chairman of the Joint Chiefs of Staff Instruction, Charter of the Joint Requirements \nOversight Council (JROC) and Implementation of the Joint Capabilities Integration and \nDevelopment System (JCIDS) CJCSI 5123.01I (Washington, D.C.: Oct. 30, 2021). \n14 Department of Defense, Major Capability Acquisition, DOD Instruction 5000.85, (Aug. 6, \n2020).  \n15Department of Defense, The Defense Acquisition System, DOD Directive 5000.01 (July \n28, 2022); and Operation of the Adaptive Acquisition Framework, DOD Instruction \n5000.02 (Jan. 23, 2020).  \n16The other two acquisition pathways not included in this report are Defense Business \nSystems and Defense Acquisition of Services."
    },
    {
      "page": 12,
      "text": "Page 7 GAO-25-107491  Army Modernization \n• Urgent Capability Acquisition pathway is intended to field capabilities \nto fulfill urgent existing and/or emerging operational needs or quick \nreactions in less than 2 years.17 \n• Middle Tier of Acquisition (MTA) includes two expedited pathways. \nThe first path, rapid prototyping, is intended to quickly develop and \ndemonstrate a capability in an operational environment within 5 years. \nRapid prototyping also results in materiel that a military department \ncan field to the soldier as an interim capability solution. The second \npath, rapid fielding, is intended to begin production of a new or \nupgraded capability within 6 months, and complete fielding of that \ncapability within 5 years.18 Acquisitions using the MTA pathway are \ngenerally not subject to the same DOD acquisition and requirements \nprocesses as those on the major capability acquisition pathway. \n• Major Capability Acquisition (MCA) pathway leads complex \nacquisitions through phases, such as technology development, \nsystem development, and production. DOD separates these phases \nby major reviews known as milestone decisions.19 \n• Software Acquisition pathway is intended to facilitate rapid and \niterative delivery of software capability, including software-intensive \nsystems, to users.20 \n \n17Department of Defense, Urgent Capability Acquisition, DOD Instruction 5000.81 (Dec. \n31, 2019). \n18For programs using the MTA pathway, the start date (and thus the date from which the \n5-year time frame is measured) for programs designated on or after December 30, 2019, \nis generally the date that an acquisition decision memorandum was signed initiating an \nMTA rapid prototyping or rapid fielding program. MTA programs designated before \nDecember 30, 2019, and certain programs designated after this date, generally maintain \ntheir MTA program start date as the date funding was first obligated. See Department of \nDefense, Operation of the Middle Tier of Acquisition, DOD Instruction 5000.80 (Dec. 30, \n2019). \n19Major defense acquisition programs generally include those programs that are either (1) \ndesignated by the Secretary of Defense as a major defense acquisition program; or (2) \nestimated to require an eventual total expenditure for research, development, test, and \nevaluation, including all planned increments or spirals, of more than $525 million in fiscal \nyear 2020 constant dollars or, for procurement, including all planned increments or spirals, \nof more than $3.065 billion in fiscal year 2020 constant dollars. See 10 U.S.C. § 4201(a). \nDOD Instruction 5000.85 (reflecting statutory major defense acquisition program cost \nthresholds in fiscal year 2020 constant dollars). Certain programs that meet these \nthresholds, including programs using the MTA pathway, are not considered major defense \nacquisition programs. See 10 U.S.C. § 4201(b). \n20Department of Defense, Operation of the Software Acquisition Pathway, DOD \nInstruction 5000.87 (Oct. 2, 2020)."
    },
    {
      "page": 13,
      "text": "Page 8 GAO-25-107491  Army Modernization \nFigure 1 shows selected Adaptive Acquisition Framework pathways the \nArmy has or is using for air and missile defense efforts. \nFigure 1: Selected Department of Defense Adaptive Acquisition Framework Pathways \n \n \nThe military departments can also transition efforts from one pathway to \nanother. For example, DOD’s MTA policy states that military departments \nwill develop a process for transitioning successful prototypes from the \nrapid prototyping pathway to new or existing programs for production, \nfielding, and operations and sustainment under the rapid fielding pathway \nor another acquisition pathway. Military departments can also cancel an \nMTA effort that has not progressed as expected. \nMultiple Army organizations have responsibility for activities associated \nwith the acquisition of air and missile defense systems:"
    },
    {
      "page": 14,
      "text": "Page 9 GAO-25-107491  Army Modernization \n• The Office of the Assistant Secretary of the Army for \nAcquisitions, Logistics, and Technology is the support \norganization for materiel acquisition and is responsible for the delivery \nof modernization efforts to the soldier. This organization is the civilian \nauthority responsible for overseeing all Army acquisition functions and \ncan serve as the milestone decision authority. This office oversees 12 \nprogram executive offices that acquire different types of systems or \nequipment across the Army, including air and missile defense \nsystems. \n• Program Executive Office Missiles and Space is responsible \nfor overseeing the air and missile defense portfolio of acquisition \nprograms, among others, and delivering a suite of capabilities to \nsoldiers. \n• Army Futures Command (AFC) was established in 2018 to develop \nrequirements and technologies for future Army systems. AFC \ndetermines the capabilities required for these acquisitions through \norganizations such as: \n• Air and Missile Defense Cross-Functional Team (CFT) has \nlead responsibility for developing requirements to address Army \nair and missile defense capability needs. The Army established \nthe air and missile defense CFT in 2017 to better support the \nrequirements process for air and missile defense. The air and \nmissile defense CFT includes stakeholders from the requirements, \nacquisitions, and user communities, among others, to coordinate \nrequirements development. \n• Fires Capabilities Development Integration Directorate (Fires \nCDID) also has responsibility for developing requirements to \naddress Army air and missile defense capability needs and works \nclosely with the air and missile defense CFT. Fires CDID \ndeveloped related concepts, requirements and experimentation. It \ncoordinates operational units input during requirements \ndevelopment and prototyping. In addition, the Fires CDID includes \nan Army Capability Manager who represents the interests of the \noperational units and collaborates with them to identify issues and \nsolutions. \n• The Research and Analysis Center is responsible for conducting \nstudies and testing for the Army’s air and missile defense \nmodernization efforts. \n• The Army Rapid Capabilities and Critical Technologies Office \n(RCCTO) is responsible for maturing technologies to develop \nprototypes, which help to refine requirements before efforts transition"
    },
    {
      "page": 15,
      "text": "Page 10 GAO-25-107491  Army Modernization \nto acquisition program offices. For example, this office is responsible \nfor development of directed energy efforts. RCCTO reports directly to \na board of directors led by the Secretary of the Army and includes the \nChief of Staff of the Army, Under Secretary of the Army, Vice Chief of \nStaff of the Army, Army Acquisition Executive, and the Commanding \nGeneral of AFC. It also uses separate prototyping and contracting \nauthorities to facilitate its efforts outside of traditional acquisition \npathways. \n \nWe have identified leading practices for iterative product development \nthat are based on practices used by leading companies to develop \ncomplex, innovative products.21 Leading companies use iterative \nprocesses to design, validate, and deliver complex products with speed. \nThis iterative process involves continuous cycles of design modeling and \nsimulation, validation, and production through which companies rapidly \ndevelop and deliver products that provide essential capabilities that users \nneed. These iterative cycles include activities such as: \n• Attain and maintain a sound business case. Leading companies \nincrease knowledge about a product’s capabilities and design \ncharacteristics through each iterative cycle. In doing so, leading \ncompanies conduct market research and obtain and use customer \nfeedback to establish and then continually maintain a sound business \ncase throughout development. When initiating development of a \nproduct, leading companies do not start with a business case that \nincludes a detailed specification of requirements, which typically \ninform traditional linear development such as that generally pursued \nunder DOD’s major acquisition contracts. This linear approach has \nfixed operational requirements needed to deliver a capability to meet \npredetermined performance criteria. Instead, leading companies begin \nproduct development with a high-level need statement or idea to \nprovide flexibility to demonstrate what capabilities are possible within \nthe effort’s cost and schedule constraints. Throughout development, \nthis high-level need is progressively refined into distinct requirements \nbased on the demonstrated performance of product prototypes. \n• Identify a minimum viable product. Leading companies identify a \nminimum viable product—a product with the minimum capabilities \nneeded for customers to recognize value and that can be followed by \nsuccessive updates. Companies arrive at a producible, minimum \nviable product once product developers, manufacturers, and users \n \n21GAO-23-106222 and GAO-22-104513. \nLeading Practices for \nProduct Development"
    },
    {
      "page": 16,
      "text": "Page 11 GAO-25-107491  Army Modernization \nhave agreed that the product meets essential needs and can be \nproduced within the cost and schedule allotted. Such determination \nconcludes the end of the validation cycle. This means it is rooted in \nactual demonstration and knowledge rather than forecasted through \nrequirements imposed at the start of product development. Leading \ncompanies also enable the initial business case to evolve over the \ncourse of product development as well as connect the business case \nto research and development. This means that research and \ndevelopment for a specific product does not end with the product—it \ncontinues so that future iterations of the product will have new, \ninnovative, and mature technologies available. \n• Obtain stakeholder and end user feedback. Leading companies \nseek and obtain continuous stakeholder and end user feedback—\nfeedback from the actual operators of the product—throughout the \niterative cycles. These companies capture this feedback to ensure the \nproduct under development is relevant and responsive to evolving \nuser needs. Inputs from users directly inform and underpin \nachievement of a producible minimum viable product as well as \nsuccessive improvements to that product in future iterations. \n• Prioritize schedule by off-ramping capabilities when necessary. \nTo achieve speed to market, leading companies prioritize developing \na minimum viable product by removing capabilities that pose a risk to \ndelivering the product on schedule. The off-ramped capabilities can \nbe deferred to a later release or terminated. \n• Use of modern design tools. Leading companies use modern \ndesign tools, including 3D modeling and simulation, digital twins—\nvirtual representations of physical products—and digital threads. \nDigital twins incorporate dynamic data of a physical object or a \nsystem—meaning the model changes and updates in real time as \nnew information becomes available. Digital twins differ from 3D \nmodels, which are static visualizations that are updated manually, and \nare essentially paper design drawings in digital form. Digital threads \nare a common source of information that connect stakeholders with \nreal time data across the product life cycle. Digital threads are the \nstarting point for subsequent iterations of the product. Leading \ncompanies use digital twins and digital threads early in product \ndevelopment to reduce risks related to manufacturing and production \nthat can delay product delivery."
    },
    {
      "page": 17,
      "text": "Page 12 GAO-25-107491  Army Modernization \n \n \n \n \n \n \n \nThe Army identified and prioritized four capability needs through a \ncapability determination process. The Army identified these needs by \ncomparing its current air and missile defense capabilities, how the Army \nintended to use these capabilities to deter or engage in conflict, and the \nthreats posed by the capabilities of near-peer competitors and other \nadversaries.  \nFor air and missile defense, this process identified four capability needs \nfor which the Army decided to develop materiel solutions.\n22 These \ninclude: \n• Protection for maneuver formations against aerial threats such as \nuncrewed aircraft systems, fixed and rotary wing aircrafts, and \nrockets, mortars, and artillery. \n• Protection for critical fixed and semi-fixed assets (e.g., air bases and \nmission command posts) against aerial threats such as cruise \nmissiles, uncrewed aircraft systems, rockets, artillery, and mortars \nand fixed and rotary wing aircrafts. \n• A common mission command-control system that connects sensors \nand shooters to enable a layered defense against complex, integrated \naerial attacks. \n• A radar with improved sensor capability integrated into a common \nmission command system to provide greater coverage and range than \ncurrent radar systems. \n \n \n22A capability need may also be addressed by non-materiel solutions, such as changes to \ndoctrine, organization, or training.  \nArmy Futures \nCommand Identified \nCapability Needs for \nAir and Missile \nDefense and \nDeveloped \nCapabilities to \nAddress Them \nArmy Futures Command \nPrioritized Four Capability \nNeeds for Air and Missile \nDefense"
    },
    {
      "page": 18,
      "text": "Page 13 GAO-25-107491  Army Modernization \nGenerally, there are several ways the Army can identify capability needs. \nThese include, but are not limited to, the national defense strategy and \nnew Army warfighting concepts such as Multi-Domain Operations. In \naddition, the Army conducted studies and used intelligence threat \nassessments. For example: \n• According to Army documentation, a 2017-2018 capability needs \nanalysis revalidated the areas identified in a July 2005 intelligence \nthreat study. The 2005 study noted that IBCS would encounter a wide \nrange of threats. including ballistic missiles, cruise missiles, uncrewed \naircraft systems, fixed and rotary wing aircrafts, and rockets, artillery, \nand mortars. The 2005 study also noted that the threats may employ \ncoordinated complex integrated attacks, consisting of multiple weapon \ntypes in large numbers to overwhelm ground-based defenses. \n• Army documentation noted that a 2016 capability needs analysis \nidentified and validated the need for short range air defense \ncapabilities in maneuver formations. This analysis stated that \nmaneuver formations require these capabilities to counter aerial \nthreats, such as uncrewed aircraft systems, and rockets, artillery, and \nmortars. \nArmy air and missile defense capability needs have also been identified \nby senior Army leaders. These leaders can direct the development of a \nmateriel or non-materiel solution—called a directed requirement—to \naddress an urgent capability need. For example, short-range air defense \ncapability needs were identified by Army leadership in Europe and \ndirected energy capability needs were based on requirements from the \nRCCTO Board of Directors. \nThe AFC air and missile defense CFT, with assistance from the Fires \nCDID, is responsible for the capability needs analysis process associated \nwith all Army air and missile defense modernization efforts. According to \nArmy officials, this process is continuous, and AFC often revisits \ncapability needs identified previously to revalidate or refine them based \non combat experiences. The Fires CDID was the lead for the analysis, \ndevelopment, writing, and experimentation that identified the ways to \naddress the needs associated with air and missile defense. Fires CDID \nofficials identified that they used their Battle Lab to analyze and determine \nthe most appropriate models and simulations to use for each concept. \nThe Battle Lab also conducted table-top exercises and wargames that \ncommitted existing and proposed capabilities against an adversarial force \nto determine the capabilities needed to fight and win on current and future \nbattlefields. Although the air and missile defense CFT and the Fires CDID"
    },
    {
      "page": 19,
      "text": "Page 14 GAO-25-107491  Army Modernization \nare the primary developers of desired capabilities and requirements for \nthe modernization efforts, Army officials stated that they consult others as \nwell. This includes input from stakeholders like the commanders of \noperational units in-theater and an Army Capability Manager responsible \nfor presenting the soldier’s perspective. \nTo address the identified capability needs, the Army developed desired \ncharacteristics or more specific requirements documents for the seven air \nand missile defense systems noted below. \nIBCS: To address the identified need for a common mission command-\ncontrol system, the Army developed the requirements for IBCS. In 2010, \nthe Fires CDID described the requirements for IBCS in a CDD and \nvalidated the key performance parameters and resource constraints. In \n2020, air and missile defense CFT and Fires CDID officials updated the \nrequirements as a part of the 2021 program restructuring and validated \nthe key performance parameters. This updated CDD was used to support \na production decision in 2021. \nM-SHORAD: According to Army officials, the M-SHORAD family of \nsystems is comprised of five increments, each with its own specific \ndesired capabilities or requirements. All five increments of the M-\nSHORAD are intended to protect maneuver formations against aerial \nthreats. \n• The Army initiated the Sgt. Stout in response to an approved directed \nrequirement from February 2018 to address the urgent need for an air \ndefense capability to protect maneuver formations. The air and missile \ndefense CFT developed the requirements in a November 2022 CDD. \n• The Army derived the A-CDD for NGSRI from a previous \nrequirements document developed for Sgt. Stout. The A-CDD for \nNGSRI included the desired capabilities for a new missile to replace \nthe Stinger missile. The Army desires the new missile to have \nimproved target acquisition, range, and lethality to counter evolving \naerial threats. The A-CDD also included a desired capability for the \nnew missile to not be heavier than the current Stinger missile so it can \nbe used by both a vehicle mounted launcher and a soldier. The A-\nCDD for NGSRI identified that the new missile should be able to \ndefend the maneuver force against cruise missiles, fixed and rotary \nwing aircrafts, and uncrewed aircraft systems threats. The A-CDD \nalso provided for a new 30-millimeter ammunition for the cannon used \non the Sgt. Stout platform. According to Army officials, this A-CDD will \neventually lead to formalized requirements in a CDD, projected for \nArmy Developed \nRequirements to Address \nthe Identified Capability \nNeeds"
    },
    {
      "page": 20,
      "text": "Page 15 GAO-25-107491  Army Modernization \ncompletion in early fiscal year 2028. Officials said they are currently \nworking with the Army Capability Manager as the user representative \nto inform further development of the A-CDD. \n• According to Army officials, requirements for M-SHORAD Increments \n4 (a light variant) and 5 (a heavy variant) have yet to be determined. \nIn May 2024, however, the Army issued a request for information for \nIncrement 4 to inform development of future requirements for air \ndefense capability to support dismounted maneuvers. \n \nDE M-SHORAD: Officials stated that, in 2018, the Army identified DE M-\nSHORAD as one of the increments under the M-SHORAD family of \nsystems. Subsequently, in May 2019, Army officials directed RCCTO to \ninitiate the effort with a 50-kilowatt class laser system under its \nprototyping authority as a complementary capability to other systems \nwithin the M-SHORAD family.23 RCCTO is using the effort’s A-CDD, \ndated January 2023, for the effort to pursue directed energy capabilities \nto address the need to protect maneuvering forces. This A-CDD supports \nRCCTO’s prototyping to develop enduring directed energy capabilities. \nIFPC Increment 2: The Army prepared the IFPC Increment 2 CDD in \nNovember 2016 to address the need for protection of critical fixed and \nsemi-fixed assets—such as airfields and supply depots—against aerial \nthreats. According to Army officials, an updated CDD was approved in \nMarch 2025. These officials noted that the updated requirements \ndocument reflects insights from ongoing conflicts. IFPC Increment 2 is \nintended to provide 360-degree protection with the ability to engage \nsimultaneous threats arriving from different altitudes and directions, such \nas cruise missiles and uncrewed aircraft systems. \nIFPC HEL and HPM: RCCTO is developing two directed energy variants \nof IFPC. The Army intends for IFPC HEL and HPM to address the need \nfor protection of critical fixed and semi-fixed assets against aerial threats. \nThe Army developed A-CDDs for directed energy efforts. According to \nRCCTO officials, IFPC HPM’s A-CDD was approved in April 2025; and \nIFPC HEL’s A-CDD is still in draft. Like IFPC Increment 2, IFPC-HEL is \n \n23The Army’s supplement to the Federal Acquisition Regulation (FAR) gives specific \nauthority to the head of the contracting activity for RCCTO to award and administer \nagreements for rapid prototyping of strategically important capabilities. Army Federal \nAcquisition Regulation Supplement 5101.601-90(b)(6)."
    },
    {
      "page": 21,
      "text": "Page 16 GAO-25-107491  Army Modernization \ndesigned to detect, track, identify, engage, and defeat airborne threats to \ndefend fixed and semi-fixed sites in a range of combat environments. \nIFPC-HPM uses microwave energy to damage or disrupt targets. The \nArmy is pursing directed energy weapons, such as IFPC HPM, to address \nnear peer threats in support of the Army’s Modernization Strategy. The \nRCCTO Board of Directors directed RCCTO to pursue this capability. \nRCCTO, through prototyping efforts, informed the desired characteristics \nin a draft A-CDD. IFPC-HPM is designed to provide 360-degree \nprotection for fixed and semi-fixed sites or assets from small, uncrewed \naircraft systems individually and in swarms approaching from different \ndirections and altitudes. \nLTAMDS: A 2016 Army-led analysis of alternatives identified the need to \ndevelop a new radar system and recommended the development of \nsensor capabilities in air and missile defense units. The Army developed \na draft CDD using the long-standing approved operational requirements \nfor a new sensor that could link to IBCS. In February 2024, the program \noffice submitted an updated CDD in support of the decision to transition to \nthe MCA pathway at production, which is currently planned for the second \nquarter of fiscal year 2025. LTAMDS supports the air and missile defense \nmission against threats such as tactical ballistic missiles, cruise missiles, \nanti-radiation missiles, uncrewed aircraft systems, and rotary and fixed-\nwing aircrafts. \nC-sUAS: The Army is pursuing six C-sUAS formal acquisition programs, \nas well as numerous other C-sUAS systems, to address the need for \nprotection of maneuver formations and critical fixed and semi-fixed assets \nagainst aerial threats. The Army developed required capabilities for five of \nthe six C-sUAS programs based on a joint urgent operational need in \n2016. Officials stated that the Army identified the need for these \ncapabilities, in part, due to experiences by Iraqi forces with combatting \nuncrewed aircrafts in Iraq. In February 2022, the Army approved a CDD \nfor the five C-sUAS formal acquisition programs. In 2023, AFC approved \nthe directed requirement for the sixth.  \nWhile the Army’s desired capabilities and requirements for air and missile \ndefense modernization were generally established prior to the start of the \ncurrent conflicts in the Ukraine and the Middle East, according to Fires \nCDID officials, analysis of these conflicts resulted in a revalidation of \nthose capabilities and requirements. For example, officials stated that \nthese conflicts reemphasized the need for mobility and survivability on the \nmodern battlefield as well as the need to defeat evolving threats such as"
    },
    {
      "page": 22,
      "text": "Page 17 GAO-25-107491  Army Modernization \nswarms of drones. Officials also stated that the Army revisited its tactics, \ntechniques, and procedures for operations with air and missile defense \nplatforms based on insights from current conflicts as a part of revalidating \nthe requirements. \nThe Army chose accelerated acquisition pathways and flexible agreement \ntypes to develop and field systems to address required capabilities—and \nsubmitted increased funding requests through the budget process to \nsupport them—but has not yet fielded most of the air and missile defense \nmodernization efforts. For system development, the Army generally used \npathways intended to accelerate development, production, and delivery of \nthe required capabilities. The Army also used other transaction \nagreements in an attempt to speed development and offer flexibilities to \nvendors. Since the release of the Modernization Strategy in 2021, the \nArmy increased its funding requests by approximately $3 billion to support \nthe development and procurement of these systems. Of the eight systems \nwe reviewed, five identified performance or integration issues that \ndelayed their transition into production. These systems included DE M-\nSHORAD, all variants of IFPC, and LTAMDS. \nFor system development, the Army generally used acquisition \npathways—such as MTA, Urgent Capability Acquisition, and the Software \nAcquisition pathway—that are intended to accelerate development, \nproduction, and delivery of materiel capabilities. However, the Army \nsubsequently plans to use the more traditional MCA pathway for \nproduction of most air and missile defense systems. Further, although the \nArmy prioritized accelerated development, multiple modernization efforts \nhave experienced setbacks during development that have extended their \ntimelines.  \nSee figure 2 for acquisition pathways and oversight offices for air and \nmissile defense modernization efforts. \nArmy Prioritized \nRapid Development \nand Fielding of Air \nand Missile Defense \nCapabilities, \nIncreasing Its Budget \nRequests, but Has \nHad Limited Success"
    },
    {
      "page": 23,
      "text": "Page 18 GAO-25-107491  Army Modernization \nFigure 2: Acquisition Pathways and Oversight Offices for Selected Air and Missile Defense Modernization Efforts \n \n \nThe Army used other transaction agreements during development. Army \nofficials said that these agreements could provide increased speed and \nflexibility as well as increased opportunities to work with nontraditional"
    },
    {
      "page": 24,
      "text": "Page 19 GAO-25-107491  Army Modernization \nvendors.24 Following development, the Army plans to transition air and \nmissile defense efforts to Federal Acquisition Regulation (FAR)-based \ncontracts for production. According to officials, FAR-based production \ncontracts help to ensure vendor compliance with federal rules and \nregulations and include standardized language that protects the \ngovernment’s investments.25 \nTo support the development and procurement of the required capabilities \nthe Army has repeatedly increased its funding requests for the priority \nsystems it identified in the 2021 Modernization Strategy and C-sUAS. In \nthe fiscal year 2021 President’s Budget, the Army requested \napproximately $8.8 billion for the period from fiscal years 2021 through \n2025 for these systems. By fiscal year 2025, the Army had requested \napproximately $11.8 billion for the same systems. The $3 billion increase \nwas due to the inclusion of systems that did not appear in the fiscal year \n2021 budget request, such as IFPC HEL and HPM, as well as changes in \nfunding needed to support further testing or shifting procurement profiles. \nSpecifics on the acquisition pathways, agreement types, and funding \nchanges for each of the required capabilities are as follows:  \n \n24Officials previously told us that the time needed to award a prototype other transaction \nagreement can vary significantly. Our analysis found that award time ranged from 45 to \n370 days. See GAO, Defense Acquisitions: DOD’s Use of Other Transactions for \nPrototype Projects Has Increased, GAO-20-84 (Washington, D.C.: Nov. 22, 2019). \n25We have an ongoing review assessing the extent to which selected efforts using other \ntransaction agreements for prototyping have transitioned or plan to transition to follow-on \nproduction under other transaction agreements or FAR-based contracts. We plan to issue \nour report on these selected efforts in the summer of 2025."
    },
    {
      "page": 25,
      "text": "Page 20 GAO-25-107491  Army Modernization \nIBCS, which began development more than 15 years ago, has \nexperienced numerous challenges in early development, including poor \nsoftware performance and evolving requirements. The Army restructured \nthe program in September 2021 to enter the Software Acquisition \nPathway. Figure 3 shows a timeline of selected events for the program. \n \n \n \n \n \nFigure 3: Integrated Battle Command System Selected Events Timeline \n \n \nThe Software Acquisition pathway uses an Agile development approach, \nwhich, according to officials, can result in faster development, upgrades, \nand improvements for IBCS through quarterly software updates. \nAccording to officials, the Army awarded one other transaction agreement \nfor the effort and plans to award another to further develop the software. It \nawarded the initial other transaction agreement for prototyping, facilitated \nIntegrated Battle Command System \n(IBCS) \nIBCS is the central system of, and the \nmateriel solution to, the Army’s Integrated \nAir and Missile Defense concept, which \nenvisions an integrated system-of-systems \nlayered approach to air and missile defense. \n \nSource: U.S. Army.  |  GAO-25-107491"
    },
    {
      "page": 26,
      "text": "Page 21 GAO-25-107491  Army Modernization \nthrough a consortium, to Northrup Grumman in November 2019.26 \nProgram officials stated that they are leveraging other transaction \nagreements because they provide flexibility to off-ramp capabilities \nquickly. \nSince transitioning to the Software Acquisition pathway, the IBCS \nprogram has made progress in its development. The Army fielded an \ninitial operational capability, which included IBCS integrated with the \nPatriot weapon system and the Sentinel A3 radar, to an Air Defense \nArtillery battalion in the third quarter of fiscal year 2023. According to \nArmy officials, the battalion is currently limited to operating as a test unit \nat White Sands Missile Range until further testing is completed. IBCS is \ncurrently in low-rate initial production and was approved for full-rate \nproduction in fiscal year 2023. These officials told us that the program is \non track to begin fielding systems to active Patriot battalions in fiscal year \n2025, and the program intends to field it to two Patriot battalions per year \nuntil 16 battalions are fielded. \nIBCS needs to integrate with other air and missile defense systems to \nprovide capability. The Army developed a “1-to-N” priority list of systems \nto determine the order in which to integrate these systems with IBCS. \nAccording to Army officials, other systems must coordinate their \ndevelopment and testing with IBCS, which may affect the timeline for \nintegrating other systems with the program in the future. \nAlthough IBCS is primarily a software development program, it also \nincludes three hardware components: the Engagement Operations \nCenter that functions as the primary fire control center for engaging \ntargets; the Integrated Collaborative Environment that provides a \ncollaborative environment for battlefield mission command; and the \nIntegrated Fire Control Relay, which is an antenna that connects different \nsensors and weapon systems to the IBCS network. According to Army \nofficials, the hardware components are on the MCA pathway and use \nFAR-based contracts. \n \n26DOD can award other transaction agreements directly to individual organizations or \nthrough a consortium, which is an association of organizations established to provide \nDOD with a pool of stakeholders to innovate in specific technology areas. A consortium \ncan be composed of traditional defense contractors, nontraditional companies, nonprofit \norganizations, and academic institutions. The Army awarded other transaction \nagreements through a consortium for the IBCS and M-SHORAD (Sgt. Stout, DE M-\nSHORAD, and NGSRI) efforts."
    },
    {
      "page": 27,
      "text": "Page 22 GAO-25-107491  Army Modernization \nSince 2021, the Army has increased its budget requests for IBCS. In \n2021, the Army anticipated requesting a total of $2.3 billion for the \nprogram’s development and procurement from fiscal years 2021 through \n2025. The Army requested $460.5 million for development and $1.8 \nbillion for procurement. By the time it submitted the fiscal year 2025 \nbudget, the Army had requested $3.2 billion for IBCS, including $1.4 \nbillion for development and $1.8 billion for procurement. The increase in \nrequests for development funding reflected the need for more testing than \nthe Army originally anticipated. \nM-SHORAD Sgt. Stout and NGSRI are on the MTA pathway. The Army \ninitiated Sgt. Stout in response to a requirement directed by the Army’s \nVice Chief of Staff in 2018 to address the urgent need for air defense \ncapability to protect maneuver formations. By 2024, the effort had \ntransitioned to the MTA rapid fielding pathway. Figure 4 below shows a \ntimeline of selected events for Sgt. Stout. \n \n \n \n \n \nManeuver-Short Range Air Defense (M-\nSHORAD) Increment 1: Sgt. Stout \nSgt. Stout includes a suite of weapons, \nincluding Stinger missiles and a 30-millimeter \ncannon, integrated onto a Stryker Combat \nVehicle. \n \nSource: U.S. Army; C. Kaufmann.  |  GAO-25-107491"
    },
    {
      "page": 28,
      "text": "Page 23 GAO-25-107491  Army Modernization \nFigure 4: Maneuver-Short Range Air Defense Sgt. Stout Selected Events Timeline \n \naThe Army can prepare directed requirements in cases where a specific but limited necessary urgent \nneed exists. To arrive at a directed requirement, Army leaders identify capability needs and direct the \ndevelopment of a materiel or non-materiel solution to address the needs. \n \nThe Army awarded other transaction agreements for prototyping to \nGeneral Dynamics Land Systems, Inc. and Raytheon Company in 2018, \nand DRS Sustainment Systems, Inc. in 2019. Officials told us that they \nchose to use this agreement for prototyping because it allowed for more \nrapid execution of the effort. \nIn September 2021, after fielding the first platoon of Sgt Stout, the Army \ndecided to replace the system’s Hellfire missile launcher with a second \nStinger missile launcher after it identified performance and safety \nconcerns during an operational assessment. According to officials, the \nArmy will retrofit the systems it has already procured to a dual Stinger \nmissile launcher configuration beginning in fiscal year 2026.  \nThe Army approved Sgt. Stout to transition to the MTA rapid fielding \npathway in March 2024. The Army completed procurement of the final 10 \nsystems to fulfill the directed requirement and fielded a battalion in fiscal \nyear 2024 and plans to complete fielding to another battalion in the first \nquarter of fiscal year 2026. The Army is using a FAR-based contract for \nproduction."
    },
    {
      "page": 29,
      "text": "Page 24 GAO-25-107491  Army Modernization \nThe Army is pursuing an additional M-SHORAD increment, NGSRI, that \nadds capability to Sgt. Stout. In 2023, the Army initiated NGSRI using the \nMTA for rapid prototyping. See figure 5 for a timeline of selected events \nfor NGSRI. \n \n \n \n \n \n \nFigure 5: Maneuver-Short Range Air Defense Next Generation Short Range Interceptor Selected Events Timeline \n \n \nAs part of the MTA, the Army selected two vendors, Raytheon Company \nand Lockheed Martin, to develop prototypes and awarded each an other \ntransaction agreement in 2023.27 Officials told us they plan to select one \nvendor in fiscal year 2028. NGSRI intends to field two platoons with 48 \nmissiles each as well as transition to the MCA pathway at production start \nin fiscal year 2028.  \n \n27A separate Army effort will develop a new 30-millimeter ammunition for M-SHORAD \nIncrement 3. We did not assess the Army effort for the new 30-millimeter ammunition.  \nManeuver-Short Range Air Defense (M-\nSHORAD) Increment 3: Next Generation \nShort Range Interceptor (NGSRI) \nNGSRI intends to replace Sgt. Stout’s \nStinger missile with a more advanced short-\nrange interceptor that increases range and \nlethality. \n \nSource: U.S. Army.  |  GAO-25-107491"
    },
    {
      "page": 30,
      "text": "Page 25 GAO-25-107491  Army Modernization \nThe Army plans to develop two future M-SHORAD increments. Increment \n4 will replace the Stryker platform with a lighter vehicle for light and joint \nforcible entry maneuvering forces. Increment 5 will replace the Stryker \nplatform with a heavier vehicle with increased armor to defend armored \nforces. According to officials, there is not yet funding or approved \nrequirements for either increment. \nDE M-SHORAD, under development with RCCTO, is one of the \nincrements under the M-SHORAD family of systems. Figure 6 shows a \ntimeline of selected events for the effort. \n \n \n \n \n \n \nFigure 6: Directed Energy Maneuver-Short Range Air Defense Selected Events Timeline \n \n \nIn 2019, the Army awarded an other transaction agreement for \nprototyping to Kord Technologies, Inc. Officials told us that they chose to \nuse this agreement because it allows for quicker acquisition and \ndevelopment and is more flexible than FAR-based contracts. The effort \nManeuver-Short Range Air Defense \nIncrement 2: Directed Energy  \n(DE M-SHORAD) \nDE M-SHORAD is a 50 kilowatt-class laser \nintegrated onto a Stryker vehicle. It is \ndesigned to defend maneuvering forces \nagainst a variety of threats, such as \nuncrewed aircraft systems, and rockets, \nartillery, and mortars. \n \nSource: U.S. Army.  |  GAO-25-107491"
    },
    {
      "page": 31,
      "text": "Page 26 GAO-25-107491  Army Modernization \ndelivered the first four prototypes to an Air Defense Artillery platoon in the \nfourth quarter of fiscal year 2023. According to Army officials, RCCTO \nconducted an in-theater assessment with the platoon using the prototypes \nin fiscal year 2024. RCCTO delayed the effort’s transition to a program \noffice by approximately 2 years after results from the prototype system \ndemonstration and experimentation events determined that the system \nwas not mature enough to support the transition. Consequently, the effort \nwill not begin production in fiscal year 2025 as previously planned, \nproduction is now expected to begin in fiscal year 2027. Officials stated \nthat the Army is also considering a new configuration for the system that \ndoes not include the Stryker platform on which it is currently mounted. At \ntransition to a program office, the Army will refer to the effort as Enduring \nHigh Energy Laser. Officials added that the effort has continued \ndevelopment of two alternative design prototypes to pursue \nimprovements of critical technologies. \nThe Army’s funding requests for M-SHORAD Sgt. Stout, DE M-SHORAD, \nand NGSRI generally decreased from fiscal years 2021 through 2025. In \nthe fiscal year 2021 President’s Budget, the Army requested a total of \n$3.2 billion for the development and procurement of M-SHORAD for fiscal \nyears 2021 through 2025.28 \n• In the 2021 budget request, the Army requested $2.2 billion for Sgt. \nStout, with $49.8 million for development and $2.1 billion for \nprocurement. By the 2025 budget request, the Army had increased its \nrequests for development to $61.6 million but decreased its \nprocurement requests to $1.5 billion. The decrease in procurement \nfunding is due to the use of Ukraine supplemental appropriations for \nprocurement of some systems. The Army’s procurement request of \n$1.5 billion includes funds for additional Stinger missile launchers to \nreplace the cancelled Hellfire launchers. \n• Army budget requests after 2022 anticipated $693.3 million in \ndevelopment funds for DE M-SHORAD. By 2025 the Army had \ndecreased its total requests to $431.3 million, reflecting completion \nand delivery of prototypes and other activities. \n \n28In 2021, the Army requested $1.1 billion in aggregate for the development of multiple \ncapabilities associated with M-SHORAD. The Army requested separate funding for the \nincrements of M-SHORAD starting with the 2022 budget request."
    },
    {
      "page": 32,
      "text": "Page 27 GAO-25-107491  Army Modernization \n• Similarly, while the Army anticipated requesting $507.6 million in \ndevelopment funding for NGSRI, by 2025 the Army had requested \nonly $373.7 million for development. According to Army officials, the \nreduction in development funding is due to an Army cost estimate that \nresulted in lower than originally projected costs, and the savings were \nrealigned to support other programs. \nIFPC Increment 2 was initiated under the MTA rapid prototyping pathway \nand is intended to provide short-range air defense against aerial threats.\n29 \nFigure 7 shows a timeline of selected events for the effort. \n \n \n \n \n \n \nFigure 7: Indirect Fire Protection Capability Increment 2 Selected Events Timeline \n \n \n \n29IFPC Increment 1 is the Land-based Phalanx Weapon System. IFPC Increment 1 is not \none of the air and missile defense modernization efforts, and we did not evaluate it for this \nreport. \nIndirect Fire Protection Capability (IFPC) \nIncrement 2 \nIFPC Increment 2 provides short-range \ncapability to defeat subsonic cruise missiles, \nuncrewed aircraft systems, and other aerial \nthreats. It includes the IFPC launcher, an \nexisting sensor, and an existing fire control \nsystem. \n \nSource: U.S. Army.  |  GAO-25-107491"
    },
    {
      "page": 33,
      "text": "Page 28 GAO-25-107491  Army Modernization \nThe Army awarded an other transaction agreement for prototyping to \nDynetics, Inc. in September 2021, and Army officials told us they plan to \naward a FAR-based contract for production. According to Army officials, \nIFPC Increment 2 is scheduled to issue prototypes to multiple Air Defense \nArtillery battalions in the fourth quarter of fiscal year 2025. The Army \ndelayed IFPC Increment 2’s MTA completion and entry into production by \nmore than a year, but the effort is expected to complete prototyping \nactivities within the 5-year MTA requirement. Officials further stated that \nthe Army is on track to field the first IFPC launchers to support operations \nin the Indo-Pacific. The Army is also developing a new missile for IFPC \nIncrement 2 on the MTA rapid prototyping pathway, and officials told us \nthey intend to release a request for ideas from potential vendors in the \nfirst quarter of fiscal year 2025. \nIn the 2021 budget request, the Army anticipated requesting $2.2 billion \nfor IFPC Increment 2 from fiscal years 2021 through 2025, of which \n$870.5 million was to develop the capability and $1.4 billion to procure it. \nBy 2025, the Army had requested $2.1 billion, which consisted of an \nincrease in requests for development funding to $935.2 million and a \nreduction in procurement funding requests to $1.1 billion. These changes \nreflect the need for additional testing."
    },
    {
      "page": 34,
      "text": "Page 29 GAO-25-107491  Army Modernization \nIFPC HEL and HPM are under development with Army RCCTO using its \nprototyping authority. The first directed energy variant is IFPC HEL. \nFigure 8 shows a timeline of selected events for IFPC HEL. \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 8: Indirect Fire Protection Capability High Energy Laser Selected Events Timeline \n \nIndirect Fire Protection Capability (IFPC) \nHigh Energy Laser (HEL) and High Power \nMicrowave (HPM) \nIFPC HEL is a 300 kilowatt-class laser \nweapon that defends against a variety of air \nand artillery threats. \n \nIFPC HPM is a high-power microwave \nsystem that defends against small-\nUnmanned Aircraft Systems. \n \nSource: Lockheed Martin Aculight (IFPC HEL) and U.S. \nArmy (IFPC HPM).  |  GAO-25-107491"
    },
    {
      "page": 35,
      "text": "Page 30 GAO-25-107491  Army Modernization \nThe Army awarded an other transaction agreement for prototyping to \nLockheed Martin in July 2023. RCCTO officials told us that IFPC HEL’s \nplanned transition a program office has been delayed and the effort may \nnot transition at all. According to officials, the Army decided to delay the \ntransition and extend prototype testing to gather and evaluate data, \nincluding integration with IBCS and assessments from users, to better \ninform whether to continue investing in the effort. Additionally, they told us \nthat early subsystem-level testing revealed that integration of the \nassociated technologies is more complex than the Army anticipated. \nThe second directed energy variant is IFPC HPM. See figure 9 for a \ntimeline of selected events for IFPC HPM. \nFigure 9: Indirect Fire Protection Capability High Power Microwave Selected Events Timeline \n \n \nThe Army began development of IFPC HPM in August 2022 under \nRCCTO’s prototyping authority. The effort awarded an other transaction \nagreement for prototyping to Epirus, Inc. in December 2022. IFPC HPM \nplanned to deliver four prototype systems for testing to an Air Defense \nArtillery battalion in the fourth quarter of fiscal year 2024. RCCTO officials \nstated that plans to transition the effort to a program office are now \ndependent on Army senior leadership decision to either further invest in \nor divest of the effort. \nThe Army first requested funding for IFPC HEL and HPM in 2022. The \n2023 budget request for these systems anticipated $358.6 million and \n$94.1 million in development funds for the respective systems from fiscal \nyears 2022 through 2025. By 2025, Army requests decreased for IFPC"
    },
    {
      "page": 36,
      "text": "Page 31 GAO-25-107491  Army Modernization \nHEL to $310.4 million and for IFPC HPM to $93.8 million, reflecting the \nuncertainty in the efforts following their demonstrations in the field. \nLTAMDS was initiated on the MTA rapid prototyping pathway by \nProgram Executive Office Missiles and Space in 2018. Figure 10 shows \na timeline of selected events for the effort. \n \n \n \n \n \n \nFigure 10: Lower Tier Air and Missile Defense Sensor Selected Events Timeline \n \n \nThe Army awarded an other transaction agreement for prototyping to \nRaytheon Company in 2019. The Army did not intend to field the primary \narray capability as an operational configuration and Army officials told us \nthe department has not yet determined when it will field the full array \ncapability. LTAMDS completed its MTA in October 2023 but received \napproval to delay its production decision and transition to the MCA \npathway to the second quarter of fiscal 2025. The last event required \nbefore transition to the MCA pathway was the full array operational \nLower Tier Air and Missile Defense Sensor \n(LTAMDS) \nLTAMDS will replace the current Patriot radar. \nIt consists of a 180-degree primary radar \ncomponent and two secondary radar \ncomponents that together provide the full 360-\ndegree capability. \n \nSource: Copyright 2020 Raytheon Company.  |   \nGAO-25-107491"
    },
    {
      "page": 37,
      "text": "Page 32 GAO-25-107491  Army Modernization \nassessment, which officials stated was completed in December 2024. \nArmy officials told us that in the second quarter of fiscal year 2025, the \nArmy acquisition executive approved the entry of LTAMDS into the MCA \npathway pending completion of a revised test plan and supporting \nprogram documentation. As of March 2025, LTAMDS officials were \nworking to complete these tasks. \nIn the 2021 budget, the Army anticipated requesting $1.1 billion in \ndevelopment funds for LTAMDS over 5 years. Additionally, in 2022, the \nArmy first requested procurement funding and by 2023 it anticipated \nrequesting funds totaling $1 billion for procurement through fiscal year \n2025. By fiscal year 2025, the Army had requested a total of $2.6 billion, \nincreasing development fund requests to about $2.1 billion and \ndecreasing procurement requests to approximately $572.4 million. This \nchange in funding requests reflects the Army’s need for continued testing \nof LTAMDS and the delay in the production decision. \nAccording to Army officials, in 2022, the Army added Counter-small \nUnmanned Aircraft Systems (C-sUAS) to the air and missile defense \nmodernization portfolio. C-sUAS systems detect, identify, and defeat \nsmall (up to 1,320 pounds) uncrewed aircraft threats through a variety of \ncapabilities, including radars, kinetic weapons, and electronic warfare \ntechnology. In response to these threats, the Army initially emphasized \nacquisition of commercially available solutions to address the immediate \nrisk. To further mitigate this evolving threat, the Army is pursuing six C-\nsUAS formal acquisition programs (see fig. 11)."
    },
    {
      "page": 38,
      "text": "Page 33 GAO-25-107491  Army Modernization \nFigure 11: Counter-small Unmanned Aircraft Systems (C-sUAS) Formal Acquisition Programs \n \n \nThe Army designated five of the six systems—FS-LIDS, M-LIDS, Coyote, \nthe Ku-Band Radio Frequency System Family of Radars, and \nHandheld/Dismounted Systems—as formal acquisition programs within \nthe C-sUAS portfolio in fiscal year 2022. These programs entered the \nMCA pathway at full-rate production in fiscal year 2024. The Family of \nCounter-UAS Systems began in response to a 2019 Special Operations \nRapid Requirement Document and transferred to RCCTO in February \n2021. The Family of Counter-UAS Systems transitioned to the Urgent \nCapability Acquisition pathway under a project office to become a formal \nacquisition program in July 2024, following development of six prototypes \nand completion of an operational assessment that involved soliciting user \nfeedback. All six formal programs are using FAR-based contracts for \nproduction. Army officials told us that FAR-based contracts are easier to"
    },
    {
      "page": 39,
      "text": "Page 34 GAO-25-107491  Army Modernization \nset up than other transaction agreements for production because they \nhave previous experience using them and these types of contracts \ninclude specific required language.  \nArmy officials told us that they work to deliver capabilities to the field as \nquickly as possible and will deliver initial systems with the intention of \ndeveloping additional capabilities in the future. As a result, some of the C-\nsUAS formal acquisition programs are continuing to pursue improvements \nand additional variants. For example, according to officials, FS-LIDS has \ninitiated development efforts to reduce the number of boxes needed to \ncontain the system’s hardware. M-LIDS is developing a single vehicle \nvariant, using a Stryker platform with both kinetic and electronic warfare \ncapabilities that will replace the current two-vehicle configuration. Officials \nalso told us they are developing a faster Coyote variant, Coyote 2C to \nkeep pace with evolving threats. \nThe Army C-sUAS Project Office also leverages commercial and \ngovernment off-the-shelf solutions to deliver capability to the soldier \nquickly. For example, officials told us that they are not conducting \ndevelopment efforts for Handheld/Dismounted capabilities because their \neffectiveness has a short lifespan. Rather, to respond to the speed at \nwhich evolving small uncrewed aircraft threats are rendering systems \nobsolete, the Army constantly tests and procures Handheld/Dismounted \nsystems from commercial vendors with a warranty period of 24-36 \nmonths. The Army replaces them with more current technology when the \nwarranty expires rather than sustain them. Leveraging both \ndevelopmental and off-the-shelf solutions ensures that the Army can \ncontinuously provide updated solutions to the soldier to keep pace with \nthe evolving threat. \nArmy funding requests for C-sUAS systems have increased significantly \nsince the Army dedicated a funding line specifically for these systems \nstarting in 2022. Since that time, funding requests increased from an \nanticipated request of $551.5 million to approximately $1.2 billion by \n2025. During this time, requests for procurement increased from $473 \nmillion to $1 billion."
    },
    {
      "page": 40,
      "text": "Page 35 GAO-25-107491  Army Modernization \nThe Army varied in its approach to developing the seven air and missile \ndefense modernization efforts, and did not consistently apply leading \npractices for product development. None of the efforts, however, are fully \nleveraging modern design tools, such as the use of digital twins and \ndigital threads. \n \n \n \nTwo of the seven air and missile defense modernization efforts applied an \niterative development approach, while the remaining five efforts did not. \nLeading practices we identified for product development identify that \nleading companies employ an iterative development approach when \ndeveloping complex products. The iterative development approach \ninvolves a continuous cycle, through which companies evaluate iterations \nof capability on functionality, quality, and customer satisfaction to \nincrease innovation and speed delivery.\n30 Conversely, traditional \ndevelopment approaches for hardware and software products progressed \nthrough a lengthy, linear process with sequential milestones. Companies \nsolidified requirements before development start and delivered capability \neither in a single completed product at the end of the development cycle \nor incrementally, with each increment delivering a predetermined \ncapability. \n  \n \n30GAO-23-106222 and GAO-22-104513. \nThe Army Did Not \nConsistently Apply \nLeading Practices, \nIncluding Modern \nDesign Tools, For Air \nand Missile Defense \nModernization Efforts  \nMost Air and Missile \nDefense Modernization \nEfforts Did Not \nConsistently Apply an \nIterative Development \nApproach"
    },
    {
      "page": 41,
      "text": "Page 36 GAO-25-107491  Army Modernization \nFigure 12 below compares these two development approaches.  \nFigure 12: Comparison of Linear and Iterative Development Approaches \n \n \nOur review of the seven air and missile defense modernization efforts \nidentified that two efforts—IBCS as well as IFPC HEL and HPM—used \niterative development: \n• IBCS is using an iterative development approach with continuous \ncycles to develop, test, and collaborate with users to establish and \ncontinuously evaluate its business case as well as deliver updates to \nits minimum viable product. Prior to 2019, the Army was leveraging an \nincremental development approach. As part of its incremental \napproach the Army performed analysis in 2009 to inform its business \ncase and support development of requirements for the system. After \nthe Army restructured IBCS to follow the Software Acquisition \npathway in 2021, it moved to an iterative development approach. \nAccording to Army officials, in December 2020, the Army re-evaluated \nthe analysis from 2009 that supports its business case, and found the \nanalysis was still valid. Our leading practices for product development \nstate that leading companies start with a sound business case and \ncontinuously evaluate elements of the business case. \nIn addition, requirements for future IBCS iterations are based on a \npriority integration list that, according to Army officials, is evaluated at"
    },
    {
      "page": 42,
      "text": "Page 37 GAO-25-107491  Army Modernization \nleast quarterly in collaboration with users and stakeholders. As part of \nthis evaluation, the effort has off-ramped integration of technology that \nrequired further development. For example, Army officials told us that \nthey delayed integration of a targeting system into IBCS as the \nsystem required further development to fix critical deficiencies. We \npreviously found that leading companies make off-ramping decisions \nfor a given minimum viable product largely based on customer and \nuser needs, with the knowledge that they can add some of the \ncapabilities in subsequent iterative product deliveries. Because the \niterative process provides such opportunities, leading companies \ndelay capabilities that are not ready until the next release or decide \nnot to provide them if they are no longer needed.31 \nAccording to Army officials, the effort also prioritized user interaction \nwith each iteration of IBCS prior to fielding. During this testing, users \nprovided feedback that is being used to make changes within the \nsystem as well as identify what capabilities would be of most utility to \nthe user in future iterations. Leading practices we identified for \nproduct development identify that leading companies establish a \nprocess to facilitate ongoing engagement with users to inform design \nspecifications. This user-centered design process means that \ninformation gathered from users leads to building, testing, and \nredesigning through rapid iterations and innovation until the product \nspecifications meet user needs. \n• IFPC HEL and HPM variants applied iterative development \napproaches. In developing the business case for these two IFPC \nvariants, the Army leveraged analysis to develop high-level \noperational needs in a draft A-CDD for each system. These \ndocuments have allowed the Army to conduct prototyping activities for \neach system. The Army will identify and refine detailed requirements \nduring iterative development to arrive at what developers and users \nwill agree upon as a minimum viable product for each system. We \nfound that the Army’s approach of starting with an A-CDD, and \nsubsequently refining requirements generally aligned with leading \ncompanies, which do not attempt to start development with a business \ncase that includes a detailed specification of requirements. Instead, \ndevelopment begins with a high-level need statement or idea, which is \ncontinuously refined into distinct requirements through iterative \ndevelopment cycles. In this manner, leading companies enable the \ninitial business case to evolve throughout product development. \n \n31GAO-23-106222 and GAO-22-104513."
    },
    {
      "page": 43,
      "text": "Page 38 GAO-25-107491  Army Modernization \nAfter determining the desired characteristics for IFPC HEL and HPM, \nRCCTO is performing iterative cycles to develop, test, and collaborate \nwith users. For example, the Army performed multiple developmental \ntests with the HPM variant by using soldiers in the field to solicit user \nfeedback which, according to Army officials, they intended to \nincorporate into changes to the design. The Army’s actions for IFPC \nHEL and HPM align with leading practices for product development, \nwhich state that leading companies seek and obtain continuous user \nfeedback throughout iterative development.\n32 \nWe found that four air and missile defense modernization efforts—M-\nSHORAD, DE M-SHORAD, IFPC Increment 2, and LTAMDS—used \nlinear development approaches that, at times, reflected some \ncharacteristics of an iterative development approach. \n• The overall M-SHORAD effort—including DE M-SHORAD—used an \nincremental, linear development approach consisting of five \nincrements. According to Army officials, before starting development, \nthe Army determined what characteristics it would seek for each of the \nfive increments. Each increment will provide the Army with short-\nrange air defense systems with similar characteristics but the desired \ncapabilities for some increments varied. As previously mentioned, the \nSgt. Stout platform is based on a Stryker vehicle and NGSRI is a new \nmissile that is intended to reside on a Sgt. Stout platform as well as \nhave a soldier-portable capability. While DE M-SHORAD is also \nmounted on a Stryker vehicle, it requires a different design and \ntechnologies for a directed energy solution as its primary armament. \nThe Army plans for Increments 4 and 5 will not use the Stryker as the \nbase vehicle and instead will use other vehicles that are currently in \nthe Army’s portfolio according to officials. This will require different \ndesigns to accommodate a short-range air defense capability for \nthese vehicles. \nWhile this developmental approach allows the Army to develop \nmultiple increments of capability for the soldier, it does not fully meet \nleading practices we identified for product development. The Army, in \npre-determining capabilities for each increment of M-SHORAD, did \nnot iteratively develop the system with users to determine which \ncapabilities would be of most operational value. \nThe effort’s incremental, linear development approach, however, \ncontains elements resembling aspects of an iterative design process. \nFor example, while the effort’s business case was predicated on a \n \n32GAO-23-106222 and GAO-22-104513."
    },
    {
      "page": 44,
      "text": "Page 39 GAO-25-107491  Army Modernization \ndirected requirement rather than on collaboration with users, Army \nofficials told us they obtained input on requirements from a user \nrepresentative, an Army Capability Manager. This input, along with \nthe directed requirements that were derived from an operational need \nidentified by Army leadership in Europe, allowed the Army to get \nfeedback on requirements for the system from users at the \noperational level. As development has progressed for the first three \nM-SHORAD increments, the Army has engaged in ongoing feedback \nwith end users. For example, NGSRI planned multiple soldier \ntouchpoints throughout development. Army officials stated the user \nfeedback informs system requirements. Leading practices for product \ndevelopment state that obtaining ongoing feedback from customers \nfor a potential product is an important aspect to attaining a sound \nbusiness case for leading companies. In soliciting early feedback from \na user representative to develop requirements, as well as ongoing \nfeedback from users to inform requirements, M-SHORAD \nimplemented a process similar to what would occur under an iterative \ndevelopment approach. \n• IFPC Increment 2 leveraged incremental, linear development to \ndevelop a minimum capability to field to the soldier. For IFPC, the \nArmy plans to develop Increment 2, as well as at least one future \nincrement focused on replacement of the current missile with a next \ngeneration missile. The requirements for Increment 2 and the new \nmissile were not identified through an iterative design process based \non user feedback and design modeling and simulation. Instead, the \nrequirements for both increments were predetermined prior to the \nstart of development. In addition, for Increment 2, the Army sought a \nspecific materiel solution that was identified prior to initiating the effort. \nLeading practices for product development identified that leading \ncompanies work together with users to define requirements, which, in \nturn, inform the selected solution. \nIFPC Increment 2’s incremental development approach reflects at \nleast one aspect of an iterative development approach. When the \nArmy established its business case for IFPC Increment 2 it relied on a \nuser representative, an Army Capability Manager, to provide user \nfeedback at the operational level on requirements. In doing so, the \nArmy incorporated user feedback early in the requirements \ndevelopment process, similar to what would occur under an iterative \ndevelopment approach. In addition, IFPC Increment 2 is leveraging \nsoldier touchpoints throughout development to identify changes on the \ndesign of the system. Army officials stated that this feedback can also \nbe used to make changes to the system’s requirements to better \nreflect user needs, among other items. Our leading practices for"
    },
    {
      "page": 45,
      "text": "Page 40 GAO-25-107491  Army Modernization \nproduct development found that leading companies seek and obtain \ncontinuous user feedback throughout development. This feedback \nhelps determine if the design is meeting user needs and reflects a \nminimum viable product. \n• LTAMDS followed a single-step, linear development approach. \nLTAMDS established its business case through market research and \ninput from an Army Capability Manager who provided operational user \nfeedback. Using this business case, the Army set requirements for the \nsystem prior to starting development that required a 360-degree radar \nfunctionality. Under this single-step, linear development approach, the \nLTAMDS effort sought to meet these specific requirements. For \nexample, while the effort achieved partial functionality—a 180-degree \nradar capability—the Army determined it would not field the systems \nuntil it achieved a 360-degree radar functionality. We previously found \nthat leading companies refine capabilities to a minimum set that \nprovides value to the customer and can be delivered quickly while \ndeferring capabilities that are less urgent or not mature. The Army, in \ndefining set requirements, did not develop minimum system \ncapabilities. Further, the Army decided not to field the 180-degree \nradar as a minimum capability and, according to Army officials, does \nnot plan to iterate on this capability in conjunction with the end user, \nas would be seen in an iterative development approach. As a result, \nwhile the LTAMDS development approach allowed the Army to seek a \nsolution to address the identified capability need, it does not fully meet \nour leading practices for product development. \nThe last effort, C-sUAS, primarily focused on integration and procurement \nas opposed to iterative or linear product development. In this capacity, the \nvarious C-sUAS efforts generally sought mature solutions that could be \nquickly integrated or procured to fulfill user operational needs. To ensure \nthese capabilities are meeting user needs, Army officials told us they \nconducted weekly videoconferences with soldiers in the field to solicit \nfeedback that is being used to make changes to requirements or identify \nfuture capabilities. \nAs these efforts have been fielded, the C-sUAS office has started to \nexplore new capabilities. Officials stated that they will first seek \ncommercially available solutions for the new capabilities, but in the \nabsence of a viable commercial solution, the Army plans to start some \ndevelopmental efforts. For example, Army officials told us the office plans \nto develop the M-LIDS system so it can be mounted on multiple types of \nArmy vehicles. These officials further stated that the C-sUAS program \nplans to start other developmental efforts in fiscal year 2026."
    },
    {
      "page": 46,
      "text": "Page 41 GAO-25-107491  Army Modernization \nAt present, most DOD acquisition programs and efforts, including the \nArmy’s, are not required to implement an iterative development approach. \nWe previously found that DOD policies include multiple examples that \nemphasize iterative development. In many cases, however, we found that \npolicy language was limited to certain acquisitions—such as software—\nand did not generally apply across all acquisition programs and efforts. \nIn 2022, we made four recommendations including that DOD update its \nacquisition policies to fully implement iterative development principles. \nDOD concurred with our recommendations and noted that it will consider \nimplementing the leading product development principles when it next \nupdates its acquisition policies.33 Such policies would better position \nprograms and efforts to evaluate iterations of capability on functionality, \nquality, and customer satisfaction to increase innovation and speed \ndelivery. The absence of such policies does not preclude efforts from \nimplementing iterative development, which could help them prioritize \ndeveloping and delivering new, innovative products to customers with \nspeed. \nRegardless of the development approach taken, none of the air and \nmissile defense efforts are fully using modern design tools that could \nimprove development speed. Our prior work found that leading \ncompanies benefit from using modern design tools—such as 3D modeling \nand simulation, digital twins, and digital threads—during the design \nmodeling and simulation cycle.34 Table 1 identifies characteristics of key \nmodern design tools.  \n  \n \n33GAO-22-104513. DOD has not updated its acquisition policies to fully incorporate \nleading practices—including the use of iterative development and modern design tools—\nthat private sector companies use to drive innovation and speed in product development, \nas we recommended. DOD is updating its Adaptive Acquisition Framework policies, \nhowever, one recently updated policy and the draft version of another policy, do not fully \nincorporate leading practices to achieve positive outcomes. Additionally, although DOD’s \nmilitary departments have issued policies in alignment with DOD’s goals and the Adaptive \nAcquisition Framework, these policies do not consistently reflect leading practices. \n34GAO-23-106222 and GAO-22-104513.  \nAir and Missile Defense \nEfforts Are Not Fully Using \nModern Design Tools that \nCould Speed Up \nDevelopment"
    },
    {
      "page": 47,
      "text": "Page 42 GAO-25-107491  Army Modernization \nTable 1: Characteristics of Key Modern Design Tools  \n Description Key characteristics \n3D modeling \nand \nsimulation \nA 3D model is a static virtual \nrepresentation of a system at a given point \nin time. Digital simulation is used to test \nthe 3D model using predefined data to \nunderstand how a system will act in a \nspecific scenario. \nA 3D model cannot be updated without someone manually inputting new \ndata and is like paper design drawings in digital form. \nA digital simulation is bound by the predefined data points within a specific \nscenario.  \nDigital twin A dynamic virtual model that simulates the \nconfiguration, performance, and behavior \nof a system within a computer and can be \nupdated in real time. \nA more detailed, dynamic, and complex virtual representation of physical \nsystem than a 3D model. \nCan be updated in real time. \nUsually connected to a digital thread. \nUseful in the sustainment phase. \nDigital \nthread \nA common source of information that \nconnects stakeholders with real-time data \nacross the product life cycle to help inform \ndecisions.  \nData in a digital thread could include the test results from digital twin \nmodeling, user feedback, and records of design changes among other \ninformation. \nUseful in the design and validation process as it can enable more rapid \niterative design cycles and facilitate stakeholder and user feedback at \nearlier stages. \nSource: GAO analysis of Defense Acquisition University and Department of Defense information; GAO-23-106222.  |  GAO-25-107491 \n \nWhile 3D modeling and simulation and digital twins share some \ncharacteristics, the use of a digital twin and associated digital thread offer \nadditional benefits. A high-fidelity digital twin, coupled with high-resolution \nsimulations of the operating environment, can be used for testing the \nsystem to validate that it meets requirements. This reduces the need to \nbuild physical prototypes each time the design changes. We previously \nfound that, at leading companies, digital twins allowed for faster design \niterations and quicker delivery of a product to the user than design and \ndevelopment without these tools. Leading companies continually feed \ndata from the digital twin into a real-time digital thread, which they then \nuse to inform decision-making, such as how to refine requirements or \nwhether to make certain changes to the product’s design. \nOur review of the air and missile defense efforts determined that six of the \nseven efforts used 3D modeling and simulation. Most of the efforts, \nhowever, do not plan to use digital twins or digital threads. Specifically: \n• IBCS used 3D modeling and simulation during development. \nAccording to Army officials, the effort also has a digital thread they \nmaintain within a database that captures all programmatic decisions \nand information related to the effort. Army officials further clarified that \nthe effort does not have a digital twin for the hardware associated with \nIBCS, and there are no plans to develop one."
    },
    {
      "page": 48,
      "text": "Page 43 GAO-25-107491  Army Modernization \n• M-SHORAD effort used 3D modeling and simulation for development \nof Sgt. Stout and NGSRI. Army officials told us the effort does not \nhave a digital twin or digital thread for either of these increments. For \nexample, NGSRI will develop a digital twin for the missile, but officials \nstated that they will not develop a full system-level digital twin to \ninclude the launcher and the vehicles due to funding constraints. \nAccording to Army officials there are no requirements or plans to \ndevelop system-level digital twins or a digital thread for any of M-\nSHORAD’s increments. \n• DE M-SHORAD, according to Army officials, used 3D modeling and \nsimulation for development but does not have a digital twin or digital \nthread. Officials also stated there are no requirements or plans to \ndevelop system-level digital twins or a digital thread. \n• IFPC Increment 2 only used 3D modeling and simulation. Army \nofficials told us that IFPC Increment 2 does not have a digital twin or a \ndigital thread and there are no plans to develop either for the effort \nbecause of the significant cost and labor involved. \n• IFPC HEL and HPM used 3D modeling and simulation. Army officials \nstated that the vendor for HEL has a digital twin of one component, \nbut the effort does not have a full system-level digital twin. These \nofficials also stated that RCCTO is developing a digital thread for \nIFPC HEL, but it is not accessible to the contractor without \ngovernment permission. Due to limitations in who can access this \ninformation, the RCCTO-developed digital thread is not an \nauthoritative source of information available to all stakeholders, as \ndefined by our leading practices. In addition, officials told us that they \nare not developing a digital twin or digital thread for IFPC HPM \nprototypes due to cost but may do so in the future if the Army decides \nto proceed with further development. \n• LTAMDS used 3D modeling and simulation during development. \nArmy officials told us that the effort is developing a digital twin and \nplans to develop a digital thread. \n• Army officials told us the C-sUAS programs have not used many \nmodern design tools due to the limited development activities. These \nofficials clarified that only one C-sUAS program, the Coyote \ninterceptor, has leveraged modern design tools. Coyote is working to \nbuild some models and simulations using data from its test events. In \naddition, Army officials told us they are assessing the use of digital \ntwins and a digital thread for Coyote but have not yet used either. \nArmy officials further told us that the C-sUAS effort is working to \nincrease the use of modern design tools for all efforts starting in fiscal"
    },
    {
      "page": 49,
      "text": "Page 44 GAO-25-107491  Army Modernization \nyear 2026 and has started to include language in contracts and other \ntransaction agreements requiring the use of these tools. \nDOD issued a policy in December 2023 that requires efforts initiated after \nthat date to incorporate modern design tools.\n35 The policy also states that \nexisting efforts, such as the air and missile defense efforts, may \nincorporate modern design tools when it is practical, beneficial, and \naffordable, but they are not required to do so under the policy. The Army \nalso has a policy that encourages the use of modern design tools, but it \ndoes not contain a requirement for programs to use it.36 According to \nArmy officials, the department recognizes both the benefits of using \nmodern design tools and that it is difficult to implement these tools in \nmany programs. These officials further stated that modern design tools is \na newer area that requires the Army to adapt many of its processes to \nfully implement it across the department. As a result, most Army \nprograms and efforts are not required to implement modern design tools \nunder current Army policy. \nOur past work highlighted that leading companies use modern design \ntools like digital twins and digital threads early in the development \nprocess. The use of these tools provides the ability to implement iterative \ndevelopment faster than what would be possible with physical prototypes \nalone.\n37 The effectiveness of modern design tools is best achieved under \nan iterative development approach. Efforts that use a linear approach \nmay be able to realize some efficiencies, especially in sustainment. \nThe Army initiated the seven air and missile defense modernization \nefforts prior to DOD and the Army updating their respective policies for \nthe increased use of modern design tools. None of the seven efforts \ncurrently plan to fully implement use of modern design tools. \nConsequently, the air and missile defense modernization efforts may not \nbe taking full advantage of the efficiencies that modern design tools can \nprovide. Given the new policy introduced by DOD in December 2023, a \nformal, documented assessment of whether and how to implement these \ntools would allow each effort to identify whether these tools are beneficial, \npractical, and affordable to use. \n \n35Department of Defense, Digital Engineering, DOD Instruction 5000.97 (Dec. 21, 2023). \n36Department of the Army, Army Digital Engineering, Army Directive 2024-03 (May 21, \n2024). \n37GAO-23-106222 and GAO-22-104513."
    },
    {
      "page": 50,
      "text": "Page 45 GAO-25-107491  Army Modernization \nAfter placing limited emphasis on its air and missile defense portfolio for \nseveral decades, the Army is spending billions of dollars to modernize its \nsystems to address identified capability needs. Yet, even with the use of \naccelerated acquisition approaches and increases in funding, the Army, \noutside of C-sUAS, has fielded limited capabilities—Sgt. Stout to \noperational units and IBCS to operational users for further testing. Other \nair and missile defense systems will not be fielded to operational units for \nyears to come. Most air and missile defense efforts did not consistently \napply an iterative development approach that enables continuous \ndevelopment cycles to rapidly develop and deliver essential capabilities to \nsoldiers. The Army also does not intend to use iterative development for \nthe air and missile defense modernization efforts it has planned for the \nfuture. The expanded use of modern design tools, such as 3D modeling \nand simulation, digital twins, and digital threads, would help all the air and \nmissile defense modernization efforts to iterate more quickly on designs \nthan is possible with 3D modeling and simulations alone, speeding \ndelivery of capability to the soldier. The Army may be missing \nopportunities for quicker delivery of capabilities if it does not assess the \npracticality, benefits, and affordability and subsequently adopt modern \ndesign tools across its air and missile defense modernization efforts. \nWe are making the following six recommendations to DOD: \nThe Secretary of the Army should ensure that Maneuver-Short Range Air \nDefense Increments 4 and 5, which incorporates new vehicle platforms, \nfollows an iterative product development approach. (Recommendation 1) \nThe Secretary of the Army should ensure that development of the new \nmissile for the Indirect Fire Protection Capability follows an iterative \nproduct development approach. (Recommendation 2) \nThe Secretary of the Army should ensure that the Integrated Battle \nCommand System program assesses the practicality, benefits, and \naffordability of implementing a digital twin that incorporates both software \nand hardware. (Recommendation 3) \nThe Secretary of the Army should ensure that Maneuver-Short Range Air \nDefense Increments 1, 2, and 3 efforts—Sgt. Stout, Directed Energy, and \nNext Generation Short Range Interceptor, respectively—assess the \npracticality, benefits, and affordability of implementing modern design \ntools, including digital twinning and digital threads. (Recommendation 4) \nConclusions \nRecommendations for \nExecutive Action"
    },
    {
      "page": 51,
      "text": "Page 46 GAO-25-107491  Army Modernization \nThe Secretary of the Army should ensure that all variants of the Indirect \nFire Protection Capability effort—to include the development of \nsubsystems for Increment 2 as well as the High Energy Laser and High-\nPower Microwave efforts—assess the practicality, benefits, and \naffordability of implementing modern design tools, including digital \ntwinning and digital threads. (Recommendation 5) \nThe Secretary of the Army should ensure that the Lower Tier Air and \nMissile Defense Sensor effort assesses the practicality, affordability, and \nbenefits, of implementing modern design tools, including digital twinning \nand digital threads. (Recommendation 6) \nWe provided a draft of this report to DOD for review and comment. In its \ncomments, reproduced in appendix II, DOD concurred with our six \nrecommendations. They also provided a technical comment which we \nincorporated as appropriate. \nWe are sending copies of this report to the appropriate congressional \ncommittees, the Secretary of Defense, the Secretary of the Army, and \nother interested parties. In addition, the report is available at no charge on \nthe GAO website at https://www.gao.gov/. \nIf you or your staff have any questions about this report, please contact \nme at sehgalm@gao.gov. Contact points for our Offices of Congressional \nRelations and Public Affairs may be found on the last page of this report. \nKey contributors to this report are listed in appendix III. \n \nMona Sehgal \nDirector, Contracting and National Security Acquisitions \n  \nAgency Comments"
    },
    {
      "page": 52,
      "text": "Page 47 GAO-25-107491  Army Modernization \nList of Committees \nThe Honorable Roger F. Wicker \nChairman \nThe Honorable Jack Reed \nRanking Member \nCommittee on Armed Services \nUnited States Senate \nThe Honorable Mitch McConnell \nChair \nThe Honorable Christopher Coons \nRanking Member \nSubcommittee on Defense \nCommittee on Appropriations \nUnited States Senate \nThe Honorable Mike Rogers \nChairman \nThe Honorable Adam Smith \nRanking Member \nCommittee on Armed Services \nHouse of Representatives \nThe Honorable Ken Calvert \nChairman \nThe Honorable Betty McCollum \nRanking Member \nSubcommittee on Defense \nCommittee on Appropriations \nHouse of Representatives"
    },
    {
      "page": 53,
      "text": "Appendix I: Objectives, Scope, and \nMethodology \n \n \n \n \nPage 48 GAO-25-107491  Army Modernization \nA Senate report and the House report accompanying the National \nDefense Authorization Act for Fiscal Year 2024 include provisions for us \nto review and assess the Army’s air and missile defense modernization \nefforts.\n1 Our report (1) describes how the Army developed the \nrequirements to support its modernization of air and missile defense \nprograms and efforts, (2) describes how the Army is acquiring the \nsystems to modernize its air and missile defense programs and efforts, \nand (3) assesses the extent to which the Army’s applied leading practices \nfor product development for its air and missile defense modernization \nprograms and efforts. \nFor the first objective, we reviewed the Army’s requirements process and \napplicable documents, such as directed requirements, abbreviated \ncapability development documents, and capability development \ndocuments. This allowed us to understand how the Army identified the \ncapabilities it needed and developed the requirements for systems in \ndevelopment. Our review of documents also included Army studies that \ninformed its modernization efforts. \nFor the second objective, we reviewed the Army’s acquisition approaches \nfor systems identified in the Army’s 2021 Modernization Strategy and for \nCounter-small Unmanned Aircraft Systems. We focused on the 2021 \nArmy Modernization Strategy for our review because Army officials said it \nidentified the Army’s 35 signature modernization efforts, six of which were \nfor air and missile defense. We also focused on Counter-small Unmanned \nAircraft Systems for our review, which Army officials told us the \ndepartment added as a modernization effort in 2022. We reviewed \nacquisition plans and program status updates. \nAdditionally, we reviewed changes to Army budget requests and their \nassociated schedules since fiscal year 2021. Specifically, \n• To identify the acquisition approaches the Army is using to acquire its \nair and missile defense modernization efforts, we reviewed Army \ndocuments, such as simplified acquisition management plans, \nacquisition decision memorandums, and budget briefing documents. \nTo identify the agreement types the Army is using to acquire its air \nand missile defense modernization efforts, we reviewed documents \nthat identified the other transaction agreements and Federal \nAcquisition Regulation (FAR)-based contracts that the efforts are \n \n1S. Rep. No. 118-58, at 18 (2023); H. Rep. No. 118-125 at 6 (2023); and National Defense \nAuthorization Act for Fiscal Year 2024, Pub. L. 118-31 (2023). \nAppendix I: Objectives, Scope, and \nMethodology"
    },
    {
      "page": 54,
      "text": "Appendix I: Objectives, Scope, and \nMethodology \n \n \n \n \nPage 49 GAO-25-107491  Army Modernization \nusing for prototyping and production. We interviewed Army officials to \ndiscuss the benefits and challenges of using other transaction \nagreements as opposed to FAR-based contracts for prototyping and \nproduction. We also interviewed Army officials to understand why the \nArmy chose these acquisition approaches. We reviewed the air and \nmissile defense modernization efforts’ schedules to identify when key \nevents occurred or are planned to occur. We interviewed Army \nofficials to determine why delays, if any, occurred and how they are \nexpected to affect the effort’s future development. \n• We reviewed the fiscal years 2021 through 2025 President’s Budget \nrequests for research, development, test, and evaluation, and \nprocurement. This allowed us to identify the amount of funding the \nArmy included in its annual budget submission to Congress for each \nof its air and missile modernization efforts, as well as the total across \nall air and missile defense systems. We compared the Army’s \nprojected 5-year funding request in 2021 for fiscal years 2021 through \n2025 with what subsequent budget submissions requested to \ndetermine how funding requests changed over time. We spoke with \nArmy officials to understand the reasons for the changes in individual \nefforts and programs as well as the total air and missile defense \nbudget and how they expect funding for air and missile defense to \nchange in the future. We did not analyze the underlying cost \nestimates developed for each air and missile defense system. We \nfound the data to be sufficiently reliable for the purposes of reporting \nthe amounts the Army requested for its air and missile defense efforts. \nFor the third objective, we assessed whether each air and missile \ndefense effort’s development approach was linear or iterative and \ndiscussed applicable leading practices that we identified in prior work for \nproduct development for each effort.\n2 To identify the development \napproach for each air and missile defense modernization effort, we \nreviewed Army documentation and interviewed Army officials from each \neffort, as well as Army Futures Command and the Army Rapid \nCapabilities and Critical Technologies Office. To determine the extent to \nwhich the Army applied leading practices for product development, we \nreviewed documents provided by the Army and interviewed officials from \nthe five offices overseeing development of the efforts. These documents \nincluded acquisition decision memorandums and simplified acquisition \nmanagement plans, among others. We also reviewed Department of \n \n2GAO, Leading Practices: Iterative Cycles Enable Rapid Delivery of Complex, Innovative \nProducts, GAO-23-106222 (Washington, D.C.: July 27, 2023); and Leading Practices: \nAgency Acquisition Policies Could Better Implement Key Product Development Principles, \nGAO-22-104513 (Washington, D.C.: Mar. 10, 2022)."
    },
    {
      "page": 55,
      "text": "Appendix I: Objectives, Scope, and \nMethodology \n \n \n \n \nPage 50 GAO-25-107491  Army Modernization \nDefense (DOD) and Army instructions and guidance for digital \nengineering and interviewed DOD and Army officials such as the Deputy \nAssistant Secretary of the Army for Data, Engineering, and Software. \nFor each of the objectives, in addition to the documentary evidence that \nwe analyzed by objective above, we conducted interviews with DOD and \nArmy officials on the Army’s air and missile defense requirements \ndevelopment process, acquisition efforts, the President’s Budget \nrequests, and use of leading practices for product development. We \nconducted in-person interviews with air and missile defense requirements \nand program offices at Fort Sill, Oklahoma and Redstone Arsenal, \nAlabama, the only two offices that provide such support. \nWe also interviewed DOD and Army officials from the following \norganizations: \n• Office of the Secretary of Defense \n• Under Secretary of Defense for Acquisition and Sustainment \n• Under Secretary of Defense for Research and Engineering \n• Office of the Director, Operational Test and Evaluation \n• Office of Cost Assessment and Program Evaluation \n• DOD Joint Counter-small Unmanned Aircraft Systems University \n• DOD Joint Counter-small Unmanned Aircraft Systems Office \n• Assistant Secretary of the Army (Acquisition, Logistics, and \nTechnology) \n• Deputy Assistant Secretary of the Army for Data, Engineering, and \nSoftware \n• Program Executive Office Missiles and Space \n• Short and Intermediate Effectors for Layered Defense Project \nOffice \n• Integrated Fires Capabilities Office—Counter-small Unmanned \nAircraft Systems \n• Search, Track, Acquire, Radiate, Eliminate Project Office \n• Integrated Fires Mission Command Project Office \n• Headquarters, Department of the Army G-8, Programs \n• Headquarters, Department of the Army G-3/5/7 Fires"
    },
    {
      "page": 56,
      "text": "Appendix I: Objectives, Scope, and \nMethodology \n \n \n \n \nPage 51 GAO-25-107491  Army Modernization \n• Army Test and Evaluation Command \n• Army Futures Command \n• Air and Missile Defense Cross-Functional Team \n• Fires Capabilities Development and Integration Directorate \n• Combat Capabilities Development Command—Aviation and \nMissile Center \n• The Research and Analysis Center \n• Army Rapid Capabilities and Critical Technologies Office \n• Directed Energy Project Office \n• Rapid Acquisition Prototyping Project Office \nWe conducted this performance audit from March 2024 to June 2025 in \naccordance with generally accepted government auditing standards. \nThose standards require that we plan and perform the audit to obtain \nsufficient, appropriate evidence to provide a reasonable basis for our \nfindings and conclusions based on our audit objectives. We believe that \nthe evidence obtained provides a reasonable basis for our findings and \nconclusions based on our audit objectives."
    },
    {
      "page": 57,
      "text": "Appendix II: Comments from the Department \nof Defense \n \n \n \n \nPage 52 GAO-25-107491  Army Modernization \n \n \nAppendix II: Comments from the Department \nof Defense"
    },
    {
      "page": 58,
      "text": "Appendix II: Comments from the Department \nof Defense \n \n \n \n \nPage 53 GAO-25-107491  Army Modernization"
    },
    {
      "page": 59,
      "text": "Appendix II: Comments from the Department \nof Defense \n \n \n \n \nPage 54 GAO-25-107491  Army Modernization"
    },
    {
      "page": 60,
      "text": "Appendix III: GAO Contact and Staff \nAcknowledgments \n \n \n \n \nPage 55 GAO-25-107491  Army Modernization \nMona Sehgal at sehgalm@gao.gov \nIn addition to the contact named above, J. Kristopher Keener (Assistant \nDirector), Joe E. Hunter (Analyst-In-Charge), Erin Carson, Christopher \nDurbin, Megan Ferren, Stephanie Gustafson, Simon Messineo, Mark \nOppel, Andrew N. Powell, and Adam Wolfe made significant contributions \nto this review. Other contributors include Jennifer Leotta, Jean McSween, \nKevin O’Neill, and Justin Snover. \nAppendix III: GAO Contact and Staff \nAcknowledgments \nGAO Contact \nStaff \nAcknowledgments"
    },
    {
      "page": 61,
      "text": "The Government Accountability Office, the audit, evaluation, and investigative \narm of Congress, exists to support Congress in meeting its constitutional \nresponsibilities and to help improve the performance and accountability of the \nfederal government for the American people. GAO examines the use of public \nfunds; evaluates federal programs and policies; and provides analyses, \nrecommendations, and other assistance to help Congress make informed \noversight, policy, and funding decisions. GAO’s commitment to good government \nis reflected in its core values of accountability, integrity, and reliability. \nThe fastest and easiest way to obtain copies of GAO documents at no cost is \nthrough our website. Each weekday afternoon, GAO posts on its website newly \nreleased reports, testimony, and correspondence. You can also subscribe to \nGAO’s email updates to receive notification of newly posted products. \nThe price of each GAO publication reflects GAO’s actual cost of production and \ndistribution and depends on the number of pages in the publication and whether \nthe publication is printed in color or black and white. Pricing and ordering \ninformation is posted on GAO’s website, https://www.gao.gov/ordering.htm.  \nPlace orders by calling (202) 512-6000, toll free (866) 801-7077, or  \nTDD (202) 512-2537. \nOrders may be paid for using American Express, Discover Card, MasterCard, \nVisa, check, or money order. Call for additional information. \nConnect with GAO on X, LinkedIn, Instagram, and YouTube. \nSubscribe to our Email Updates. Listen to our Podcasts. \nVisit GAO on the web at https://www.gao.gov. \nContact FraudNet: \nWebsite:\n https://www.gao.gov/about/what-gao-does/fraudnet \nAutomated answering system: (800) 424-5454 \nSarah Kaczmarek, Managing Director, Media@gao.gov  \n \nA. Nicole Clowers, Managing Director, CongRel@gao.gov \n \nhttps://www.gao.gov/about/contact-us \nGAO’s Mission \nObtaining Copies of \nGAO Reports and \nTestimony \nOrder by Phone \nConnect with GAO \nTo Report Fraud, \nWaste, and Abuse in \nFederal Programs \nMedia Relations \nCongressional \nRelations \nGeneral Inquiries \nPlease P rint on Recycled Paper."
    }
  ]
}