{
  "filename": "IF13115.1.pdf",
  "total_pages": 3,
  "pages": [
    {
      "page": 1,
      "text": "https://crsreports.congress.gov \n \nSeptember 29, 2025\nDefense Primer: The Golden Dome for America\nThe Golden Dome for America (initially known as the Iron \nDome for America) is an initiative of the second Trump \nAdministration to develop an integrated air and missile \ndefense system. President Donald J. Trump introduced the \ninitiative in Executive Order (E.O.) 14186, dated January \n27, 2025. Golden Dome is to combine a range of \ncapabilities to create a “system of systems” to protect the \nUnited States from “aerial attacks from any foe,” according \nto a May 2025 press release from the Department of \nDefense (DOD), which is now “using a secondary \nDepartment of War designation” under E.O. 14347, dated \nSeptember 5, 2025. Congress provided $24.4 billion toward \nrelated efforts through the FY2025 reconciliation law (P.L. \n119-21, commonly referred to as the One Big Beautiful Bill \nAct). President Trump has referred to this sum as an initial \ndown payment or deposit toward the system, saying it \n“should be fully operational before the end of my term.” \nCongress has deliberated the rationale for and \nimplementation of Golden Dome. In hearings, interviews \nwith the press, and communication with DOD, some \nMembers have argued for and against the initiative, \nhighlighted concerns, raised questions, and requested \nadditional information. Members formed Senate and House \nGolden Dome caucuses. In July 2025, the Senate confirmed \nU.S. Space Force General Michael A. Guetlein for \nappointment to general while assigned to the position of \ndirect reporting program manager for DOD’s new Office of \nGolden Dome for America. Members have introduced \nGolden Dome-related legislation, such as the IRONDOME \nAct of 2025 (S. 435) and GOLDEN DOME Act of 2025 \n(H.R. 4107, S. 2142), and have included Golden Dome-\nrelated provisions in proposals for FY2026 defense \nauthorization legislation (H.R. 3838, S. 2296) and \nappropriations legislation (H.R. 4016, S. 2572).  \nThe Trump Administration’s Threat \nAssessment and Strategy \nE.O. 14186 states, “The threat of attack by ballistic, \nhypersonic, and cruise missiles, and other advanced aerial \nattacks, remains the most catastrophic threat facing the \nUnited States.” The E.O. further states that “the threat from \nnext-generation strategic weapons has become more intense \nand complex with the development by peer and near-peer \nadversaries of next-generation delivery systems and their \nown homeland integrated air and missile defense \ncapabilities.” The order does not name any foreign nations. \nIn testimony before the Senate Armed Services Committee \n(SASC), U.S. Air Force General Gregory M. Guillot, \ncommander of U.S. Northern Command, discussed missile \nthreats posed by China, Russia, and North Korea, as well as \nthe potential for Iran to develop “a North America-\nthreatening” intercontinental ballistic missile (ICBM). \nIn articulating a strategy to combat such threats, E.O. 14186 \nstates, “The United States will deter—and defend its \ncitizens and critical infrastructure against—any foreign \naerial attack on the Homeland.” This strategy differs from \nthe strategy articulated in DOD’s 2019 and 2022 Missile \nDefense Reviews (MDRs). Under this previous strategy, the \nUnited States sought to defend against rogue states, as well \nas accidental and unauthorized launches, while relying on \nnuclear weapons to deter China and Russia from striking \nU.S. territory. \nCurrent Capabilities \nGolden Dome may incorporate some or all current U.S. \nmissile defense systems, which include sensing, intercept, \nand command and control capabilities. It may update these \nsystems or augment them with new capabilities, or both. \nThe United States currently has several space-, air-, ground- \nand sea-based capabilities dedicated to sensing. \nCollectively, they detect, track, discriminate between, and \nprovide target-quality data on potential aerial threats. These \ncapabilities include the Long-Range Discrimination Radar \n(LRDR), Upgraded Early Warning Radars (UEWR), the \nArmy Navy/Transportable Radar (AN/TPY-2), Sea-Based \nX-Band Radar (SBX-1), and the Space-Based Infrared \nSystem (SBIRS). Some of these are legacy systems that \nhave been updated to track multiple types of threats \nsimultaneously and to reduce personnel requirements. Some \nare slated to be replaced by systems in development. \nSeveral also have space domain awareness applications. \nThe United States has a range of kinetic (or hit-to-kill) \nballistic missile defense capabilities, which have some \ncapability to intercept some non-ballistic threats, such as \ncruise missiles, hypersonic weapons, and large drones. \nThese include the Ground-based Midcourse Defense \nSystem (GMD), with interceptor sites at Alaska and \nCalifornia; ship- and ground-based Aegis systems; and \nground-based Terminal High Altitude Aerial Defense \n(THAAD) systems and Patriot missile defense systems.  \nThe United States also has capabilities for point defense—to \ndefend a specific location or asset—against cruise missiles \nand other low-flying threats. Specifically, the National \nCapital Region, which includes Washington, DC, is \ndefended by medium- and short-range air defenses, \nalongside manned aircraft. \nU.S. nonkinetic capabilities, such as electronic warfare and \ncyber capabilities, are also incorporated into the current \nmissile defense architecture."
    },
    {
      "page": 2,
      "text": "Defense Primer: The Golden Dome for America \nhttps://crsreports.congress.gov \nIssues for Congress \nCongress may consider whether or not to provide additional \nfunding for Golden Dome, and may consider how to \nexercise oversight of Golden Dome implementation. \nStatutory national missile defense policy. Congress may \nconsider whether or not to revise the “national missile \ndefense policy” (10 U.S.C. §5501). The current policy \nmirrors the previous homeland missile defense strategy as \narticulated in the 2019 and 2022 MDRs. It states, \nIt is the policy of the United States- \n(1) to research, develop, test, procure, deploy, and \nsustain, with funding subject to the annual \nauthorization of appropriations for National Missile \nDefense, systems that provide effective, layered \nmissile defense capabilities to defeat increasingly \ncomplex missile threats in all phases of flight; and \n(2) to rely on nuclear deterrence to address more \nsophisticated and larger quantity near -peer \nintercontinental missile threats to the homeland of \nthe United States. \nCongress has revised the national missile defense policy \npreviously. In 2019, Congress added language on the U.S. \nnuclear deterrent and expanded “complex ballistic missile \nthreat” to “complex missile threat” (P.L. 116-92). In 2023, \nCongress removed references to “rogue states” and defense \nof “allies, partners, and deployed forces” (P.L. 118-31).  \nThe SASC-reported National Defense Authorization Act for \nFiscal Year 2026 (NDAA; S. 2296) would further revise the \npolicy by removing paragraphs (1) and (2) and adding \nlanguage on defending U.S. citizens and critical \ninfrastructure from “foreign attack by increasingly complex \nballistic, hypersonic glide, and cruise missiles, and other \nadvanced aerial threats.” It would also add provisions about \nguaranteeing U.S. second-strike capability and cooperating \nwith allies and partners “to aid in the defense of allied and \npartner populations” and U.S. forces abroad. The House-\npassed FY2026 NDAA (H.R. 3838) would also revise the \npolicy. It would replace paragraphs (1) and (2) with \nlanguage about deterring and defending against “any \nforeign aerial attack on the homeland.”  \nAdequacy of information available to Congress. \nCongress may consider whether it has sufficient \ninformation to assess Golden Dome. While President \nTrump has announced some details—such as the inclusion \nof space-based interceptors—the Administration has not \npublicly provided a comprehensive picture of the systems, \nprocurement plans, timelines, and operational concepts \ninvolved. It has postponed an “industry summit” and \nreportedly directed defense officials not to speak about \nGolden Dome in certain public contexts. Committee reports \n(H.Rept. 119-162, S.Rept. 119-52) highlighted a need for \nmore information. \nDOD stated that “the Government plans to socialize” the \nGolden Dome architecture in September, though it is \nunclear whether this plan will be made public and, if so, to \nwhat extent. This architecture may describe the capabilities \nincluded; how these capabilities align with varied threats; \nand where, in what quantities, and along what timeline they \nmay be fielded. The reference architecture, requirements, \nand implementation plan that the January 2025 executive \norder directed the Secretary to submit to the President by \nMarch 2025 were not made public. Congress may consider \nwhether or not to require DOD to report certain details, and \nwhether or not to direct DOD to make all or some of those \ndetails unclassified and publicly available. \nCost and feasibility. Another issue for Congress concerns \nthe debate around the cost and feasibility of Golden Dome. \nCountering peer and near-peer capabilities could require an \nincrease in both U.S. missile defense sophistication and \ncapacity (i.e., quantity of interceptors and launchers, and \nassociated personnel and industrial base capacity). In May \n2025, President Trump stated that Golden Dome would cost \n$175 billion. Some observers have cited higher estimates, \nincluding some in the trillions of dollars, driven in part by \nthe inclusion of space-based interceptors. The \nCongressional Budget Office has estimated the cost of a \nlimited space-based interceptor system—sized only to \ncounter rogue threats—at more than $500 billion. \nHistorically, missile defense systems have exceeded initial \nbudget estimates and schedules.  \nWhile technological challenges have hampered past missile \ndefense efforts, General Guetlein has stated that all the \ntechnology needed to realize Golden Dome exists today. \nKinetic space-based intercept has been a focus of feasibility \ndebates, but missile defense faces other technical challenges \nincluding the degree to which systems can differentiate \nbetween missiles, debris, and decoys; provide sufficient \nwarning to intercept low-flying threats like cruise missiles \nand UAS; and contend with simultaneous diverse threats. \nStrategic implications. Some members have stated that \nsome of these systems could adversely affect U.S. security \nby destabilizing nuclear deterrence relationships with U.S. \nstrategic competitors and/or by contributing to a \ncompetition in nuclear-armed missiles. Congress may \nconsider how China and Russia have responded to Golden \nDome and may respond to future missile defense efforts. \nFor more, see CRS Insight IN12568, Golden Dome: \nPotential Strategic Stability Considerations for Congress. \nAcquisition and the defense industrial base (DIB). \nCongress may consider possible tradeoffs associated with \nvarious acquisition strategies that DOD could use for \ndifferent Golden Dome subsystems. These may include \ntradeoffs in cost, schedule, and acquisition risk. Congress \nmay also consider the adequacy of the U.S. DIB to build \nGolden Dome on the President’s three-year timeline and \nwhere DOD might invest in increasing capacity. To field \nnew technologies and pursue this timeline, DOD may \nconsider nontraditional acquisition options. Congress may \nassess existing acquisition oversight tools and mechanisms.  \nFor more about Golden Dome for America and U.S. air and \nmissile defense, see CRS Report R48584, Golden Dome: \nRelated CRS Products. \n \nHannah D. Dennis, Analyst in U.S. Defense Policy   \nIF13115"
    },
    {
      "page": 3,
      "text": "Defense Primer: The Golden Dome for America \nhttps://crsreports.congress.gov | IF13115 · VERSION 1 · NEW \n \n \nDisclaimer \nThis document was prepared by the Congressional Research Service (CRS). CRS serves as nonpartisan shared staff to \ncongressional committees and Members of Congress. It operates solely at the behest of and under the direction of Congress. \nInformation in a CRS Report should not be relied upon for purposes other than public understanding of information that has \nbeen provided by CRS to Members of Congress in connection with CRS’s institutional role. CRS Reports, as a work of the \nUnited States Government, are not subject to copyright protection in the United States. Any CRS Report may be \nreproduced and distributed in its entirety without permission from CRS. However, as a CRS Report may include \ncopyrighted images or material from a third party, you may need to obtain the permission of the copyright holder if you \nwish to copy or otherwise use copyrighted material."
    }
  ]
}