{
  "filename": "IN12544.1.pdf",
  "total_pages": 3,
  "pages": [
    {
      "page": 1,
      "text": "CRS INSIGHT \nPrepared for Members and  \nCommittees of Congress  \n  \n \n \n \n INSIGHTi \n \nThe Golden Dome (Iron Dome) for America: \nOverview and Issues for Congressional \nConsideration \nApril 16, 2025 \nOn January 27, 2025, President Trump issued Executive Order (EO) 14186, titled The Iron Dome for \nAmerica. The EO announced a shift in U.S. missile defense policy, expanding the scope of the homeland \nmissile defense mission and directing the Department of Defense (DOD) to develop “a next generation \nmissile shield.” The EO directed the Secretary of Defense to submit several deliverables to begin \nimplementing this new policy. In February 2025, the executive branch redubbed the project “Golden \nDome for America.” \nSome Members of Congress have asserted Golden Dome’s potential benefit to homeland defense and \nhave introduced legislation to support it. Other Members have questioned its possible effects on strategic \nstability—that is, the balance of capabilities and policies among potential adversaries that diminishes \nincentives for engaging in a nuclear arms race or nuclear use. Projected costs, which vary widely, may \nfeature prominently in debates over the FY2026 defense budget.  \nThe security benefits, strategic impact, and cost of Golden Dome depend in part on characteristics of the \nproposed missile shield that have not been publicly detailed. Parts of the EO are stated generally and \ncould be viewed as subject to interpretation. When Members of Congress have sought additional detail in \npublic hearings, DOD officials testifying have largely refrained from commenting. DOD may provide \nmore detail in the deliverables required by the EO, but it is unclear whether DOD will release these \ndeliverables publicly or share them with Congress. Several of these deliverables were due to the President \n60 days after the EO was issued. On March 27, it was reported that the President would receive three \noptions for the architecture the following week, and on April 9, a DOD official testified that the Secretary \nwas discussing options with the President. \nOverview of the Executive Order \nThe EO generally expanded the scope of the U.S. homeland missile defense mission, in terms of the \nactors and the threats that the United States intends to defend against. The order declared that it is U.S. \npolicy to “deter—and defend its citizens and critical infrastructure against—any foreign aerial attack on \nthe Homeland.” It specified that this policy includes defending “against ballistic, hypersonic, advanced \nCongressional Research Service \nhttps://crsreports.congress.gov \nIN12544"
    },
    {
      "page": 2,
      "text": "Congressional Research Service 2 \n  \ncruise missiles, and other next-generation aerial attacks from peer, near-peer, and rogue adversaries.” \nPreviously, under the Biden Administration, first Trump Administration, and Obama Administrations, \nhomeland missile defense policy focused on the threat from intercontinental ballistic missiles and \nemphasized developing capabilities to defend against strikes from rogue states, such as North Korea and \nIran, while relying on U.S. nuclear capabilities to deter attacks from peer and near-peer states, such as \nRussia and China. \nThe EO also directed the Secretary of Defense to take several actions. Within 60 days, the Secretary was \nto submit to the President \n• a “reference architecture,” “capabilities-based requirements,” and implementation plan \nfor the “next-generation missile shield”; \n• “a plan to fund this directive,” submitted with the Office of Management and Budget;  \n• “an updated assessment of the strategic missile threat to the homeland”; and \n• “a prioritized set of locations to progressively defend against a countervalue attack.” (The \nterm countervalue often refers to nonmilitary targets for nuclear weapons, such as cities \nand civilian population centers.) \nAlthough the EO focused on the U.S. homeland, it also directed the Secretary of Defense to review \ntheater missile defense capabilities. (U.S. policymakers often use the descriptor theater—or regional—to \ndifferentiate between defenses tailored for threats abroad versus the U.S. homeland.) The theater missile \ndefense review is to identify opportunities for increased international cooperation on missile defense and \nimproved defense of U.S. forward-deployed troops and allied territories, troops, and populations. \nPotential Issues for Congress \nAs Congress assesses the Trump Administration’s homeland missile defense plans and their potential \nbudgetary and strategic implications, it may consider the following issues: \n• How is homeland to be defined? The EO states that the United States will defend \nagainst “any foreign aerial attack on the homeland”; it also requires the Secretary of \nDefense to submit “a prioritized set of locations to progressively defend.” Congress may \nask whether the EO proposes defending the entire homeland or a limited set of targets. If \nthe former, how will DOD define the homeland? Neither the EO nor the 2019 Missile \nDefense Review (MDR), published under the first Trump Administration, includes a \ndefinition. The most recent MDR, published under the Biden Administration in 2022, \ndefined homeland missile defense as “the defense of the 50 states, all U.S. territories, and \nthe District of Columbia.”  \nIf the EO envisions protecting a limited set of locations, Congress may consider what criteria \nDOD uses to select those locations. Additionally, some Members may be reluctant to fund a \nshield that does not expressly aim to protect their constituents. \nAlthough both options would require overcoming technological challenges and investing \nsignificant resources, defending the entire homeland as defined in the 2022 MDR would likely \npose greater technological challenges and require more funding. Some observers have questioned \nthe feasibility or affordability of defending the entire homeland.  \n• What is an acceptable level of risk? Missile defense comes with a degree of risk, \nmeaning some degree of probability that defenses will not succeed in stopping every \nincoming enemy weapon. While observers might disagree on the extent to which that risk \ncan be reduced through improved technology and increased quantities of defensive \nsystems, most acknowledge that risk cannot be eliminated in its entirety. Congress may"
    },
    {
      "page": 3,
      "text": "Congressional Research Service 3 \nIN12544 · VERSION 1 · NEW \n• consider how much risk it considers acceptable in homeland missile defense. The answer \nto that question could have significant budgetary implications because it would affect the \nmix and quantity of systems. \n• What is the desired timeline? Some of the more sophisticated capabilities discussed in \nthe EO may have become more technologically feasible due to recent technological \nadvances in areas such as remote sensing, image processing, uncrewed aerial systems, \nminiaturization of components, and decreased space launch costs. Even so, the Golden \nDome architecture could take years to develop and build at the scale that may be \nsuggested. During that time, the Golden Dome initiative would compete for funding \nagainst other DOD funding priorities. \nCongress also may consider second-order issues, including potential responses from competitors, allies, \nand partners, and requirements for basing, launch platforms, industrial capacity, and manpower. The \noutcomes for these issues likely depend in part on answers to the aforementioned potential questions. \n \nAuthor Information \n \nHannah D. Dennis \nAnalyst in U.S. Defense Policy \n \n  \n \n \n \nDisclaimer \nThis document was prepared by the Congressional Research Service (CRS). CRS serves as nonpartisan shared staff \nto congressional committees and Members of Congress. It operates solely at the behest of and under the direction of \nCongress. Information in a CRS Report should not be relied upon for purposes other than public understanding of \ninformation that has been provided by CRS to Members of Congress in connection with CRS’s institutional role. \nCRS Reports, as a work of the United States Government, are not subject to copyr ight protection in the United \nStates. Any CRS Report may be reproduced and distributed in its entirety without permission from CRS. However, \nas a CRS Report may include copyrighted images or material from a third party, you may need to obtain the \npermission of the copyright holder if you wish to copy or otherwise use copyrighted material."
    }
  ]
}