{
  "filename": "NAVSEA-OrgChart-October2024.pdf",
  "total_pages": 1,
  "pages": [
    {
      "page": 1,
      "text": "NAVAL NUCLEAR PROPULSIONSEA 08 – ADM W. HOUSTONCOMNAVSUP SYSCOM    \nCOMNAVSUP SYSCOM    (ADDU FOR LOG SPT)\nPEO AIRCRAFT CARRIERSRADM C. MOTONJ. MEYER (SES)\nPEO INTEGRATED WARFARE SYSTEMSRDML T. DICKINSONT. HENDREY (SES)H. BERKOFF (SES)J. BOWARD (SES)\nPEO SHIPSRADM T. ANDERSONT. RIVERS (SES)J. BOWARD (SES)\nPEO UNMANNED & SMALL COMBATANTSRDML K. SMITHM. KIRKENDALL (SES)\nEXECUTIVE DIRECTOR  SEA 00B C. MILLER (SES)\nCHIEF OF NAVAL OPERATIONSOCTOBER 2024\nNUCLEAR POWER TRAINING UNIT\nCHIEF OF STAFFSEA COSVACANTCommand Leadership\nCOMMAND DEPUTY EEOSEA 00 ED&IC. WILLIAMS\nCOMMAND JUDGE ADVOCATESEA 00JCDR T. HUFFSTETLER\nCOMMAND MASTER CHIEFSEA CMCCMDCM B. SCHIMMEL\nEXECUTIVE ASSISTANTSEA 00EACAPT J. HALL\nPEO STRATEGIC SUBMARINESRDML T. WEEKSM. SERMON (SES)\nCOMMAND CLIMATE SPECIALISTSEA 00 CCSAECS A. RUSSELL\nSTAFF CODES\nOFFICE OF COUNSELSEA 00LR. CRESSY (SES)\nNAVY EXPERIMENTAL   DIVING UNIT\nSUPERVISOR OF SALVAGE & DIVINGSEA 00CCAPT S. SUAREZM. MCCLATCHEY (SES)\nPEO UNDERSEA WARFARE SYSTEMSRDML D. ADAMSM. MCCLATCHEY (SES)\nSUBMEPPS. LINK (SES)\nPEO ATTACK SUBMARINESRDML J. RUCKERL. RADOCHA (SES)S. LINK (SES)\nINSPECTOR GENERALSEA 00NL. SUCH (acting)\nINDUSTRIAL FIRE SAFETY ASSURANCE GROUPSEA 00FSCAPT R. VALLETTA (acting)\nWARFIGHTING READINESSSEA 00RRDML R. DODSON\nASN, RD&A\nCOMMANDERNAVAL SEA SYSTEMS COMMANDSEA 00 VADM J. DOWNEYCOMNAVWAR SYSCOM   \nCOMNAVWAR SYSCOM   (ADDU FOR C4I)\nDIRECTORATES\nECHELON III\nOTHER\nPEOsLEGEND\nDRPM AUKUS I&ARDML L. REIFSTECKM. ATKINS (SES)\nCARRIER PLANNING ACTIVITY\nINDUSTRIALOPERATIONSSEA 04RDML S. BROWNK. DAVIS (SES)\nCOMMANDERNAVAL SURFACE WARFARE CENTERNAVAL UNDERSEA WARFARE CENTERRDML T. EVANSM. IRVINE (SES)\nCONTRACTSSEA 02K. BOYLES (SES)CAPT R. PERRY\nNAVAL SYSTEMS ENGINEERING & LOGISTICSSEA 05RDML P. SMALLT. PEROTTI (SES)\nTOTAL FORCE & CORPORATE OPERATIONSSEA 10J. REESE (SES)NAVY REGIONAL MAINTENANCE CENTER  \nCOMMANDERNAVY REGIONAL MAINTENANCE CENTER  RADM W. GREENEE. LIND (SES)\nUNDERSEAWARFARESEA 07RDML T. WEEKSS. LINK (SES)\nAEGIS TECHNICAL  REPRESENTATIVE\nSURFACE COMBAT SYSTEMS CENTER\nAEGIS BMDP. MANN (SES)\nSURFMEPPSURFACE SHIP MAINTENANCE,  \nSURFACE SHIP MAINTENANCE,  MODERNIZATION & SUSTAINMENTSEA 21RADM W. GREENE L. BONACIC (SES)\nNAVAL SHIPYARDS\nCYBER ENGINEERING & DIGITAL TRANSFORMATIONSEA 03M. HERMOSILLAVACANT\nCOMPTROLLERSEA 01D. SULLIVAN (SES)CAPT C. KADING\nNAVAL ORDNANCE SAFETY& SECURITY ACTIVITY\nSAFETY & REGULATORY COMPLIANCESEA 09S. MCCREARY (SES)K. CLARK (SSTM)(acting)\nSUPSHIPS\nSUPERVISOR OF SHIPBUILDINGK. DAVIS (SES)\nINACTIVE SHIPS MANG'T OFFICE\nRASO\nNAVSEA VICECOMMANDER (ACTING) CAPT B. METCALF\n NAVSEA Command Leadership – structured transcription with relationships\n\nSource context – October 2024 organizational snapshot for Naval Sea Systems Command. Chain of command centers on the Commander, NAVSEA, with Program Executive Offices and Directorates alongside Echelon III field activities and staff codes. \n\n\nTop chain of command\n\nAssistant Secretary of the Navy for Research, Development and Acquisition – senior civilian authority for acquisition. \n\n\nCommander, Naval Sea Systems Command – SEA 00 – VADM J. Downey – overall head of NAVSEA. \n\n\nNAVSEA Vice Commander – acting – CAPT B. Metcalf – deputy to the Commander. \n\n\nChief of Staff – SEA COS – vacant – manages headquarters staff execution. \n\n\nDirect report staff to the Commander\n\nExecutive Director – SEA 00B – C. Miller – senior civilian executive. \n\n\nExecutive Assistant – SEA 00EA – CAPT J. Hall – front office coordination. \n\n\nCommand Master Chief – SEA CMC – CMDCM B. Schimmel – senior enlisted advisor. \n\n\nCommand Judge Advocate – SEA 00J – CDR T. Huffstetler – legal advisor. \n\n\nOffice of Counsel – SEA 00L – R. Cressy – civilian legal counsel function. \n\n\nCommand Deputy for Equal Employment Opportunity and Equity, Diversity and Inclusion – SEA 00 EDI – C. Williams – workforce equity leadership. \n\n\nCommand Climate Specialist – SEA 00 CCS – AECS A. Russell – climate and culture support. \n\n\nInspector General – SEA 00N – L. Such – acting – audits and investigations. \n\n\nSupervisor of Salvage and Diving – SEA 00C – CAPT S. Suarez – technical salvage and diving authority; paired with Navy Experimental Diving Unit as related activity. \n\n\nIndustrial Fire Safety Assurance Group – SEA 00FS – CAPT R. Valletta – acting – safety oversight across industrial sites. \n\n\nWarfighting Readiness – SEA 00R – RDML R. Dodson – cross-cutting readiness coordination. \n\n\nProgram Executive Offices that partner with NAVSEA\n\nThese PEOs deliver acquisition programs and integrate with NAVSEA for lifecycle execution. Each PEO head reports through the acquisition chain and collaborates with NAVSEA directorates and field activities.\n\nPEO Aircraft Carriers – RADM C. Moton – with J. Meyer – SES – program leadership for carriers. \n\n\nPEO Ships – RADM T. Anderson – with T. Rivers and J. Boward – SES – surface ship construction and modernization. \n\n\nPEO Unmanned and Small Combatants – RDML K. Smith – with M. Kirkendall – SES – unmanned systems and small combatants. \n\n\nPEO Integrated Warfare Systems – RDML T. Dickinson – with T. Hendrey and H. Berkoff – SES – combat system integration; J. Boward also listed as SES linkage. \n\n\nPEO Strategic Submarines – RDML T. Weeks – with M. Sermon – SES – strategic submarine programs. \n\n\nPEO Attack Submarines – RDML J. Rucker – with L. Radocha and S. Link – SES – attack submarine programs. \n\n\nPEO Undersea Warfare Systems – RDML D. Adams – with M. McClatchey – SES – undersea systems portfolio; Submepps Link – SES – maintenance and modernization planning. \n\n\nDRPM AUKUS Industrialization and Acceleration – RDML L. Reifsteck – with M. Atkins – SES – trilateral AUKUS industrial initiatives. \n\n\nAssociated command linkages noted on the chart\n\nCOMNAVSUP SYSCOM – additional duty for logistics support to NAVSEA programs. \n\n\nCOMNAVWAR SYSCOM – additional duty for C4I integration with NAVSEA systems. \n\n\nNaval Nuclear Propulsion – SEA 08 – ADM W. Houston – independent authority that interfaces with NAVSEA for nuclear ships; includes Nuclear Power Training Unit. \n\n\nNAVSEA Directorates – headquarters functional leadership\n\nThese directorates report through the Commander and Executive Director and support PEOs and field activities.\n\nSEA 01 – Comptroller – D. Sullivan – SES – with CAPT C. Kading – financial management. \n\n\nSEA 02 – Contracts – K. Boyles – SES – with CAPT R. Perry – contracting authority. \n\n\nSEA 03 – Cyber Engineering and Digital Transformation – M. Hermosilla – with deputy slot listed vacant – digital modernization. \n\n\nSEA 04 – Industrial Operations – RDML S. Brown – with K. Davis – SES – shipyard and maintenance industrial base management. \n\n\nSEA 05 – Naval Systems Engineering and Logistics – RDML P. Small – with T. Perotti – SES – systems engineering authority and logistics. \n\n\nSEA 07 – Undersea Warfare – RDML T. Weeks – with S. Link – SES – undersea warfare portfolio alignment with PEOs. \n\n\nSEA 09 – Safety and Regulatory Compliance – S. McCreary – SES – with K. Clark – acting SSTM – ordnance safety authority noted separately below. \n\n\nSEA 10 – Total Force and Corporate Operations – J. Reese – SES – workforce and corporate functions. \n\n\nSEA 21 – Surface Ship Maintenance, Modernization and Sustainment – RADM W. Greene – with L. Bonacic – SES – life-cycle sustainment for surface fleet. \n\n\nEchelon III and other major field activities aligned to NAVSEA\n\nThese commands execute engineering, test, and maintenance missions and are operationally aligned with NAVSEA.\n\nNaval Surface Warfare Center – command leadership not explicitly named in the snippet – executes RDT and E for surface systems. \n\n\nNaval Undersea Warfare Center – RDML T. Evans – with M. Irvine – SES – executes RDT and E for undersea systems. \n\n\nNavy Regional Maintenance Center – Commander – RADM W. Greene – with E. Lind – SES – regional maintenance oversight. \n\n\nNaval Shipyards – shipyard enterprise under Industrial Operations – performs depot-level maintenance. \n\n\nSupervisor of Shipbuilding – Supships – K. Davis – SES – government presence at private shipyards. \n\n\nInactive Ships Management Office – lifecycle disposition authority for retired vessels. \n\n\nCarrier Planning Activity – planning for aircraft carrier availabilities. \n\n\nAegis Technical Representative – technical liaison for Aegis weapon system. \n\n\nSurface Combat Systems Center – integration and test site for combat systems. \n\n\nAegis Ballistic Missile Defense – P. Mann – SES – ballistic missile defense element of Aegis enterprise. \n\n\nSurfmepp – Surface Maintenance Engineering Planning Program – class maintenance planning for surface ships. \n\n\nNavy Experimental Diving Unit – partner activity to Supsalv for diving standards and research. \n\n\nNaval Ordnance Safety and Security Activity – independent safety authority called out under Safety and Regulatory Compliance. \n\n\nRelationship summary – how the pieces fit\n\nThe Commander, NAVSEA, leads headquarters directorates that provide engineering, contracting, industrial operations, logistics, digital, safety, and corporate support. These directorates coordinate with PEOs to deliver and sustain platforms and systems. \n\n\nPEOs manage acquisition programs for carriers, ships, undersea systems, submarines, unmanned systems, and warfare systems. They rely on NAVSEA directorates for authorities and on Echelon III warfare centers, shipyards, and regional maintenance centers for execution. \n\n\nStaff codes and special offices provide legal, counsel, equity and inclusion, climate, readiness, inspection, salvage and diving, and industrial fire safety functions that support the Commander and the enterprise. \n\n\nCross-SYSCOM linkages indicate close coordination with Naval Supply Systems Command for logistics and Naval Information Warfare Systems Command for C4I integration. Naval Nuclear Propulsion maintains independent authority while interfacing with NAVSEA for nuclear fleet matters and training. \n\n\nLegend cues noted in the chart\n\nPEOs – program acquisition leadership elements.\n\nDirectorates – headquarters functional codes SEA 01 through SEA 21 and others.\n\nEchelon III – field activities executing engineering, maintenance, and integration.\n\nOther – specialized authorities and technical representatives supporting NAVSEA missions."
    }
  ]
}