{
  "filename": "Overview_(Part_1).pdf",
  "total_pages": 4,
  "pages": [
    {
      "page": 1,
      "text": "Department of Defense\nOperation and Maintenance, Defense-Wide\nFiscal Year (FY) 2026 Budget Estimates\nOverview \n1\n$ in Thousands\nFY 2024\nActuals\nPrice\nChange\nProgram\nChange\nFY 2025\nEnacted\nPrice\nChange\nProgram\nChange\nFY 2026\nRequest\nO&M, D-W 61,187,766 1,764,194 -9,741,128 53,210,833 1,112,107 1,612,778 55,935,718\n  \nThe Operation and Maintenance, Defense-Wide funding request supports critical Department-wide functions and transformational efforts for the \nSecretary, Military Departments, and warfighters. The funding pays for common information services and system sustainment, contract \nadministration and audits, family support programs, and administrative functions for the Military Departments. This funding supports the activities \nof the United States Special Operations Command (USSOCOM), the United States Cyber Command (USCYBERCOM), numerous Combat \nSupport Agencies, policy and oversight Agencies, and three Intelligence Agencies."
    },
    {
      "page": 2,
      "text": "Department of Defense\nOperation and Maintenance, Defense-Wide\nFiscal Year (FY) 2026 Budget Estimates\nOverview \n2\nBudget/Program Highlights\n \nChanges between FY 2025 and FY 2026 include (dollars in millions) Overview\nFY 2025 column of the FY 2025 Budget Request 54,173\nAdjusted FY 2025 53,211\nNet program changes in Defense Agencies (unclassified) -187\nNet pricing changes in Defense Agencies (unclassified) 622\nPrice and program growth in classified programs 2,290\nFY 2026 President's Budget Request 55,936\nClassified Programs Major Changes:\nChanges in classified programs may be found in Volume III of the Operation and Maintenance, Defense-Wide justification entitled \"Other \nPrograms, Classified Justification Book.\" \n  \nDefense Agency Programs FY 2026 Highlights:\nHighlights of Defense Agency FY 2026 funding include program changes of:  \n \n•$+218.678 million (DCSA):  The DCSA request includes operational security areas such as Industrial, Personnel, and Personnel Security \nfor Industry.  Resources address requirements in section 847 of the National Defense Authorization Act for FY 2020 for foreign ownership, \ncontrol, or influence (FOCI) analysis of pre-award DoD contracts for non-supply items valued at $5 million or more and increased National \nIndustrial Security Program (NISP) oversight and facility clearance issuance along with increased costs for personnel security product and \nservices associated with the initial investigation and continuous vetting of cleared contractors supporting critical technology development \nfor the DoD and 35 NISP signatories.  Also, DCSA received a functional transfer for the DCSA National Background Investigation Services \n(NBIS).  This funding transfer includes 104 FTEs from the DCSA Working Capital Fund to the DCSA's non-cyber appropriated funds line \nitem to support the operations and sustainment of the NBIS system.\n  \n•$+514.441 million (DISA):  The DISA increase supports key functions to include the Defense Information Systems Network (DISN) \nenterprise activities, the 4th Estate Network Optimization (4ENO), the Department of Defense Information Network Engineering Services \n(DoDIN ES), and the Joint Service Provider (JSP).  Under the DISN framework, the Multi-Level Secure Video and Voice (MLSV2), \ndeployed as an initial operating capability, now requires sustainment of the initial prototype as it provides the network and security \noperations.  MLSV2 supports the Secretary of Defense priority “Rebuild the Military,” facilitating the transition from outdated existing \nclassified systems as it improves the information available to the warfighter to gain decision and competitive advantage in high-tempo, \nmulti-domain operations.  The request also enables the ability to provide added layers of protection to the DISN Core infrastructure by"
    },
    {
      "page": 3,
      "text": "Department of Defense\nOperation and Maintenance, Defense-Wide\nFiscal Year (FY) 2026 Budget Estimates\nOverview \n3\nallowing DISA to detect and resolve combatant command vulnerabilities through acquiring assets, systems, and networks, whether \nphysical or virtual, to eliminate vulnerabilities that would have debilitating effects on critical infrastructure.  The increase for the 4ENO \ninitiative provides planning, design, migration, and partial sustainment for Defense Agencies and Field Activities (DAFAs) migrating to \nDoDNet in FY 2026.  Migrating DAFAs to DoDNet is a key element of the DoD Zero Trust initiative.  Funding will also support the \npurchase of High Impact Zero Trust Microsoft Defender Licenses.  The increase for the Joint Service Provider (JSP) will support \npurchases, including cables and switches, to raise the quality of Pentagon facilities to a level that promotes effective and efficient DoDNet \nmigration for the JSP.\n  \n•$+94.664 million (DSCA):  The DSCA request includes Taiwan operational support which is comprised of two key areas: The Taiwan \nSecurity Cooperation Initiative (TSCI) and the Taiwan Drawdown Stock Replacement.  TSCI is intended to support DoD efforts to \nstrengthen Taiwan’s self-defense capabilities, thereby enhancing deterrence, preserving peace and stability across the Taiwan Strait, and \nmitigating risk to the U.S. Joint Force.  The Taiwan Drawdown Stock Replacement is intended to support the replacement of defense \narticles transferred to Taiwan from DoD stocks through the Presidential Drawdown Authority, or the TSCI.  Funds will bolster joint force \nreadiness and enable new procurements to replace equipment provided to Taiwan.\n  \n•$+109.312 million (MDA):  The MDA increase includes support for the Aegis Ballistic Missile Defense, Missile Defense System Radars, \nand the Terminal High Altitude Area Defense (THAAD) programs.  Funding for Aegis Ballistic Missile Defense provides Standard Missile-3 \n(SM-3) provision Item Spares to support SM-3 recertification and repair based on the most recent fleet schedule and SM-3 sustainment \nprojections, SM-3 Block IA/IB recertifications and procurement of Flight Terminal System Circuit Card Assemblies that will be back fit into \nSM-3 IB missiles in support of U.S. Central Command (USCENTCOM) military operations, force protections, and deterrence activities, and \noperational readiness support for real-world combat operations, readiness analysis, system-level testing, maintenance builds, post-\ncertification threat adaptation data updates, and ship software maintenance for Ballistic Missile Defense (BMD) 4.1 and BMD 5.1, ensuring \nalignment with U.S. Navy ship availability schedules.  Funding for Missile Defense System Radars provides improved repair and return \ncapabilities and refurbishment activities at Letterkenny Army Depot for Cooling Equipment Units, Prime Power Units, and Electronic \nEquipment Units to support the reliability and sustainability of the aging Army Navy/Transportable Radar Surveillance and Control-2 radar \nfleet.  Funding for THAAD provides an equipment reset of one battery after returning to the U.S. in FY 2026, the procurement of \ninterceptor repair parts, and accelerated repair schedules in support of USCENTCOM military operations, force protection, and deterrence \nactivities. These additional resources are required to maintain THAAD Battery readiness and provide the ability to respond to regional \nrequirements rapidly. \n  \n•$+116.668 million (SOCOM):  The SOCOM request includes the Special Operations Forces Intelligence Systems program and its special \noperations intelligence support to the United States Special Operations Command (USSOCOM) Headquarters, Components, and the \nTheatre Special Operations Commands that lie outside the scope of the Defense Intelligence Agency Military Intelligence Program's \nintelligence support to the Combatant Command program.  Funding also includes the Zero Trust Architecture initiative which supports \nPOTUS Executive Order (EO) 13800, Strengthening the Cybersecurity of Federal Networks and Critical Infrastructure; EO 14028, \nImproving the Nation's Cybersecurity; OMB Memorandums M-22-09, M-22-16; Section 1528 of the National Defense Authorization Act; \nand the DoD Chief Information Officer Capability Planning Guidance to meet specific cybersecurity standards and objectives.  USSOCOM"
    },
    {
      "page": 4,
      "text": "Department of Defense\nOperation and Maintenance, Defense-Wide\nFiscal Year (FY) 2026 Budget Estimates\nOverview \n4\nis responsible for 140 unclassified National Security Systems (NSS), and 216 secret-level systems that meet the DoDI 8510.01 Access \nand Authorize systems.  Of these 356 NSS systems, 17 are global enterprise networks.\n  \n•$+297.335 million (TJS):  The TJS increase includes support for ELITE CONSTELLATION.  This large-scale global exercise will stress \nglobal integration of the force across multiple levels of command and control in the conduct of Joint All-Domain Operations.  The increased \nfunding enhances joint exercises within INDOPACOM and select Combatant Commands (CCMDs) to execute ELITE CONSTELLATION, \na campaign of exercise and training events that collectively prepare the Joint Force for a transregional, multi-functional, and multi-domain \nconflict against a near-peer adversary.  ELITE CONSTELLATION is a multi-year campaign that provides a framework for the Joint Force \nto conduct globally integrated, multi-domain operations to strengthen warfighting readiness and lethality, enabling the Joint Force to adapt \nto the changing character of war and deter or defeat global threats.  ELITE CONSTELLATION operationalizes the Joint Warfighting \nConcept (JWC) through integrated events across the DoD and with mission partners.  This CCMD joint exercise directly links to the \nSecretary’s priorities to Maintain Core Readiness, Deter China, and Defend the Homeland."
    }
  ]
}