{
  "filename": "R48584.2.pdf",
  "total_pages": 5,
  "pages": [
    {
      "page": 1,
      "text": "Golden Dome: Related CRS Products \nJune 24, 2025 \nCongressional Research Service \nhttps://crsreports.congress.gov \nR48584"
    },
    {
      "page": 2,
      "text": "Golden Dome: Related CRS Products \n \n \n  \nContents \nGolden Dome (Specific) ........................................................................................................... 1 \nAir and Missile Defense (General) ............................................................................................ 1 \nRelated Defense Agencies ......................................................................................................... 2 \nThreat Assessments ................................................................................................................... 2 \nOther Related Products ............................................................................................................. 2 \n \nContacts \nAuthor Information .......................................................................................................................... 3"
    },
    {
      "page": 3,
      "text": "Golden Dome: Related CRS Products \n \nCongressional Research Service   1 \nn January 27, 2025, President Donald J. Trump issued an executive order directing the \nDepartment of Defense to develop and implement a homeland missile defense architecture \nto defend against “ballistic, hypersonic, advanced cruise missiles, and other next-\ngeneration aerial attacks from peer, near-peer, and rogue adversaries.”1 On May 20, 2025, \nPresident Trump asserted that this “Golden Dome for America” concept would cost $175 billion, \nand be completed by the end of his term.2 Other cost and timeline estimates have exceeded those \nof President Trump.3 The Golden Dome concept and the Trump Administration’s approach to \nhomeland missile defense introduces several potential oversight and funding issues for Congress. \nThis report compiles a selection of CRS products on various aspects of U.S. homeland air and \nmissile defense. To contact the authors of these CRS products, congressional staff may use the \ncontact information provided in the links below. \nGolden Dome (Specific) \nCRS Insight IN12544, The Golden Dome (Iron Dome) for America: Overview and Issues for \nCongressional Consideration, by Hannah D. Dennis \nCRS Insight IN12568, Golden Dome: Potential Strategic Stability Considerations for Congress, \nby Anya L. Fink  \nAir and Missile Defense (General) \nCRS In Focus IF10541, Defense Primer: U.S. Ballistic Missile Defense, by Hannah D. Dennis \nCRS In Focus IF11623, Hypersonic Missile Defense: Issues for Congress, by Hannah D. Dennis, \nJennifer DiMascio, and Kelley M. Sayler \nCRS Report R48477, Department of Defense Counter Unmanned Aircraft Systems: Background \nand Issues for Congress, by Daniel M. Gettinger \nCRS In Focus IF11882, Defense Primer: Directed-Energy Weapons, by Kelley M. Sayler \nCRS Report R46925, Department of Defense Directed Energy Weapons: Background and Issues \nfor Congress, coordinated by Kelley M. Sayler \n \n1 Executive Order 14186 of January 27, 2025, “The Iron Dome for America,” 90 Federal Register 8767, February 3, \n2025, https://www.federalregister.gov/documents/2025/02/03/2025-02182/the-iron-dome-for-america. The Trump \nAdministration initially called this effort “The Iron Dome for America,” and subsequently renamed it “The Golden \nDome for America.” See, for example, U.S. Department of Defense, “Secretary of Defense Pete Hegseth Statement on \nGolden Dome for America,” press release, May 20, 2025, https://www.defense.gov/News/Releases/Release/Article/\n4193417/secretary-of-defense-pete-hegseth-statement-on-golden-dome-for-america/.  \n2 The White House, “President Trump Makes an Announcement with the Secretary of Defense,” video, May 20, 2025, \nhttps://www.whitehouse.gov/videos/president-trump-makes-an-announcement-with-the-secretary-of-defense/.  \n3 For example, in May 2025, the Congressional Budget Office (CBO) updated findings from 2004 and 2012 studies that \nassessed the cost of various space-based interceptor (SBI) architectures to counter the North Korean missile threat. \n(President Trump has mentioned SBIs will be part of Golden Dome.) CBO found that, depending on the desired \narchitecture and certain assumptions made about SBI technology and despite decreasing launch costs, the notional \narchitectures assessed in the 2004 and 2012 studies could cost from $160.7 billion to $542.4 billion over 20 years. In \naddition, these notional constellations were not sized for the threat posed by North Korea in 2025, nor the threat posed \nby all aerial threats in 2025. CBO noted that “North Korea is probably now capable of launching attacks with enough \nICBMs to overwhelm the SBI defenses examined in [previous studies].” Letter from Phillip L. Swagel, director of \nCBO, to Senator Deb Fischer, chair, Subcommittee on Strategic Forces, Senate Committee on Armed Services, and \nSenator Angus S. King Jr., ranking member, Subcommittee on Strategic Forces, Senate Committee on Armed Services, \nMay 5, 2025, https://www.cbo.gov/system/files/2025-05/61237-SBI.pdf. \nO"
    },
    {
      "page": 4,
      "text": "Golden Dome: Related CRS Products \n \nCongressional Research Service   2 \nCRS Report R47643, Guam: Defense Infrastructure and Readiness, by Andrew Tilghman \nCRS Report RL33745, Navy Aegis Ballistic Missile Defense (BMD) Program: Background and \nIssues for Congress, by Ronald O'Rourke \nCRS In Focus IF12645, The Terminal High Altitude Area Defense (THAAD) System, by Andrew \nFeickert \nRelated Defense Agencies \nCRS Report R47620, Canada: Background and U.S. Relations, coordinated by Peter J. Meyer \n(see, in particular, the section on the North American Aerospace Defense Command, or NORAD) \nCRS In Focus IF12610, Defense Primer: The United States Space Force, by Hannah D. Dennis \nCRS In Focus IF12840, Defense Primer: U.S. Space Command (SP ACECOM), by Robert Switzer \nand Jennifer DiMascio  \nCRS In Focus IF12981, Defense Primer: U.S. Strategic Command (STRATCOM), by Anya L. \nFink and Robert Switzer \nThreat Assessments \nCRS In Focus IF11737, China: Nuclear and Missile Proliferation, by Paul K. Kerr  \nCRS In Focus IF12621, Congressional Commission on the U.S. Strategic Posture, by Anya L. \nFink \nCRS In Focus IF11459, Defense Primer: Hypersonic Boost-Glide Weapons, by Kelley M. Sayler \nCRS Report R45811, Hypersonic Weapons: Background and Issues for Congress, by Kelley M. \nSayler \nCRS In Focus IF13035, Iran’ s Ballistic Missile Programs: Background and Context, by Daniel \nM. Gettinger and Clayton Thomas \nCRS In Focus IF10472, North Korea’ s Nuclear Weapons and Missile Programs, by Mary Beth D. \nNikitin \nCRS In Focus IF12672, Russia’ s Nuclear Weapons, by Anya L. Fink \nCRS In Focus IF12964, U.S.-Russian Nuclear Arms Control: Overview and Potential \nConsiderations for Congress, by Anya L. Fink \nOther Related Products \nCRS In Focus IF12817, Defense Primer: Joint Capabilities Integration and Development System \n(JCIDS), by Alexandra G. Neenan \nCRS In Focus IF11697, Defense Primer: Nuclear Command, Control, and Communications \n(NC3), by Anya L. Fink \nCRS In Focus IF10519, Defense Primer: Strategic Nuclear Forces, by Anya L. Fink \nCRS Report R48559, Proposed Spectrum Provisions in the House Reconciliation Bill (H.R. 1), by \nJill C. Gallagher  \nCRS In Focus IF12350, Repurposing 3.1-3.55 GHz Spectrum: Issues for Congress, by Jill C. \nGallagher"
    },
    {
      "page": 5,
      "text": "Golden Dome: Related CRS Products \n \nCongressional Research Service  R48584 · VERSION 2 · NEW 3 \n \nAuthor Information \n \nHannah D. Dennis \nAnalyst in U.S. Defense Policy \n    \n Brendan W. McGarry \nSection Research Manager \n    \n \n \nDisclaimer \nThis document was prepared by the Congressional Research Service (CRS). CRS serves as nonpartisan \nshared staff to congressional committees and Members of Congress. It operates solely at the behest of and \nunder the direction of Congress. Information in a CRS Report should not be relied upon for purposes other \nthan public understanding of information that has been provided by CRS to Members of Congress in \nconnection with CRS’s institutional role. CRS Reports, as a work of the United States Government, are not \nsubject to copyright protection in the United States. Any CRS Report may be reproduced and distributed in \nits entirety without permission from CRS. However, as a CRS Report may include copyrighted images or \nmaterial from a third party, you may need to obtain the permission of the copyright holder if you wish to \ncopy or otherwise use copyrighted material."
    }
  ]
}