[
  {
    "id": "1e9f7f65d4",
    "title": "SSC External Org Chart (Apr 2025)",
    "url": "",
    "doc_date": "2025-04-30",
    "pages": [
      {
        "pageno": 2,
        "text": "SPACE SYSTEMS COMMAND #SpaceStartsHere Assured Access to Space (AATS) (SSC/AA) Engineering Financial Management Intelligence Sustainment Talent Management Tech & Innovation Contracting Ops Integration Staff Functions As of 4 Apr 2025 Program Executive Officer and Director Assured Access to Space Brig Gen K. Panzenhagen Deputy PEO Col D. Pentecost IMA to the Director Col M. Shiue Space Mobility Logistics AAA Col J. Bulson Mission Focus Areas • Point-to-Point • On-Orbit NH-04 Deputy Director Mr. W. Jackim SEL CMSgt C. Apodaca Assigned Group& Squadrons • 45 MDG 45 HCOS 45 OMRS • 1 ROPS • 5 SLS • 45 CES • 45 FSS • 45 LRS • 45 CONS • 45 SFS • 45 CPTS • 45 WS • DET 2 –Ascension • Delta Staff Agencies Space Launch Delta 30 Col M. Shoemaker Assigned Group & Squadrons • 30 MDG 30 HCOS 30 OMRS • 2 ROPS • 2 SLS • 30 CES • 30 FSS • 30 LRS • 30 CONS • 30 SFS • 30 CPTS • 30 OSS • Delta StaffAgencies SEL CMSgt J. Harris Launch Execution AAL Col J. Horne Mission Focus Areas • ULA Senior Lead • SpaceX Senior Lead • Atlas / Delta Systems • Vulcan Systems • Falcon Systems SEL SMSgt C. Wall SML Mission Solutions AAM SML Col M. Flahive Mission Focus Areas • Rocket Systems Launch Program • Payload Management & Mission Integration (MMO) • Future Procurement (NSSL Phase 3) • Enterprise Acquisitions Space Launch Delta 45 Brig Gen K. Panzenhagen"
      },
      {
        "pageno": 3,
        "text": "SPACESYSTEMS COMMAND #SpaceStartsHere Battle Management, Command, Control, Communication, and Space Intelligence (BMC3I) (SSC/BC) Acquisition Logistics Finance Engineering Operations Management Contracting Staff Functions Battle Management SML Col J. West Mission Focus Areas • Advanced Battle Management • Space Defense & Theater Support • Battle Management Integration Tactical Command, Control & Communications SML Col P. Little Mission Focus Areas • Antenna Services • Rapid Resilient Command and Control • Global Mission Data Dominance • Advanced Capabilities Acquisition Logistics Finance Integration & Engineering Operations Management Contracting Program Executive Officer and Director Battle Management, Command, Control, Communication, and Space Intelligence Ms. S. Pallone Data Transport Product Support PSM NH-04 Ms. T. Yingling Mission Focus Areas • Satellite Control Network Ops and Sustainment As of 1 Apr 2025 IMA to the PEO Col O. Perea Deputy PEO Mr. M. Sanjume NH-04 Deputy Director Col S. In Chief Technology Officer Mr. B. DeLong NH-04 Mission Delta 2 Col G. Peterson 2nd Sustainment Squadron SML PEO Authority Only"
      },
      {
        "pageno": 4,
        "text": "SPACE SYSTEMSCOMMAND #SpaceStartsHere MilComm & PNT (MCPNT) (SSC/CG) SML Strategic SATCOM Col A. Ashby Engineering Staff Functions Deputy Director Col R. Rose Program Executive Officer MilComm & PNT Mr. C. DeLaPena, Jr. SES Deputy PEO Ms. C.. Gearhart IMA to the PEO Col Mark Scherbarth SML Tactical SATCOM Ms. E. Carper MissionFocus Areas • Protected Tactical SATCOM • Protected Tactical Enterprise Services • Wideband Global SATCOM SML NarrowbandSATCOM CAPT P. Sheehy (USN) CC/SML PNT IMD (P) Col A. Menschner SML PNT SYD (P) Col M. Spencer As of 02 Apr 2025 • Evolved Strategic SATCOM Ground • Evolved Strategic SATCOM Space • Enhanced Polar System Recapitalization MissionFocus Areas • Mobile User Objective System Baseline Space • Mobile User Objective System Ground Sustainment • Mobile User Objective System Service Life Extension Space • Mobile User Objective System Ground Modernization MissionFocus Areas • Global Positioning System III • OCX • C2 Mods • OCX Transition • GPS Product Support MissionFocus Areas • Military GPS User Equipment Inc 1 • Military GPS User Equipment Inc 2 • Global Positioning System IIIF • Foreign Military Sales MissionFocus Areas Finance Acquisition Logistics Mission Services Ops Transition Contracting Product Support MILISATCOM"
      },
      {
        "pageno": 6,
        "text": "Space Sensing (SSC/SN) Deputy Director Col D. Bannach Program Executive Officer Space Sensing Col R. Davis Deputy PEO Mr. M. Dolan IMA to the PEO Lt Col Joel Kurzdorfer Mission Focus Areas Mission Focus Areas •Resilient MW/MT MEO Epoch 1 Space •Resilient MW/MT MEO Epoch 2 Space •Resilient MW/MT MEO Ground •GEO WFOV Operations •Space Sensing Technology Maturation •Resilient MW/MT MEO Integration •Mission Integration • Electro-optical Infrared Weather System • Weather Microwave • Commercial & Persistent Tactical Surveillance • Space Weather Ground Sensors and Analytics • Terrestrial Weather Satellite Imagery Dissemination NH-04 Mission Focus Areas • Next Generation Overhead Persistent Infrared (OPIR) Integration • Next Generation OPIR Geosynchronous / Next Generation Interim Ops • Next Generation OPIR Polar Mission Focus Areas •Spaced Based Infrared Systems (Ground/Satellites) Ground Based Radars •United States Nuclear Detonation Detection System •Joint Tactical Ground Systems •Mobile Ground Systems •Electro-optical Infrared Weather System •Defense Meteorological Satellite Program Resilient Missile Warning, Missile Tracking, Missile Defense Col J. Seal Environmental & Tactical Surveillance Col D. Visosky Strategic Missile Warning Space Col L. Brown, Jr. Mission Delta 4 (MD4) Col E. Schmitt Finance Engineering Contracting Security Acquisition Logistics Operations Management Staff Functions As of 15 Apr 2025 Strategic Missile Warning Ground Col S. Medeiros Mission Focus Areas • Next Generation Overhead Persistent Infrared (OPIR) Integration • Future Operationally Resilient Ground Evolution • Relay Ground Stations • Data Exploitation Tools • Applications Processing Lab & OPIR Battlespace Awareness Center / Space Modernization Initiative • Survivable / Endurable Systems • United States Nuclear Detonation Detection System 4th Sustainment Squadron (4 STS) Ms. A. Guest NH-04 PEO Authority SPACESYSTEMS COMMAND"
      },
      {
        "pageno": 7,
        "text": "SPACESYSTEMS COMMAND #SpaceStartsHere Space Domain Awareness & Combat Power (SDACP) (SSC/SZ) Program Executive Officer and Director Space Domain Awareness & Combat Power Col B. McClain IMA to the PEO Col C. Jordan SML Innovation& PrototypingAcq Delta Col J. Roth Orbital Warfare Acq Delta SML Col E. Stockham Space Domain Awareness Mission Delta SML NH-04 Battlespace Awareness Acq Delta Mr. F SchnellSpace Electromagnetic WarfareMission Delta Deputy PEO Col S. Klempner MissionFocus Areas • Combat Systems • Next – Gen Programs • Defensive Cyber Ops • Advanced Global Capabilities • Rapid Acquisition • Comms Modernization • User Integration MissionFocus Areas • Space Capabilities • Combat Power Systems • Space Surveillance and Reconnaissance • Space Response • Orbital Maneuver MissionFocus Areas • Prototype Operations • DoD Space Test Program • Innovation Development • Prototype Ground Development & Sustainment As of 30 April 2025 NH-04 Deputy Director Ms. S. Eberhardt HQE SDA Executive Agent Ms. B Golf Finance Integration & Engineering Contracting Functional Staff Rapid Reaction Branch ML Lt Col R. Owen Acquisition Logistics Operations Management Chief of Staff Lt Col C. Greiser NH-04 Spectrum Warfare SYD SML Mr. J. Riedel MissionFocus Areas • Advanced Concepts & Battle Integration • GEO Sensing • LEO Sensing • Foreign Military Sales (FMS) • Integrated Tactical Warning/Attack Assessment PEO Authority Only Security Special Access Program Management Office (SAPMO) (SSC/IPZ) Missile Warning Mission Delta"
      },
      {
        "pageno": 8,
        "text": "SPACESYSTEMS COMMAND #SpaceStartsHere Operational Test & Training Infrastructure (OTTI) (SSC/TI) As of 02 Apr 2025 O-5/6 Chief of Staff Deputy Director Program Executive Officer Operational Test and Training Infrastructure Col C. Klopstein SML Test and Training Vacant MissionFocus Areas • Physical / Live Test and Training • Digital / Synthetic Test and Training • Test and Training Mission Infrastructure • Test and Training Readiness, sustainment, logistics, and product support Col R. Kieffer Engineering Mr. K. Molder MissionFocus Areas • Systems Engineering and Integration • Testing • Safety • Configuration Management • Architecting SEL Vacant NH-04 Legal Advisor Mr. J. Wendlberger NH-04 AFOSI PJ Vacant NH-04 Vacant O-5/6 Deputy PEO Ms. VanDeburg CFO Contracting Personnel Security Acquisition Requirements and Engagements Staff Functions"
      }
    ]
  },
  {
    "id": "f2be878b1a",
    "title": "ASA(ALT) Org Overview (May 15, 2025)",
    "url": "",
    "doc_date": "2025-05-15",
    "pages": [
      {
        "pageno": 1,
        "text": "Office of the Assistant Secretary of the Army (Acquisition, Logistics and Technology) As of 05/15/25 SGM Robert Haynie LTG Heidi Hoyle Deputy Chief of Staff G-4 Logistics Mr. Leonel Garciga Chief Information Officer LTG Robert Collins Principal Military Deputy, DAAC SAAL-ZB Mr. Patrick Mason Acting Principal Deputy SAAL-ZX Sergeant Major SAAL-ZB Mr. Jesse Tolleson Acting ASA(ALT) & AAE SAAL-ZA Mr. Jan Jedrych Acting DASA Sustainment SAAL-ZL Mr. Patrick Mason DASA Defense Exports & Cooperation SAAL-ZN Ms. Kirsten Taylor DASA Plans, Programs & Resources SAAL-ZR Mr. Chris Manning DASA Research & Technology SAAL-ZT Ms. Kimberly Buehler Acting DASA Procurement SAAL-ZP MG Robert Barrie Deputy for Acquisition & Systems Management SAAL-ZS LTG Robert Rasch Director Hypersonics , Directed Energy, Space & Rapid Acquisition MG John Reim JPEO Armaments & Ammunition BG David Phillips PEO Aviation BG Kevin Chaney Acting PEO C3N BG Camilla White PEO CS&CSS Mr. William Hepworth PEO Enterprise BG Ed Barker PEO IEW&S MG Frank Lozano PEO Missiles & Space MG Christopher Schneider PEO Soldier BG Christine Beeler PEO STRI Acting DASA Strategy & Acquisition Reform SAAL-ZF Ms. Heather Shirey Acting DASA Data, Engineering, and Software SAAL-ZE Ms. Rocio “Rosie” Bauer LTG Jeth Rey Deputy Chief of Staff G-6 MG Glenn Dean PEO GCS Mr. Darryl Colvin JPEO CBRND Director, Test and Evaluation SAAL-TE Mr. James Cooke Director USAASC Mr. Ronald Richardson Ms. Tamika Atkins PEO ACWA"
      }
    ]
  },
  {
    "id": "16823fea51",
    "title": "FY2025 Budget Request Overview Book",
    "url": "",
    "doc_date": "2024-03-06",
    "pages": [
      {
        "pageno": 2,
        "text": "Preface From Fiscal Year (FY) 1969 to FY 2005, the Office of the Secretary of Defense published the “Annual Defense Report” (ADR) to meet 10 USC section 113 requirements. Beginning in FY 2009, the Overview Book fulfilled this role, and it is published each year as part of the President’s Annual Defense Budget. The Overview is one part of an extensive set of materials that constitute the presentation and justification of the President’s Budget for FY 2025. This document and all other publications for this and previous Department of Defense (DoD) budgets are available from the public website of the Under Secretary of Defense (Comptroller) http://comptroller.defense.gov. The Press Release and Budget Briefing, often referred to as the “Budget Rollout,” and the Program Acquisition Costs by Weapons System book, which includes summary details on major DoD acquisition programs (i.e., aircraft, ground forces programs, shipbuildi ng, space systems, etc.), are especially relevant. Notable accomplishments and updates will be summarized in the forthcoming 2023 Annual Performance Report (APR). Unclassified versions of the Annual Performance Plan (APP) and APR will be posted at https://dam.defense.gov/Performance/ when available. Other background information can be accessed at www.defense.gov. The estimated cost of this report or study for the Department of Defense is approximately $40,000 for the 2024 Fiscal Year. This includes $11,000 in expenses and $29,000 in DoD labor. Generated on 2024Feb28 RefID: 4-811F48A"
      },
      {
        "pageno": 7,
        "text": "Overview – FY 2025 Defense Budget CHAPTER 1 FY 2025 BUDGET SUMMARY 1-1 1. FY 2025 BUDGET SUMMARY 2022 NATIONAL SECURITY STRATEGY AND NATIONAL DEFENSE STRATEGY The President’s National Security Strategy (NSS) and the Secretary of Defense’s National Defense Strategy (NDS), both signed and released in 2022, fully informed the building of the Fiscal Year 2025 budget request, resulting in a submission that is comprehensively aligned with national strategic priorities. President’s National Security Strategy The NSS remains unchanged from last year’s budget. Key tenets for the military in the NSS include: • By modernizing our military, pursuing advanced technologies, and investing in our defense workforce, we will have strengthened deterrence in an era of increasing geopolitical confrontation, and positioned America to defend our homeland, our allies, partner s, and interests overseas, and our values across the globe. • The United States will continue to defend democracy around the world. We will continue to invest in boosting American competitiveness globally. We will partner with any nation that believes the rules-based order must remain the foundation for global peace and prosperity. And we will continue to demonstrate how America’s enduring leadership to address today’s and tomorrow’s challenges, with vision and clarity, is the best way to deliver for the American people. • We are doing more to connect our partners and strategies across regions through initiatives like our security partnership with Australia and the United Kingdom (AUKUS) in support of the NSS. National Defense Strategy – Defense Priorities Like the NSS, the NDS issued in 2022 remains unchanged. It directs the Department to act urgently to sustain and strengthen U.S. military credibility and deterrence capability. The NDS identifies four top -level defense priorities the Department must pursue to strengthen deterrence: • First, the Department will defend the Homeland, with the PRC as the Department’s pacing challenge. Sections • 2022 National Security Strategy and National Defense Strategy • FY 2025 Budget Request Overview • Resourcing the 2022 NDS • Conclusion “…only one country on Earth can provide the kind of leadership that this moment demands. And only one country can consistently provide the powerful combination of innovation, ingenuity, and idealism—and of free minds, free enterprise, and free people. And that’s the United States of America.” - Secretary of Defense Lloyd J. Austin III at the Reagan National Defense Forum, December 2023"
      },
      {
        "pageno": 8,
        "text": "Overview – FY 2025 Defense Budget CHAPTER 1 FY 2025 BUDGET SUMMARY 1-2 • Second, the Department will deter strategic attacks against the United States, allies , and partners. • Third, the Department will deter aggression and be prepared to prevail in conflict when necessary. • Fourth, to ensure the Department’s future military advantage, the Department will continue to build a resilient Joint Force and defense ecosystem. Central Premise Over a year into implementation, the 2022 NDS remains our North Star. The 2022 NDS advances a strategy focused on the People’s Republic of China ( PRC) and seeks to prevent the PRC’s dominance of key regions, while protecting the U.S. homeland and reinforcing a stable and open international system. Consistent with the 2022 NSS, a vital objective of the NDS is to dissuade the PRC from considering aggression as a viable means of advancing goals that threaten vital U.S. national interests. Conflict with the PRC is neither inevitable nor desirable. The Department’s priorities support broader whole -of-government efforts to develop terms of interaction with the PRC that are favorable to our interests and values, while managing strategic competition and enabling the pursuit of cooperation on shared challenges. Even as we focus on the PRC as our pacing challenge, the NDS also accounts for the acute threat posed by Russia, demonstrated by our continued efforts to oppose Russian aggression in Europe and their unprovoked invasion of Ukraine. The Department’s invest ments will continue robust deterrence of Russian aggression against vital U.S. national interests, including commitments to our treaties. We will work closely via the North Atlantic Treaty Organization (NATO) and with our allies and partners to develop critical enabling capabilities and deepen interoperability for a more credible combined Allied force. In service of the NDS strategic priorities, the Department will accept measured risk but remain vigilant in the face of other persistent threats, including those posed by North Korea, Iran, and violent extremist organizations. Security Environment The 2022 NDS provides the Department with a guiding framework that accounts for changes in the geopolitical landscape. In this complex and dynamic security environment, the Department will continue to maintain its distinctive advantages in military capabi lities for the Total Force, enhance the ability to support and employ that force with allies and partners, and conduct military activities that advance U.S. national interests. An increasing array of fast -evolving technologies and innovative applications of existing technology complicates the Department’s ability to maintain an edge in combat credibility and deterrence. Newer capabilities such as counterspace weapons, hypersonic weapons, new and emerging payload and delivery systems, and lack of clarity for norms of behavior in space, cyber, and information domains continue to create a heightened potential for inadvertent escalation or shifts in perceived deterrence of U.S. milit ary power. New applications of artificial intelligence, quantum science, autonomous weapons designs, biotechnology, and space technologies can change traditional, kinetic military conflict, and disrupt the U.S. supply chain and logistics operations vital to maintaining combat credibility. The Department likewise faces destabilizing and potentially catastrophic transboundary challenges, including climate change and pandemics, which have increasingly affected the Total Force."
      },
      {
        "pageno": 11,
        "text": "Overview – FY 2025 Defense Budget CHAPTER 1 FY 2025 BUDGET SUMMARY 1-5 Figure 1.3. Defense Outlays as a Percent of Gross Domestic Product, FY 1953 – FY 2029 Historical data is calculated from GDP in OMB’s FY 2024 PB Historical Table 10.1, Gross Domestic Product and Deflators Used in the Historical Tables. FYs 2023 – 2029 are calculated from GDP in OMB’s Economic Assumptions for the 2025 Budget. Defense outlays are relatively modest as a percent of Gross Domestic Product (GDP). During this time of great uncertainty, the United States can ill afford the cost of global instability. In order to remain as the steady friend of our allies and partners and a credible deterrent to aggression, the Department must have resources that meet today’s challenges and give our warfighters the tools they require to prevail. We also must safeguard the precious resources of our nation , an effort that begins with a strategically focused and analytically sound budget request to the Congress. RESOURCING THE 2022 NATIONAL DEFENSE STRATEGY This overview document illustrates how the FY 2025 budget request aligns with, and continues to advance, the four 2022 NDS priorities through each of the NDS strategic approaches. • Integrated Deterrence: Enabled by combat-credible forces backstopped by a safe, secure, and effective nuclear deterrent: • $49.2 billion for Nuclear Enterprise Modernization including:  $9.9 billion for the Columbia-class ballistic missile submarine  $5.3 billion for the B-21 bomber  $3.7 billion for the Sentinel/Ground Based Strategic Deterrent (GBSD)  $ 0.8 billion for the Long-Range Standoff (LRSO) Weapon • $28.4 billion for Missile Defeat and Defense to protect the United States homeland, territories, and allies • $9.8 billion to develop and field a mix of multi-Service, multi-domain offensive Long-Range Fires within this Future Years Defense Program (FYDP) • $61.2 billion for Air Power focused on F-22, F-35, and F-15EX fighters, the B-21 bomber, mobility aircraft, KC-46A tankers, and unmanned aircraft systems 0% 2% 4% 6% 8% 10% 12% 1950 1955 1960 1965 1970 1975 1980 1985 1990 1995 2000 2005 2010 2015 2020 2025 2030 Past Projected 2010: Iraq/Afghanistan 4.5% 2025 3.0% 1999 2.8% 1979 4.5% 1965 6.5% 1986: Cold War 5.9% 1968: Vietnam 8.6% 1953: Korea 11.4%"
      },
      {
        "pageno": 17,
        "text": "Overview – FY 2025 Defense Budget CHAPTER 2 INTEGRATED DETERRENCE 2-1 2. INTEGRATED DETERRENCE INTRODUCTION Integrated Deterrence is the first of three ways the Department will address its goals identified in the 2022 National Defense Strategy. It is a holistic concept that involves the application of multiple deterrence logics —deterrence by denial, deterrence by resilience, deterrence by direct cost imposition, and deterrence through imposing costs on adversaries collectively with allies and partners—while integrating across the instruments of national power by working with U.S. government interagency partners, as well as internationally, with allies and partners. In protecting the Homeland, the Department continues to build resilience and combat credibility, thereby lowering the anticipated benefits of and raising the direct costs of using force. For example, the Department continues to maintain credible and effective deterrence of both large- scale and limited nuclear attacks from a range of adversaries and is improving U.S. forces’ ability to operate during or after limited nuclear, chemical, and biological attacks. The Department continues modernizing nuclear forces, Nuclear Command, Control, and Communications (NC3), and cooperating with the Department of Energy’s National Nuclear Security Administration efforts to modernize the nuclear weapon production enterprise. To deter attacks by the People’s Republic of China (PRC) on the United States, its forces, or those of U.S. allies and partners, the Department continues its efforts to enhance the capabilities and resilience of those systems that the PRC is most likely to target and seek interoperability , interchangeability, and enhanced readiness through combined exercises. To deter attacks by Russia, the Department continues to build capability and credibility that reinforces our treaty commitments regardless of conventional or nuclear -armed attack. In the short run, the Department will improve resilience and focus on interoperability, intelligence sharing, and extended nuclear deterrence. The Department is also focused on enhancing denial capabilities and key enablers in North Atlantic Treaty Organization’s (NATO) force planning, while NATO allies seek to bolster their con ventional warfighting capabilities. For Ally and partner countries that border Russia, the Department continues supporting efforts to build response options. The Department will continue to deter North Korean and Iranian attacks by increasing partner capability and resilience, particularly in air and missile defense. To deter North Korean attacks, the Department will continue close coordination and interoperability with our Republic of Korea Ally; nuclear deterrence; resilience initiatives; and the potential for direct cost imposition approaches that come from globally deployable Joint Forces. In the Middle East, the Department continues providing security assistance where needed. Sections • Introduction • Deter Nuclear Employment and Strategic-Level Attacks • Major Weapons Programs “We must embrace integrated deterrence, which charges us to coordinate our efforts across all war-fighting domains, theaters, and the spectrum of conflict to create new and more complex dilemmas for our adversaries.\" - Secretary of Defense Lloyd J. Austin III, Message to the Force, March 2, 2023"
      },
      {
        "pageno": 19,
        "text": "Overview – FY 2025 Defense Budget CHAPTER 2 INTEGRATED DETERRENCE 2-3 COLUMBIA Class Ballistic Missile Submarine (SSBN) The COLUMBIA class SSBN is being developed to replace the OHIO -class SSBNs starting in October 2030. The Navy will sustain the OHIO class SSBNs to ensure a smooth transition for the sea-based leg of the triad with the COLUMBIA class SSBN. The COLUMBIA class program successfully completed Milestone B in January 2017. In September 2020, the Defense Acquisition Executive (DAE) authorized the Navy to begin full ship construction for the first hull (SSBN 826), as well as advanced procurement and advanced construction efforts for the second hull (SSBN 827). In September 2023, the DAE authorized full ship construction of the second hull (SSBN 827) to begin in FY 2024. The FY 2025 budget request of $9.9 billion reflects a $3.7 billion increase, which is attributed to increases for the Submarine Industrial Base and in advance procurement costs for the FY 2026 submarine. Trident II (D5) Submarine-Launched Ballistic Missile (SLBM) Life Extension (D5LE)/ (D5LE2) The D5LE2 investment will maintain and modernize the most survivable leg of the triad. The D5LE, initially deployed in 2017, will remain in service through the service life of the OHIO Class (early 2040s), and is planned for initial deployment on the COLUMBIA Class and the United Kingdom’s DREADNAUGHT Class SSBNs. The D5LE2 will replace D5LE on the COLUMBIA - class starting in FY 2039 on COLUMBIA Hull 9. The D5LE2 will leverage the D5LE2 solid rocket motor design and couple it with updated avionics electronics and guidance systems. B-21 Raider Strategic Bomber B-21 Raider low-rate initial production began in FY 2024. When fielded, it will be an affordable, long range, penetrating aircraft that incorporates proven, mature technologies. This bomber represents a key component to the joint portfolio of conventional and nuclear deep- strike capabilities. F-35A Dual-Capable Aircraft (DCA) The F-35A DCA will replace Allied legacy 4th generation fighter aircraft, including the Air Force’s F-15E, for the NATO nuclear deterrence mission. Selected U.S. and Allied F-35As in the U.S. European Command Theater achieved operational nuclear certification in early FY 2024. Missile Defeat & Defense The Department will continue to support the 2022 Missile Defense Review that calls for integrated missile defense, flexibility, and adaptability, to address new threats, tighter interoperability, and dominance in space. The FY 2025 budget request supports prior budget requests to develop and field a diversified set of missile defeat and defense (MDD) capabilities to counter the advancing threat. The FY 2025 budget builds on previous enhancements to U.S. MDD capabilities to defend"
      }
    ]
  },
  {
    "id": "c1569b26ac",
    "title": "DoD Procurement Programs (P-1), FY2025",
    "url": "",
    "doc_date": "2024-03-01",
    "pages": [
      {
        "pageno": 1,
        "text": "PROCUREMENT PROGRAMS (P-1) Department of Defense Budget Fiscal Year 2025 March 2024 Office of the Under Secretary of Defense (Comptroller)"
      },
      {
        "pageno": 2,
        "text": "UNCLASSIFIED Preface The Procurement Programs (P-1) is derived from and consistent with the Comptroller Information System database. The P-1 is provided annually to the DoD oversight committees of the Congress coincident with the transmittal of the President's Budget. This document is also provided to Office of Assistance Secretary of Defense (Public Affairs) for use by non-DoD activities, and is available to the public on the Internet at https://comptroller.defense.gov/. Office of the Under Secretary of Defense (Comptroller) Section 8056 of the Department of Defense Appropriations Act, 2023 (division C of Public Law 117-328) requires the Department to provide a statement describing each instance if any, during each of the fiscal years (FYs) 2016 through 2023 in which the Department exercised authority conferred by the section to charge current appropriations with obligations otherwise chargeable to expired or closed accounts with a negative unliquidated or unexpended balance. The authority was not exercised in FY 2016 through FY 2023. Preparation of the P-1 cost the Department of Defense a total of approximately $38,000 in FY 2024. UNCLASSIFIED"
      },
      {
        "pageno": 4,
        "text": "UNCLASSIFIED UNCLASSIFIED TABLE OF CONTENTS PAGE DoD Component Summary 1 Army Army Summary 3 Army P-1 Detail 4 Chemical Agents & Munitions Destruction 50 Navy Navy Summary 53 Navy P-1 Detail 54 Air Force Air Force Summary 126 Air Force P-1 Detail 127 Defense-Wide/Other Defense-Wide Summary 168 Defense-Wide P-1 Detail 171 National Guard and Reserve Equipment 181 Defense Production Act Purchases 185"
      },
      {
        "pageno": 6,
        "text": "UNCLASSIFIED Department of Defense FY 2025 President's Budget Exhibit P-1 FY 2025 President's Budget Total Obligational Authority DoD Component Summary (Dollars in Thousands) Mar 2024 Appropriation Summary FY 2023 Actuals FY 2024 PB Request with CR Adjustments* FY 2025 Request Aircraft Procurement, Army 3,915,666 3,838,397 3,164,183 Missile Procurement, Army 8,386,983 3,848,853 6,245,770 Procurement of Weapons and Tracked Combat Vehicles, Army 8,226,297 4,505,157 3,699,392 Procurement of Ammunition, Army 8,737,396 2,770,120 2,702,640 Other Procurement, Army 9,505,181 8,596,604 8,616,524 Chemical Agents and Munitions Destruction, Defense 1,059,818 1,059,818 775,507 Total Department of the Army 39,831,341 24,618,949 25,204,016 Aircraft Procurement, Navy 19,035,947 19,031,864 16,214,250 Weapons Procurement, Navy 5,027,447 4,823,113 6,600,327 Procurement of Ammunition, Navy and Marine Corps 1,690,328 920,884 1,747,883 Shipbuilding and Conversion, Navy 26,630,472 31,758,032 32,378,291 National Sea-Based Det Fd 5,857,776 Other Procurement, Navy 12,157,055 12,138,590 15,877,253 Procurement, Marine Corps 4,309,536 3,669,510 4,243,863 Total Department of the Navy 74,708,561 72,341,993 77,061,867 Aircraft Procurement, Air Force 22,278,530 21,990,607 19,835,430 Missile Procurement, Air Force 3,423,881 2,999,294 4,373,609 Procurement of Ammunition, Air Force 840,000 857,200 709,475 *A full-year FY 2024 appropriation for this account was not enacted at the time the budget was prepared; therefore, the budget assumes this account is operating under the Further Additional Continuing Appropriations and Other Extensions Act, 2024 (Public Law 118-35). The amounts included for FY 2024 reflect the annualized level provided by the continuing resolution. UNCLASSIFIED Page 1"
      },
      {
        "pageno": 7,
        "text": "UNCLASSIFIED Department of Defense FY 2025 President's Budget Exhibit P-1 FY 2025 President's Budget Total Obligational Authority DoD Component Summary (Dollars in Thousands) Mar 2024 Procurement, Space Force 4,065,746 4,454,458 4,262,979 Other Procurement, Air Force 29,423,413 28,009,870 30,298,764 Total Department of the Air Force 60,031,570 58,311,429 59,480,257 Procurement, Defense-Wide 6,145,802 7,217,175 5,406,751 National Guard and Reserve Equipment 1,000,000 1,000,000 Defense Production Act Purchases 518,906 372,906 393,377 Total Defense-Wide 7,664,708 8,590,081 5,800,128 Grand Total Department of Defense 182,236,180 163,862,452 167,546,268 *A full-year FY 2024 appropriation for this account was not enacted at the time the budget was prepared; therefore, the budget assumes this account is operating under the Further Additional Continuing Appropriations and Other Extensions Act, 2024 (Public Law 118-35). The amounts included for FY 2024 reflect the annualized level provided by the continuing resolution. Appropriation Summary FY 2023 Actuals FY 2024 PB Request with CR Adjustments* FY 2025 Request UNCLASSIFIED Page 2"
      },
      {
        "pageno": 8,
        "text": "UNCLASSIFIED Department of the Army FY 2025 President's Budget Exhibit P-1 FY 2025 President's Budget Total Obligational Authority Army Summary (Dollars in Thousands) Mar 2024 Appropriation Summary FY 2023 Actuals FY 2024 PB Request with CR Adjustments* FY 2025 Request Aircraft Procurement, Army 3,915,666 3,838,397 3,164,183 Missile Procurement, Army 8,386,983 3,848,853 6,245,770 Procurement of Weapons and Tracked Combat Vehicles, Army 8,226,297 4,505,157 3,699,392 Procurement of Ammunition, Army 8,737,396 2,770,120 2,702,640 Other Procurement, Army 9,505,181 8,596,604 8,616,524 Chemical Agents and Munitions Destruction, Defense 1,059,818 1,059,818 775,507 Total Department of the Army 39,831,341 24,618,949 25,204,016 *A full-year FY 2024 appropriation for this account was not enacted at the time the budget was prepared; therefore, the budget assumes this account is operating under the Further Additional Continuing Appropriations and Other Extensions Act, 2024 (Public Law 118-35). The amounts included for FY 2024 reflect the annualized level provided by the continuing resolution. UNCLASSIFIED Page 3"
      }
    ]
  },
  {
    "id": "9a725b4069",
    "title": "DoD RDT&E Programs (R-1), FY2025",
    "url": "",
    "doc_date": "2024-03-01",
    "pages": [
      {
        "pageno": 1,
        "text": "RDT&E PROGRAMS (R-1) Department of Defense Budget Fiscal Year 2025 March 2024 Office of the Under Secretary of Defense (Comptroller)"
      },
      {
        "pageno": 2,
        "text": "UNCLASSIFIED Preface The RDT&E Programs (R-1) is derived from and consistent with the Comptroller Information System database. The R-1 is provided annually to the DoD oversight committees of the Congress coincident with the transmittal of the President's Budget. This document is also provided to Office of Assistance Secretary of Defense (Public Affairs) for use by non-DoD activities, and is available to the public on the Internet at https://comptroller.defense.gov/. Office of the Under Secretary of Defense (Comptroller) Section 8056 of the Department of Defense Appropriations Act, 2023 (division C of Public Law 117-328) requires the Department to provide a statement describing each instance if any, during each of the fiscal years (FYs) 2016 through 2023 in which the Department exercised authority conferred by the section to charge current appropriations with obligations otherwise chargeable to expired or closed accounts with a negative unliquidated or unexpended balance. The authority was not exercised in FY 2016 through FY 2023. Preparation of the R-1 cost the Department of Defense a total of approximately $38,000 in FY 2024. UNCLASSIFIED"
      },
      {
        "pageno": 4,
        "text": "UNCLASSIFIED UNCLASSIFIED TABLE OF CONTENTS PAGE DoD Component Summary 1 Army Army Summary 4 Army R-1 Detail 5 Navy Navy Summary 18 Navy R-1 Detail 19 Air Force Air Force Summary 33 Air Force R-1 Detail 35 Defense Agencies Defensewide Summary 56 Defensewide R-1 Detail 59 Operational Test and Evaluation Summary 75 Operational Test and Evaluation R-1 Detail 76 Individual Defense Agency R-1 Detail 78"
      },
      {
        "pageno": 6,
        "text": "UNCLASSIFIED Department of Defense FY 2025 President's Budget Exhibit R-1 FY 2025 President's Budget Total Obligational Authority (Dollars in Thousands) Mar 2024 Appropriation FY 2023 Actuals FY 2024 PB Request with CR Adjustments* FY 2025 Request Research, Development, Test and Evaluation, Army 17,098,984 17,142,121 14,073,308 Research, Development, Test and Evaluation, Navy 26,156,754 26,003,697 25,697,815 Research, Development, Test and Evaluation, Air Force 45,014,265 44,913,984 49,108,771 Research, Development, Test, and Evaluation, Space Force 16,996,236 16,615,963 18,700,153 Research, Development, Test and Evaluation, Defense-Wide 35,180,595 34,536,374 35,227,834 Operational Test and Evaluation, Defense 446,122 446,122 348,709 Total Research, Development, Test, & Evaluation 140,892,956 139,658,261 143,156,590 Other RDT&E Budget Activities Not Included In the Research, Development, Test, & Evaluation Title Office of the Inspector General 1,864 3,400 1,900 Defense Health Program 3,037,441 931,773 972,436 Chemical Agents and Munitions Destruction, Defense 975,206 1,002,560 754,762 National Defense Sealift Fund 66 Total Not in Research, Development, Test, & Evaluation 4,014,577 1,937,733 1,729,098 *A full-year FY 2024 appropriation for this account was not enacted at the time the budget was prepared; therefore, the budget assumes this account is operating under the Further Additional Continuing Appropriations and Other Extensions Act, 2024 (Public Law 118-35). The amounts included for FY 2024 reflect the annualized level provided by the continuing resolution. UNCLASSIFIED Page 1"
      },
      {
        "pageno": 7,
        "text": "UNCLASSIFIED Department of Defense FY 2025 President's Budget Exhibit R-1 FY 2025 President's Budget Total Obligational Authority (Dollars in Thousands) Mar 2024 FY 2023 Actuals FY 2024 PB Request with CR Adjustments* FY 2025 Request Summary Recap of Budget Activities Basic Research 2,793,880 2,479,661 2,452,901 Applied Research 7,715,861 6,017,674 5,795,874 Advanced Technology Development 11,753,730 9,327,385 8,959,028 Advanced Component Development & Prototypes 34,893,781 40,430,024 37,131,123 System Development & Demonstration 22,610,358 26,537,609 26,933,323 Management Support 12,621,847 9,168,183 9,534,488 Operational Systems Development 48,016,962 50,465,716 51,958,535 Software And Digital Technology Pilot Programs 486,537 553,373 391,318 Undistributed -5,321,364 Total Research, Development, Test, & Evaluation 140,892,956 139,658,261 143,156,590 Summary Recap of FYDP Programs Strategic Forces 1,786,853 2,576,768 2,794,207 General Purpose Forces 6,795,505 8,305,574 9,518,038 Intelligence and Communications 2,751,651 2,954,933 3,269,447 Mobility Forces 295,744 756,557 687,799 Guard and Reserve Forces 5,530 Research and Development 82,120,307 81,618,644 76,424,294 Central Supply and Maintenance 340,234 202,763 207,378 Training Medical and Other 55,846 141,550 218,558 *A full-year FY 2024 appropriation for this account was not enacted at the time the budget was prepared; therefore, the budget assumes this account is operating under the Further Additional Continuing Appropriations and Other Extensions Act, 2024 (Public Law 118-35). The amounts included for FY 2024 reflect the annualized level provided by the continuing resolution. UNCLASSIFIED Page 2"
      },
      {
        "pageno": 8,
        "text": "UNCLASSIFIED Department of Defense FY 2025 President's Budget Exhibit R-1 FY 2025 President's Budget Total Obligational Authority (Dollars in Thousands) Mar 2024 Administration and Associated Activities 110,532 -5,093,499 287,156 Support of Other Nations 2,593 3,917 4,590 Special Operations Forces 1,002,082 1,218,563 1,349,512 Space 11,613,096 13,567,977 13,293,105 Classified Programs 34,018,513 33,398,984 35,102,506 Total Research, Development, Test, & Evaluation 140,892,956 139,658,261 143,156,590 Summary Recap of Non-FYDP Programs Mobility Forces 66 Research and Development 3,037,441 931,773 972,436 Central Supply and Maintenance 975,206 1,002,560 754,762 Administration and Associated Activities 1,864 3,400 1,900 Total Not in Research, Development, Test, & Evaluation 4,014,577 1,937,733 1,729,098 *A full-year FY 2024 appropriation for this account was not enacted at the time the budget was prepared; therefore, the budget assumes this account is operating under the Further Additional Continuing Appropriations and Other Extensions Act, 2024 (Public Law 118-35). The amounts included for FY 2024 reflect the annualized level provided by the continuing resolution. FY 2023 Actuals FY 2024 PB Request with CR Adjustments* FY 2025 Request UNCLASSIFIED Page 3"
      }
    ]
  },
  {
    "id": "10e1db6ce5",
    "title": "DoD RDT&E Programs (R-1), FY2026",
    "url": "",
    "doc_date": "2025-03-01",
    "pages": [
      {
        "pageno": 1,
        "text": "RDT&E PROGRAMS (R-1) Department of Defense Budget Fiscal Year 2026 June 2025 Office of the Under Secretary of Defense (Comptroller)"
      },
      {
        "pageno": 2,
        "text": "UNCLASSIFIED Preface The RDT&E Programs (R-1) exhibit is derived from and consistent with the Next Generation Resource Management System database. The R-1 is provided annually to the DoD oversight committees of the Congress coincident with the transmittal of the President's Budget. This document is also provided to Office of Assistance Secretary of Defense ( Public Affairs) for use by non-DoD activities, and is available to the public on the Internet at https://comptroller.defense.gov/. Office o f the Under Secretary of Defense (Comptroller) Preparation of the R-1 cost the Department of Defense a total of approximately $39,000 in FY 2025. (RefID: B-391B182) UNCLASSIFIED"
      },
      {
        "pageno": 4,
        "text": "UNCLASSIFIED UNCLASS IFIED TABLE OF C ONTENTS PAGE DoD Component Summary 1 Army Army S ummary 4 Army R-1 Detail 5 Navy Navy Summary 20 Navy R-1 Detail 21 Air Fo rce Air Force Summary 36 Air Force R-1 Detail 37 Defens e Agencies Defensewide Summary 59 Defensewide R-1 Detail 61 Operational Test and Evaluation Summary 78 Operational Test and Evaluation R-1 Detail 79 Individual Defense Agency R-1 Detail 81"
      },
      {
        "pageno": 6,
        "text": "UNCLASSIFIED Department of Defense FY 2026 President's Budget Exhibit R-1 FY 2026 President's Budget Total Obligational Authority (Dollars in Thousands) Jun 2025 Appropriation FY 2024 Actuals FY 2025 Enacted FY 2025 Supplemental FY 2025 Total FY 2026 Disc Request FY 2026 Reconciliation Request FY 2026 Total Research, Development, Test and Evaluation, Army 17,119,530 14,322,031 41,400 14,363,431 14,549,223 846,534 15,395,757 Research, Development, Test and Evaluation, Navy 27,997,831 25,967,177 25,967,177 25,708,049 3,452,080 29,160,129 Research, Development, Test and Evaluation, Air Force 47,693,850 46,811,425 69,278 46,880,703 52,017,288 10,226,620 62,243,908 Research, Development, Test, and Evaluation, Space Force 18,532,358 18,553,363 18,553,363 15,486,466 13,547,914 29,034,380 Research, Development, Test and Evaluation, Defense-Wide 37,822,176 35,238,856 35,238,856 33,921,939 8,897,806 42,819,745 Operational Test and Evaluation, Defense 336,717 348,709 348,709 318,143 98,000 416,143 Total Research, Development, Test, & Evaluation 149,502,462 141,241,561 110,678 141,352,239 142,001,108 37,068,954 179,070,062 Other RDT&E Budget Activities Not Included In the Research, Development, Test, & Evaluation Title Office of the Inspector General 3,400 1,900 1,900 4,625 4,625 Defense Health Program 2,902,871 1,695,436 1,695,436 972,712 972,712 Chemical Agents and Munitions Destruction, Defense 1,002,560 754,762 754,762 210,039 210,039 National Defense Sealift Fund 310 Total Not in Research, Development, Test, & Evaluation 3,909,141 2,452,098 2,452,098 1,187,376 1,187,376 UNCLASSIFIED Page 1"
      },
      {
        "pageno": 7,
        "text": "UNCLASSIFIED Department of Defense FY 2026 President's Budget Exhibit R-1 FY 2026 President's Budget Total Obligational Authority (Dollars in Thousands) Jun 2025 FY 2024 Actuals FY 2025 Enacted FY 2025 Supplemental FY 2025 Total FY 2026 Disc Request FY 2026 Reconciliation Request FY 2026 Total Summary Recap of Budget Activities Basic Research 2,496,596 2,474,150 2,474,150 2,256,071 10,000 2,266,071 Applied Research 7,553,689 6,250,782 6,250,782 5,769,349 255,000 6,024,349 Advanced Technology Development 11,321,672 10,136,347 10,136,347 9,984,694 2,002,835 11,987,529 Advanced Component Development & Prototypes 39,175,903 35,995,137 35,995,137 30,780,897 9,663,435 40,444,332 System Development & Demonstration 25,432,249 24,465,640 24,465,640 27,483,296 12,195,296 39,678,592 Management Support 12,374,365 9,795,288 41,400 9,836,688 9,811,349 292,560 10,103,909 Operational Systems Development 50,268,503 51,829,667 69,278 51,898,945 54,395,894 12,416,828 66,812,722 Software And Digital Technology Pilot Programs 879,485 294,550 294,550 829,286 233,000 1,062,286 Agile RDT&E Portfolion Management 690,272 690,272 Total Research, Development, Test, & Evaluation 149,502,462 141,241,561 110,678 141,352,239 142,001,108 37,068,954 179,070,062 Summary Recap of FYDP Programs Strategic Forces 2,530,207 2,500,184 2,500,184 2,575,434 2,155,531 4,730,965 General Purpose Forces 7,832,864 9,053,293 9,053,293 9,768,712 1,860,148 11,628,860 Intelligence and Communications 3,290,821 3,144,759 3,144,759 2,978,452 634,661 3,613,113 Mobility Forces 345,577 673,506 673,506 942,914 78,267 1,021,181 Guard and Reserve Forces 5,388 Research and Development 86,613,349 75,323,001 41,400 75,364,401 74,945,107 14,284,781 89,229,888 Central Supply and Maintenance 281,830 239,872 239,872 207,128 207,128 Training Medical and Other 87,711 179,284 179,284 148,282 148,282 Administration and Associated Activities 165,612 192,390 192,390 128,206 128,206 Support of Other Nations 3,917 4,254 4,254 4,430 4,430 Special Operations Forces 1,421,482 1,414,287 1,414,287 1,093,302 383,034 1,476,336 UNCLASSIFIED Page 2"
      },
      {
        "pageno": 8,
        "text": "UNCLASSIFIED Department of Defense FY 2026 President's Budget Exhibit R-1 FY 2026 President's Budget Total Obligational Authority (Dollars in Thousands) Jun 2025 Space 12,930,550 13,045,963 13,045,963 12,740,899 10,205,000 22,945,899 Classified Programs 33,993,154 35,470,768 69,278 35,540,046 36,468,242 7,467,532 43,935,774 Total Research, Development, Test, & Evaluation 149,502,462 141,241,561 110,678 141,352,239 142,001,108 37,068,954 179,070,062 Summary Recap of Non-FYDP Programs Mobility Forces 310 Research and Development 2,902,871 1,695,436 1,695,436 972,712 972,712 Central Supply and Maintenance 1,002,560 754,762 754,762 210,039 210,039 Administration and Associated Activities 3,400 1,900 1,900 4,625 4,625 Total Not in Research, Development, Test, & Evaluation 3,909,141 2,452,098 2,452,098 1,187,376 1,187,376 FY 2024 Actuals FY 2025 Enacted FY 2025 Supplemental FY 2025 Total FY 2026 Disc Request FY 2026 Reconciliation Request FY 2026 Total UNCLASSIFIED Page 3"
      }
    ]
  },
  {
    "id": "2ce70b2fd3",
    "title": "CRS Insight: The Golden Dome (Iron Dome) for America (Apr 2025)",
    "url": "",
    "doc_date": "2025-04-16",
    "pages": [
      {
        "pageno": 1,
        "text": "CRS INSIGHT Prepared for Members and Committees of Congress INSIGHTi The Golden Dome (Iron Dome) for America: Overview and Issues for Congressional Consideration April 16, 2025 On January 27, 2025, President Trump issued Executive Order (EO) 14186, titled The Iron Dome for America. The EO announced a shift in U.S. missile defense policy, expanding the scope of the homeland missile defense mission and directing the Department of Defense (DOD) to develop “a next generation missile shield.” The EO directed the Secretary of Defense to submit several deliverables to begin implementing this new policy. In February 2025, the executive branch redubbed the project “Golden Dome for America.” Some Members of Congress have asserted Golden Dome’s potential benefit to homeland defense and have introduced legislation to support it. Other Members have questioned its possible effects on strategic stability—that is, the balance of capabilities and policies among potential adversaries that diminishes incentives for engaging in a nuclear arms race or nuclear use. Projected costs, which vary widely, may feature prominently in debates over the FY2026 defense budget. The security benefits, strategic impact, and cost of Golden Dome depend in part on characteristics of the proposed missile shield that have not been publicly detailed. Parts of the EO are stated generally and could be viewed as subject to interpretation. When Members of Congress have sought additional detail in public hearings, DOD officials testifying have largely refrained from commenting. DOD may provide more detail in the deliverables required by the EO, but it is unclear whether DOD will release these deliverables publicly or share them with Congress. Several of these deliverables were due to the President 60 days after the EO was issued. On March 27, it was reported that the President would receive three options for the architecture the following week, and on April 9, a DOD official testified that the Secretary was discussing options with the President. Overview of the Executive Order The EO generally expanded the scope of the U.S. homeland missile defense mission, in terms of the actors and the threats that the United States intends to defend against. The order declared that it is U.S. policy to “deter—and defend its citizens and critical infrastructure against—any foreign aerial attack on the Homeland.” It specified that this policy includes defending “against ballistic, hypersonic, advanced Congressional Research Service https://crsreports.congress.gov IN12544"
      },
      {
        "pageno": 2,
        "text": "Congressional Research Service 2 cruise missiles, and other next-generation aerial attacks from peer, near-peer, and rogue adversaries.” Previously, under the Biden Administration, first Trump Administration, and Obama Administrations, homeland missile defense policy focused on the threat from intercontinental ballistic missiles and emphasized developing capabilities to defend against strikes from rogue states, such as North Korea and Iran, while relying on U.S. nuclear capabilities to deter attacks from peer and near-peer states, such as Russia and China. The EO also directed the Secretary of Defense to take several actions. Within 60 days, the Secretary was to submit to the President • a “reference architecture,” “capabilities-based requirements,” and implementation plan for the “next-generation missile shield”; • “a plan to fund this directive,” submitted with the Office of Management and Budget; • “an updated assessment of the strategic missile threat to the homeland”; and • “a prioritized set of locations to progressively defend against a countervalue attack.” (The term countervalue often refers to nonmilitary targets for nuclear weapons, such as cities and civilian population centers.) Although the EO focused on the U.S. homeland, it also directed the Secretary of Defense to review theater missile defense capabilities. (U.S. policymakers often use the descriptor theater—or regional—to differentiate between defenses tailored for threats abroad versus the U.S. homeland.) The theater missile defense review is to identify opportunities for increased international cooperation on missile defense and improved defense of U.S. forward-deployed troops and allied territories, troops, and populations. Potential Issues for Congress As Congress assesses the Trump Administration’s homeland missile defense plans and their potential budgetary and strategic implications, it may consider the following issues: • How is homeland to be defined? The EO states that the United States will defend against “any foreign aerial attack on the homeland”; it also requires the Secretary of Defense to submit “a prioritized set of locations to progressively defend.” Congress may ask whether the EO proposes defending the entire homeland or a limited set of targets. If the former, how will DOD define the homeland? Neither the EO nor the 2019 Missile Defense Review (MDR), published under the first Trump Administration, includes a definition. The most recent MDR, published under the Biden Administration in 2022, defined homeland missile defense as “the defense of the 50 states, all U.S. territories, and the District of Columbia.” If the EO envisions protecting a limited set of locations, Congress may consider what criteria DOD uses to select those locations. Additionally, some Members may be reluctant to fund a shield that does not expressly aim to protect their constituents. Although both options would require overcoming technological challenges and investing significant resources, defending the entire homeland as defined in the 2022 MDR would likely pose greater technological challenges and require more funding. Some observers have questioned the feasibility or affordability of defending the entire homeland. • What is an acceptable level of risk? Missile defense comes with a degree of risk, meaning some degree of probability that defenses will not succeed in stopping every incoming enemy weapon. While observers might disagree on the extent to which that risk can be reduced through improved technology and increased quantities of defensive systems, most acknowledge that risk cannot be eliminated in its entirety. Congress may"
      },
      {
        "pageno": 3,
        "text": "Congressional Research Service 3 IN12544 · VERSION 1 · NEW • consider how much risk it considers acceptable in homeland missile defense. The answer to that question could have significant budgetary implications because it would affect the mix and quantity of systems. • What is the desired timeline? Some of the more sophisticated capabilities discussed in the EO may have become more technologically feasible due to recent technological advances in areas such as remote sensing, image processing, uncrewed aerial systems, miniaturization of components, and decreased space launch costs. Even so, the Golden Dome architecture could take years to develop and build at the scale that may be suggested. During that time, the Golden Dome initiative would compete for funding against other DOD funding priorities. Congress also may consider second-order issues, including potential responses from competitors, allies, and partners, and requirements for basing, launch platforms, industrial capacity, and manpower. The outcomes for these issues likely depend in part on answers to the aforementioned potential questions. Author Information Hannah D. Dennis Analyst in U.S. Defense Policy Disclaimer This document was prepared by the Congressional Research Service (CRS). CRS serves as nonpartisan shared staff to congressional committees and Members of Congress. It operates solely at the behest of and under the direction of Congress. Information in a CRS Report should not be relied upon for purposes other than public understanding of information that has been provided by CRS to Members of Congress in connection with CRS’s institutional role. CRS Reports, as a work of the United States Government, are not subject to copyr ight protection in the United States. Any CRS Report may be reproduced and distributed in its entirety without permission from CRS. However, as a CRS Report may include copyrighted images or material from a third party, you may need to obtain the permission of the copyright holder if you wish to copy or otherwise use copyrighted material."
      }
    ]
  },
  {
    "id": "dc3f0cf001",
    "title": "NAVSEA Org Chart (Jul 2024)",
    "url": "",
    "doc_date": "2024-07-01",
    "pages": [
      {
        "pageno": 1,
        "text": "NAVAL NUCLEAR PROPULSION SEA 08 – ADM W. HOUSTON COMNAVSUP SYSCOM (ADDU FOR LOG SPT) PEO AIRCRAFT CARRIERS RADM C. MOTON J. MEYER (SES) PEO INTEGRATED WARFARE SYSTEMS RDML T. DICKINSON T. HENDREY (SES) H. BERKOFF (SES) PEO SHIPS RADM T. ANDERSON T. RIVERS (SES) J. BOWARD (SES) PEO UNMANNED & SMALL COMBATANTS RDML K. SMITH M. KIRKENDALL (SES) EXECUTIVE DIRECTOR SEA 00B C. MILLER (SES) CHIEF OF NAVAL OPERATIONS JULY 2024 NUCLEAR POWER TRAINING UNIT CHIEF OF STAFF SEA COS CAPT M. TROY Command Leadership COMMAND DEPUTY EEO SEA 00 ED&I C. WILLIAMS COMMAND JUDGE ADVOCATE SEA 00J CDR T. HUFFSTETLER COMMAND MASTER CHIEF SEA CMC CMDCM B. SCHIMMEL EXECUTIVE ASSISTANT SEA 00EA CAPT J. HALL PEO STRATEGIC SUBMARINES RDML T. WEEKS M. SERMON (SES) COMMAND CLIMATE SPECIALIST SEA 00 CCS AECS A. RUSSELL STAFF CODES OFFICE OF COUNSEL SEA 00L R. CRESSY (SES) NAVY EXPERIMENTAL DIVING UNIT SUPERVISOR OF SALVAGE & DIVING SEA 00C CAPT S. SUAREZ PEO UNDERSEA WARFARE SYSTEMS RDML D. ADAMS M. MCCLATCHEY (SES) SUBMEPP PEO ATTACK SUBMARINES RDML J. RUCKER L. RADOCHA (SES) S. LINK (SES) INSPECTOR GENERAL SEA 00N L. SUCH (acting) INDUSTRIAL FIRE SAFETY ASSURANCE GROUP SEA 00FS CAPT R. VALLETTA (acting) WARFIGHTING READINESS SEA 00R RDML R. DODSON ASN, RD&A COMMANDER NAVAL SEA SYSTEMS COMMAND SEA 00 VADM J. DOWNEY COMNAVWAR SYSCOM (ADDU FOR C4I) DIRECTORATES ECHELON III OTHER PEOs LEGEND DRPM AUKUS I&A RDML L. REIFSTECK M. ATKINS (SES) CARRIER PLANNING ACTIVITY INDUSTRIAL OPERATIONS SEA 04 RDML S. BROWN K. DAVIS (SES) COMMANDER NAVAL SURFACE WARFARE CENTER NAVAL UNDERSEA WARFARE CENTER RDML T. EVANS M. IRVINE (SES) CONTRACTS SEA 02 K. BOYLES (SES) CAPT J. MCKAY NAVAL SYSTEMS ENGINEERING & LOGISTICS SEA 05 RDML P. SMALL T. PEROTTI (SES) TOTAL FORCE & CORPORATE OPERATIONS SEA 10 J. REESE (SES) COMMANDER NAVY REGIONAL MAINTENANCE CENTER RADM W. GREENE E. LIND (SES) UNDERSEA WARFARE SEA 07 RDML T. WEEKS S. LINK (SES) AEGIS TECHNICAL REPRESENTATIVE SURFACE COMBAT SYSTEMS CENTER AEGIS BMD P. MANN (SES) SURFMEPP SURFACE SHIP MAINTENANCE, MODERNIZATION & SUSTAINMENT SEA 21 RADM W. GREENE L. BONACIC (SES)(acting) NAVAL SHIPYARDS CYBER ENGINEERING & DIGITAL TRANSFORMATION SEA 03 RDML M. RICHMAN M. HERMOSILLA COMPTROLLER SEA 01 D. SULLIVAN (SES) CAPT C. KADING NAVAL ORDNANCE SAFETY & SECURITY ACTIVITY SAFETY & REGULATORY COMPLIANCE SEA 09 S. MCCREARY (SES) K. CLARK (SSTM)(acting) SUPSHIPS SUPERVISOR OF SHIPBUILDING K. DAVIS (SES) INACTIVE SHIPS MANG’T OFFICE RASO SPECIAL ASSISTANT TO THE COMMANDER RDML E. VER HAGE"
      }
    ]
  },
  {
    "id": "c547b01dbe",
    "title": "NAVSEA Org Chart (Oct 2024)",
    "url": "",
    "doc_date": "2024-10-01",
    "pages": [
      {
        "pageno": 1,
        "text": "NAVAL NUCLEAR PROPULSIONSEA 08 – ADM W. HOUSTONCOMNAVSUP SYSCOM COMNAVSUP SYSCOM (ADDU FOR LOG SPT) PEO AIRCRAFT CARRIERSRADM C. MOTONJ. MEYER (SES) PEO INTEGRATED WARFARE SYSTEMSRDML T. DICKINSONT. HENDREY (SES)H. BERKOFF (SES)J. BOWARD (SES) PEO SHIPSRADM T. ANDERSONT. RIVERS (SES)J. BOWARD (SES) PEO UNMANNED & SMALL COMBATANTSRDML K. SMITHM. KIRKENDALL (SES) EXECUTIVE DIRECTOR SEA 00B C. MILLER (SES) CHIEF OF NAVAL OPERATIONSOCTOBER 2024 NUCLEAR POWER TRAINING UNIT CHIEF OF STAFFSEA COSVACANTCommand Leadership COMMAND DEPUTY EEOSEA 00 ED&IC. WILLIAMS COMMAND JUDGE ADVOCATESEA 00JCDR T. HUFFSTETLER COMMAND MASTER CHIEFSEA CMCCMDCM B. SCHIMMEL EXECUTIVE ASSISTANTSEA 00EACAPT J. HALL PEO STRATEGIC SUBMARINESRDML T. WEEKSM. SERMON (SES) COMMAND CLIMATE SPECIALISTSEA 00 CCSAECS A. RUSSELL STAFF CODES OFFICE OF COUNSELSEA 00LR. CRESSY (SES) NAVY EXPERIMENTAL DIVING UNIT SUPERVISOR OF SALVAGE & DIVINGSEA 00CCAPT S. SUAREZM. MCCLATCHEY (SES) PEO UNDERSEA WARFARE SYSTEMSRDML D. ADAMSM. MCCLATCHEY (SES) SUBMEPPS. LINK (SES) PEO ATTACK SUBMARINESRDML J. RUCKERL. RADOCHA (SES)S. LINK (SES) INSPECTOR GENERALSEA 00NL. SUCH (acting) INDUSTRIAL FIRE SAFETY ASSURANCE GROUPSEA 00FSCAPT R. VALLETTA (acting) WARFIGHTING READINESSSEA 00RRDML R. DODSON ASN, RD&A COMMANDERNAVAL SEA SYSTEMS COMMANDSEA 00 VADM J. DOWNEYCOMNAVWAR SYSCOM COMNAVWAR SYSCOM (ADDU FOR C4I) DIRECTORATES ECHELON III OTHER PEOsLEGEND DRPM AUKUS I&ARDML L. REIFSTECKM. ATKINS (SES) CARRIER PLANNING ACTIVITY INDUSTRIALOPERATIONSSEA 04RDML S. BROWNK. DAVIS (SES) COMMANDERNAVAL SURFACE WARFARE CENTERNAVAL UNDERSEA WARFARE CENTERRDML T. EVANSM. IRVINE (SES) CONTRACTSSEA 02K. BOYLES (SES)CAPT R. PERRY NAVAL SYSTEMS ENGINEERING & LOGISTICSSEA 05RDML P. SMALLT. PEROTTI (SES) TOTAL FORCE & CORPORATE OPERATIONSSEA 10J. REESE (SES)NAVY REGIONAL MAINTENANCE CENTER COMMANDERNAVY REGIONAL MAINTENANCE CENTER RADM W. GREENEE. LIND (SES) UNDERSEAWARFARESEA 07RDML T. WEEKSS. LINK (SES) AEGIS TECHNICAL REPRESENTATIVE SURFACE COMBAT SYSTEMS CENTER AEGIS BMDP. MANN (SES) SURFMEPPSURFACE SHIP MAINTENANCE, SURFACE SHIP MAINTENANCE, MODERNIZATION & SUSTAINMENTSEA 21RADM W. GREENE L. BONACIC (SES) NAVAL SHIPYARDS CYBER ENGINEERING & DIGITAL TRANSFORMATIONSEA 03M. HERMOSILLAVACANT COMPTROLLERSEA 01D. SULLIVAN (SES)CAPT C. KADING NAVAL ORDNANCE SAFETY& SECURITY ACTIVITY SAFETY & REGULATORY COMPLIANCESEA 09S. MCCREARY (SES)K. CLARK (SSTM)(acting) SUPSHIPS SUPERVISOR OF SHIPBUILDINGK. DAVIS (SES) INACTIVE SHIPS MANG’T OFFICE RASO NAVSEA VICECOMMANDER (ACTING) CAPT B. METCALF"
      }
    ]
  },
  {
    "id": "1a9c663ce1",
    "title": "PEO STRI Org Charts (Sep 10, 2025)",
    "url": "",
    "doc_date": "2025-09-10",
    "pages": [
      {
        "pageno": 1,
        "text": "MR. MARWANE BAHBAZ CHIEF TECHNOLOGY OFFICER MS. SHERI PETERS STRATEGIC INITIATIVES GROUP CHIEF MR. BILL BEVERIDGE EXECUTIVE OFFICER MR. STEVE MEINTS CHIEF COUNSEL (ACTING) MR. NELSON MAISONET CHIEF INFORMATION OFFICER (G6) MR. DONNIE RYAN PUBLIC AFFAIRS OFFICER Last updated: 10 SEP 2025 SGM CHARLES W. HOUSTON III SENIOR ENLISTED ADVISOR ORGANIZATION CHART MR. LEE A. JAMES III, SES DEPUTY PROGRAM EXECUTIVE OFFICER BG CHRISTINE A. BEELER PROGRAM EXECUTIVE OFFICER Distribution A: Approved for Public Release Distribution A: Approved for Public Release PM TRADE Project Manager Training Devices MR. MICHAEL WILLOUGHBY PROJECT LEAD TADSS SUPPORT OPERATIONS PL TSO Project Lead Training Aids, Devices, Simulators and Simulations (TADSS) Support Operations MR. DARIN STEVENS PRODUCT LEAD LIVE TRAINING AND COMBAT TRAINING CENTERS MR. STEVE BUSHWAY PRODUCT LEAD CONSTRUCTIVE, COLLECTIVE AND RANGES MR. CHRISTOPHER DUNLAP PRODUCT LEAD GLOBAL OPERATIONS (ACTING) MR. DALE WHITTAKER PROJECT LEAD INTERNATIONAL PROGRAM PL IPO Project Lead International Program Office MR. KEITH DUNSON PRODUCT LEAD INTERNATIONAL PROGRAM GROUND LTC MINDY BROWN PRODUCT MANAGER SYNTHETIC WARRIOR SYSTEMS PM SE Project Manager Synthetic Environment LTC JAMES STAGGS PRODUCT MANAGER COMMON SYNTHETIC ENVIRONMENT MR. BRENT BELL JR. PRODUCT DIRECTOR NEXT GENERATION CONSTRUCTIVE PM SE Project Manager Synthetic Environment PM CT2 Project Manager Cyber, Test, and Training LTC ZACHARY P. YOKLIC PRODUCT MANAGER FORCES TRAINING SYSTEMS MR. BEN PRYOR PRODUCT MANAGER CYBER RESILIENCY AND TRAINING MR. BRADLEY HORTON DIRECTOR THREAT SYSTEMS MANAGEMENT OFFICE MR. KYLE PLATT DIRECTOR INSTRUMENTATION MANAGEMENT OFFICE COL NATASHIA L. COLEMAN PROJECT MANAGER CYBER, TEST, AND TRAINING MR. JOHN GILLETTE PROJECT MANAGER SYNTHETIC ENVIRONMENT MR. RODNEY JOYNER PRODUCT LEAD INTERNATIONAL PROGRAM TRAIN, ADVISE, ASSIST AND MENTOR MR. JOHNNY FIGUEROA PRODUCT DIRECTOR VIRTUAL TRAINING SYSTEMS MS. LIZ BLEDSOE PROJECT MANAGER TRAINING DEVICES MR. STEPHEN MCFARLANE PRODUCT MANAGER TACTICAL TRAINING SYSTEMS LTC JENNIFER BREWSTER PRODUCT MANAGER COMBAT TRAINING INSTRUMENTATION SYSTEMS MR. MICHAEL POWELL PRODUCT MANAGER SYNTHETIC TRAINING ENVIRONMENT LIVE TRAINING SYSTEMS MS. DESTINY LASKI PROJECT LEAD ENTERPRISE TRANSFORMATION & INTEGRATION (ACTING) PL ETI Project Lead Enterprise Transformation and Integration MR. MATT HOPKINS PRODUCT LEAD UNITE (ACTING) LTC BRIAN B. VARNS PRODUCT LEAD SIMCI / FA-57 MR. TODD KOSIS PRODUCT LEAD CONSTRUCTIVE SIMULATION SUPPORT MS. CHRISTINA BELL DEPUTY PROJECT LEAD INTERNATIONAL PROGRAM MR. SCOTT PULFORD DEPUTY PROJECT MANAGER SYNTHETIC ENVIRONMENT MR. JUSTIN FORTUNE DEPUTY PROJECT LEAD TADSS SUPPORT OPERATIONS MS. DESTINY LASKI DEPUTY PROJECT MANAGER CYBER, TEST, AND TRAINING (ACTING) MR. AARON BROWN DEPUTY PROJECT MANAGER TRAINING DEVICES VACANT DEPUTY PROJECT LEAD ENTERPRISE TRANSFORMATION AND INTEGRATION DR. JEREMY LANMAN ASSISTANT PROGRAM EXECUTIVE OFFICER MS. SHELLY MOORE DIRECTOR PERSONNEL RESOURCES (G1) MR. D. SHANE MARKLEY DIRECTOR SECURITY (G2) MR. M. BRANDON GARNER DIRECTOR OPERATIONS (G3) MR. ROBERT BRIAR DIRECTOR PRODUCT SUPPORT (G4) MR. RODNEY FIGAROA DIRECTOR ACQUISITION (G5) MR. BRUCE DELAPORTE DIRECTOR TALENT MANAGEMENT (G7) MS. PRIMILA RAJAKULASINGHAM DIRECTOR BUSINESS MANAGEMENT (G8) MR. ZACHARY LINDSAY DIRECTOR WARFIGHTER TRAINING AND READINESS SOLUTIONS MR. JOSEPH ORSI PRODUCT LEAD INTERNATIONAL PROGRAM AVIATION"
      }
    ]
  },
  {
    "id": "398f199229",
    "title": "CRS: Golden Dome Related Products (Jun 2025)",
    "url": "",
    "doc_date": "2025-06-24",
    "pages": [
      {
        "pageno": 1,
        "text": "Golden Dome: Related CRS Products June 24, 2025 Congressional Research Service https://crsreports.congress.gov R48584"
      },
      {
        "pageno": 2,
        "text": "Golden Dome: Related CRS Products Contents Golden Dome (Specific) ........................................................................................................... 1 Air and Missile Defense (General) ............................................................................................ 1 Related Defense Agencies ......................................................................................................... 2 Threat Assessments ................................................................................................................... 2 Other Related Products ............................................................................................................. 2 Contacts Author Information .......................................................................................................................... 3"
      },
      {
        "pageno": 3,
        "text": "Golden Dome: Related CRS Products Congressional Research Service 1 n January 27, 2025, President Donald J. Trump issued an executive order directing the Department of Defense to develop and implement a homeland missile defense architecture to defend against “ballistic, hypersonic, advanced cruise missiles, and other next- generation aerial attacks from peer, near-peer, and rogue adversaries.”1 On May 20, 2025, President Trump asserted that this “Golden Dome for America” concept would cost $175 billion, and be completed by the end of his term.2 Other cost and timeline estimates have exceeded those of President Trump.3 The Golden Dome concept and the Trump Administration’s approach to homeland missile defense introduces several potential oversight and funding issues for Congress. This report compiles a selection of CRS products on various aspects of U.S. homeland air and missile defense. To contact the authors of these CRS products, congressional staff may use the contact information provided in the links below. Golden Dome (Specific) CRS Insight IN12544, The Golden Dome (Iron Dome) for America: Overview and Issues for Congressional Consideration, by Hannah D. Dennis CRS Insight IN12568, Golden Dome: Potential Strategic Stability Considerations for Congress, by Anya L. Fink Air and Missile Defense (General) CRS In Focus IF10541, Defense Primer: U.S. Ballistic Missile Defense, by Hannah D. Dennis CRS In Focus IF11623, Hypersonic Missile Defense: Issues for Congress, by Hannah D. Dennis, Jennifer DiMascio, and Kelley M. Sayler CRS Report R48477, Department of Defense Counter Unmanned Aircraft Systems: Background and Issues for Congress, by Daniel M. Gettinger CRS In Focus IF11882, Defense Primer: Directed-Energy Weapons, by Kelley M. Sayler CRS Report R46925, Department of Defense Directed Energy Weapons: Background and Issues for Congress, coordinated by Kelley M. Sayler 1 Executive Order 14186 of January 27, 2025, “The Iron Dome for America,” 90 Federal Register 8767, February 3, 2025, https://www.federalregister.gov/documents/2025/02/03/2025-02182/the-iron-dome-for-america. The Trump Administration initially called this effort “The Iron Dome for America,” and subsequently renamed it “The Golden Dome for America.” See, for example, U.S. Department of Defense, “Secretary of Defense Pete Hegseth Statement on Golden Dome for America,” press release, May 20, 2025, https://www.defense.gov/News/Releases/Release/Article/ 4193417/secretary-of-defense-pete-hegseth-statement-on-golden-dome-for-america/. 2 The White House, “President Trump Makes an Announcement with the Secretary of Defense,” video, May 20, 2025, https://www.whitehouse.gov/videos/president-trump-makes-an-announcement-with-the-secretary-of-defense/. 3 For example, in May 2025, the Congressional Budget Office (CBO) updated findings from 2004 and 2012 studies that assessed the cost of various space-based interceptor (SBI) architectures to counter the North Korean missile threat. (President Trump has mentioned SBIs will be part of Golden Dome.) CBO found that, depending on the desired architecture and certain assumptions made about SBI technology and despite decreasing launch costs, the notional architectures assessed in the 2004 and 2012 studies could cost from $160.7 billion to $542.4 billion over 20 years. In addition, these notional constellations were not sized for the threat posed by North Korea in 2025, nor the threat posed by all aerial threats in 2025. CBO noted that “North Korea is probably now capable of launching attacks with enough ICBMs to overwhelm the SBI defenses examined in [previous studies].” Letter from Phillip L. Swagel, director of CBO, to Senator Deb Fischer, chair, Subcommittee on Strategic Forces, Senate Committee on Armed Services, and Senator Angus S. King Jr., ranking member, Subcommittee on Strategic Forces, Senate Committee on Armed Services, May 5, 2025, https://www.cbo.gov/system/files/2025-05/61237-SBI.pdf. O"
      },
      {
        "pageno": 4,
        "text": "Golden Dome: Related CRS Products Congressional Research Service 2 CRS Report R47643, Guam: Defense Infrastructure and Readiness, by Andrew Tilghman CRS Report RL33745, Navy Aegis Ballistic Missile Defense (BMD) Program: Background and Issues for Congress, by Ronald O'Rourke CRS In Focus IF12645, The Terminal High Altitude Area Defense (THAAD) System, by Andrew Feickert Related Defense Agencies CRS Report R47620, Canada: Background and U.S. Relations, coordinated by Peter J. Meyer (see, in particular, the section on the North American Aerospace Defense Command, or NORAD) CRS In Focus IF12610, Defense Primer: The United States Space Force, by Hannah D. Dennis CRS In Focus IF12840, Defense Primer: U.S. Space Command (SP ACECOM), by Robert Switzer and Jennifer DiMascio CRS In Focus IF12981, Defense Primer: U.S. Strategic Command (STRATCOM), by Anya L. Fink and Robert Switzer Threat Assessments CRS In Focus IF11737, China: Nuclear and Missile Proliferation, by Paul K. Kerr CRS In Focus IF12621, Congressional Commission on the U.S. Strategic Posture, by Anya L. Fink CRS In Focus IF11459, Defense Primer: Hypersonic Boost-Glide Weapons, by Kelley M. Sayler CRS Report R45811, Hypersonic Weapons: Background and Issues for Congress, by Kelley M. Sayler CRS In Focus IF13035, Iran’ s Ballistic Missile Programs: Background and Context, by Daniel M. Gettinger and Clayton Thomas CRS In Focus IF10472, North Korea’ s Nuclear Weapons and Missile Programs, by Mary Beth D. Nikitin CRS In Focus IF12672, Russia’ s Nuclear Weapons, by Anya L. Fink CRS In Focus IF12964, U.S.-Russian Nuclear Arms Control: Overview and Potential Considerations for Congress, by Anya L. Fink Other Related Products CRS In Focus IF12817, Defense Primer: Joint Capabilities Integration and Development System (JCIDS), by Alexandra G. Neenan CRS In Focus IF11697, Defense Primer: Nuclear Command, Control, and Communications (NC3), by Anya L. Fink CRS In Focus IF10519, Defense Primer: Strategic Nuclear Forces, by Anya L. Fink CRS Report R48559, Proposed Spectrum Provisions in the House Reconciliation Bill (H.R. 1), by Jill C. Gallagher CRS In Focus IF12350, Repurposing 3.1-3.55 GHz Spectrum: Issues for Congress, by Jill C. Gallagher"
      },
      {
        "pageno": 5,
        "text": "Golden Dome: Related CRS Products Congressional Research Service R48584 · VERSION 2 · NEW 3 Author Information Hannah D. Dennis Analyst in U.S. Defense Policy Brendan W. McGarry Section Research Manager Disclaimer This document was prepared by the Congressional Research Service (CRS). CRS serves as nonpartisan shared staff to congressional committees and Members of Congress. It operates solely at the behest of and under the direction of Congress. Information in a CRS Report should not be relied upon for purposes other than public understanding of information that has been provided by CRS to Members of Congress in connection with CRS’s institutional role. CRS Reports, as a work of the United States Government, are not subject to copyright protection in the United States. Any CRS Report may be reproduced and distributed in its entirety without permission from CRS. However, as a CRS Report may include copyrighted images or material from a third party, you may need to obtain the permission of the copyright holder if you wish to copy or otherwise use copyrighted material."
      }
    ]
  }
]